[
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAAC1WRerAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAFiHMsfR5kdGhOJh1qzu6mU=",
    "from": "frida.johansson@fmsend.eu",
    "to": "m.neu@lcwmail.com",
    "reply_to": "frida.johansson@promoteinternational.com",
    "in_reply_to": "N/A",
    "subject": "Regarding my last email",
    "body": "You don't often get email from frida.johansson@fmsend.eu. \nLearn why this is important\nHi Melissa,\n \nI trust you're well.\n \n \nI wanted to reach out as a follow-up to my previous email and see if this might be of interest to you.\nI believe the Promote platform can be a valuable asset within your organization. The platform is an\n \nAI-powered tool for \neffective learning\n, with a strong emphasis on \nmeasurable behavioral application\n.\nAre you interested in trying the platform? I'd be happy to schedule a demo with me or one of my colleagues. \n \n \nLooking forward to hearing from you!\n \n \n \n \nHave a great day!\n    \n \nFrida Johansson\nPromote Platform Specialist\nPromote International\nSlussplan 9\n111 30 Stockholm, Sweden\nTry the platform\nwww.promoteint.com\n \nMessage sent by Promote International at Slussplan 9, 111 30 Stockholm, Stockholms län, Sweden. \n  Don't want to receive emails from us? Manage your email preferences \nhere\n.",
    "received_at": "2024-05-07T14:42:43+00:00",
    "sent_at": "2024-05-07T14:42:26+00:00",
    "date_extracted": "2025-04-02T20:00:05.399661"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAAC1WReqwAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQACarKXBznPNNnCB2D7nxqos=",
    "from": "teams@communication.microsoft.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "teams@communication.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Have you met the new Microsoft Teams?",
    "body": "You don't often get email from teams@communication.microsoft.com. \nLearn why this is important\nUsers of new Teams are finding more focus and fun across work, school, and life. We’re listening to the 320 million people who rely on Teams every month and sharing some of the experiences they love most for you to go try. \n \n \nHave you met the new Microsoft Teams?\n \nUsers of new Teams are finding more focus and fun across work, school, and life. We’re listening to the 320 million people who rely on Teams every month and sharing some of the experiences they love most for you to go try. \nNew to new Teams?\nAs the world continues to evolve, Teams is here to be your modern workplace. Check out the video to learn more about the new and unique experiences we’re building for new Teams.\n \nFan favorites\n \n \nCelebrate success using Together Emojis\nFoster shared sentiments and a sense of belonging. Simply type (highfive) to initiate a virtual high-five, and your colleagues can join in the fun by typing (highfive) for a group cheer. \nLearn more\nExpress who you are through Teams backgrounds \nChange what appears behind you in your video meeting or call. You can blur your background, replace it entirely with any image you want, or use a Teams virtual background template. \nLearn more\nLet AI filter out the background noise from wherever you work\nWorking in a busy coffee shop? Taking your call from the airport? Turn on voice isolation to eliminate unwanted background noise and other voices that can interfere with your Teams calls and meetings.\nLearn more\nThese are just a few of the great features that our users love. Visit the \nTeams website\n to discover even more. Your next productivity breakthrough awaits!\n \nThis email is generated from an unmonitored alias. Please do not reply. \nUnsubscribe\n | \nPrivacy Statement\n \nMicrosoft Corporation, One Microsoft Way, Redmond, WA 98052 USA",
    "received_at": "2024-05-06T22:26:46+00:00",
    "sent_at": "2024-05-06T22:26:39+00:00",
    "date_extracted": "2025-04-02T20:00:05.543703"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAAC1WReqgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQALpu2VPvqOdDsD1Ioc9R-0M=",
    "from": "ldekleva@socialenterprise.us",
    "to": "m.neu@lcwmail.com",
    "reply_to": "ldekleva@socialenterprise.us",
    "in_reply_to": "N/A",
    "subject": "Simple and affordable verification for social enterprises",
    "body": "Hi Melissa,\nAs a part of the social enterprise movement, I'm sure you're aware of the need for a global standard by which we can objectively evaluate our impact and advocate for a more equitable way of doing business.\nThat's exactly why I'm excited to share with you about \nPeople and Planet First\n, a verification system pioneered by the Social Enterprise World Forum to unite the global movement of transforming business and building an economy for everyone to thrive, within the means of our living planet. SEA is thrilled to partner with People and Planet First to bring this Verification to impactful organizations and businesses within the United States.\nThe verification process is simple and affordable, and in addition to building the global movement, offers additional benefits to verified enterprises, including access to tools, resources, recognition and markets.\nYou can learn more \nhere\n. If you're ready to begin your application, start by creating a profile with Good Market \nhere\n. And please feel free to reach out to me with any questions!\nCheers,\nLauren Dekleva Haynes\nCommunity Manager\nSocial Enterprise Alliance\nldekleva@socialenterprise.us",
    "received_at": "2024-05-06T17:36:24+00:00",
    "sent_at": "2024-05-06T17:36:05+00:00",
    "date_extracted": "2025-04-02T20:00:06.085242"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAAC1WReqQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQACigETAdSgpDg2VDcRnaiUo=",
    "from": "no-reply@youexec.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "no-reply@youexec.com",
    "in_reply_to": "N/A",
    "subject": "🎒 Data charts",
    "body": "How to communicate data effectively and translate them into actionable items? This collection of...\n \n \nPRESENTATIONS\nData Visualization Charts (Part 2) \nNew!\n \n \nHow to communicate data effectively and translate them into actionable items? This collection of data visualization charts addresses this hurdle with a variety of charts, graphs, tables, and...\nDownload template \nShare \nPRESENTATIONS\nData Visualization Charts \n \nHow to communicate data effectively and translate them into actionable items? This collection of data visualization charts addresses this hurdle with a variety of charts, graphs, tables, and...\nDownload template \nShare \nPRESENTATIONS\nCharts Collection (Part 2) \n \nCommunicate your data effectively without spending hours to draw and design charts from scratch. This Charts Collection features some of the most commonly used charts that you can simply copy and...\nDownload template \nShare \nPRESENTATIONS\nCharts Collection (Part 1) \n \nYou can now save hours of work with our ultimate Charts Collection. This deck includes a variety of useful charts that you can copy and paste into any presentation. You can also edit the data of...\nDownload template \nShare \nNot relevant? \nPersonalize\n future emails. \nYou Exec LLC, 18 Bartol St. #1090 San Francisco, CA 94133. Do not reply to this email. \nTo stop receiving these emails, \nunsubscribe\n. Have questions? \nContact us\n.",
    "received_at": "2024-05-06T13:13:11+00:00",
    "sent_at": "2024-05-06T13:13:05+00:00",
    "date_extracted": "2025-04-02T20:00:05.975884"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAAC1WReqAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAKyxnFLD-PdOr0LHMiS0cIM=",
    "from": "ci@sietareu.org",
    "to": "m.neu@lcwmail.com",
    "reply_to": "ci@sietareu.org",
    "in_reply_to": "N/A",
    "subject": "Curiously Intercultural Monthly Update",
    "body": "You don't often get email from ci@sietareu.org. \nLearn why this is important\nRead the latest from Curiously Intercultural\n \nView this email in your browser\n \n \nPromoting an exchange of ideas among the interculturally curious\nDear Melissa,\nCurious about news in the intercultural field and what is going on in the SIETAR community? We have compiled the latest posts from SIETAR Europa's rolling platform Curiously Intercultural for you. We invite you to check them out and join the intercultural conversation! \nHot Topic: Migration\nPublished Apr 23, 2024 06:34 pm\nWe are pleased to officially announce the new Hot Topic for the upcoming months -  Migration, and invite those researching or working in this field to share their experience and expertise with our readers by emailing us at ci@sietareu.org.\nIdeas and articles traverse borders more effortlessly than individuals do, and they have the potential to inspire and unite people worldwide by addressing the challenges faced by migrants and creating a happier, more prosperous and harmonious global community.\nRead, engage and contribute to this Hot Topic and conversation that are shaping our global society!\nThe post \nHot Topic: Migration\n appeared first on \nSIETAR Europa\n.\nNurturing Global Citizens: A Family’s Journey Through the World of Third Culture Kids\nPublished Apr 17, 2024 06:53 pm\nIn an increasingly interconnected world, the concept of global citizenship has never been more important. My personal journey, intertwined with the upbringing of my children, Alexander and Elias, serves as a vivid illustration of nurturing global citizens. As a family, we have navigated the complex yet enriching path of Third Culture Kids (TCKs), a term popularized by David C. Pollock, Ruth E. Van Reken, and Michael V. Pollock to describe individuals who spend a significant part of their childhood outside their parents' passport countries...\nThe post \nNurturing Global Citizens: A Family’s Journey Through the World of Third Culture Kids\n appeared first on \nSIETAR Europa\n.\n  \nMore Articles:\nFASHIONing Identities Through Cultural Filters\nGenerative AI and Intercultural Communication: What’s in for the Trainers?\nThe Greening of SIETAR\nChinese New Year Special: Enter the Dragon and Other Zodiac Signs\nLiving within diversities. Cultures and new complexities. An international conference by Fondazione Intercultura. Florence, April 4-6, 2024\nWith our best wishes,\nThe Curiously Intercultural Editorial Team\n  \nCuriously Intercultural is an \naudience-driven platform\n for the SIETAR community and beyond. Audience-driven means driven \nby you\n, our members and fellow interculturalists!\nWe invite you to share your intercultural experiences, ideas and research by publishing them on Curiously Intercultural.\nPlease submit your proposal to \nci@sietareu.org\n.\n \n \n \n \nCopyright © 2024 SIETAR EUROPA, All rights reserved.\n \nSIETAR \nOur mailing address is:\n \nSIETAR EUROPA\n \n637 Boulevard de la Tavernière, F-06210 Mandelieu la Napoule (France),\nMandelieu la Napoule\n \nF-06210\n \nFrance\nAdd us to your address book\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-05-06T10:01:12+00:00",
    "sent_at": "2024-05-06T10:00:58+00:00",
    "date_extracted": "2025-04-02T20:00:06.556377"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAAC1VE1EQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQANEVfc7JksBFqoprBqIMulk=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "Training Industry Weekly Recap 📅 May 5, 2024",
    "body": "Conversation series on inclusive training, TICE keynotes and more.\nView this email in your browser\nTHE BUSINESS OF LEARNING™\nAs we continue to explore generative artificial intelligence (AI) tools, it’s important for learning leaders to leverage these tools to be more efficient and effective while also being mindful of their risks and limitations.\nOur featured articles offer tips for improving training with generative AI tools as well as addressing AI-generated challenges. Check out \nthis week’s selection\n for insights on utilizing AI for personalized coaching and supporting neurodivergent employees as well as tips on how to address AI’s role in financial fraud and a growing leadership skills gap.\nWe hope these resources will help you make the most of AI and improve your L&D strategy!\nHelp us improve our content and bring you more of what you need! Send your feedback to \neditor@trainingindustry.com\n.\nJenny Ayers\nAssociate Editor \n[Conversation Series] Inclusive Growth: Strategies for Cross-Cultural Training\nJoin us on May 16 for \na panel discussion\n exploring the increasingly diverse workplace demographics and their implications for L&D leaders. This conversation will delve into language barriers, cross-cultural communication and global training trends, emphasizing inclusive training strategies. Our expert panelists from Getty Images, IBM Consulting and Guardian General Insurance will provide real-world insights and practical advice. Equip yourself with the tools and knowledge to navigate the complexities of global training—register today!\nRegister Now\n \nTICE Keynotes: Ignite Your L&D Strategy With Expert Insights\nJoin us at the \nTraining Industry Conference & Expo (TICE)\n next month for a series of inspiring keynote sessions that will redefine your L&D strategy. Geolab’s CEO, Kian Gohar, opens with insights on AI and human collaboration, followed by a keynote panel on day two, and concluding with Dr. Keith Keating's empowering talk on evolving L&D leadership. Don’t miss this opportunity to spark your strategic thinking and grow your network. See you June 4-6 in Raleigh, N.C.!\nLearn More\n \nYou’re Invited! Share L&D Insights in Our Pulse Survey\nHelp us better understand the needs of learning professionals! Participate in our survey and contribute your valuable insights into the current state of training and development. Your input is crucial as we explore ongoing challenges and initiatives within L&D. \nThis short survey\n takes just five minutes and offers a chance to influence key research that informs best practices across the industry. Share your perspective and help us capture the pulse of the L&D market.\nComplete Survey\n \nPERSONALIZATION AND LEARNING PATHWAYS \nAI Use Cases in L&D, Part 3: Personalized Coaching and Feedback at Scale\nLearn how AI-enabled tools can support personalized coaching and feedback at scale.\nRead Now →\nSALES \nEngaging Customer Sponsors and Past Proven Value for Sales Momentum and Account Expansion\nSales training professionals must ensure their teams fully understand the importance of customer sponsors and tools they need for expansion.\nRead Now →\nPERSONALIZATION AND LEARNING PATHWAYS \nBreaking Down Complex Subjects With Learning Pathways\nLearning pathways are used not only to clarify complex subjects but also to increase engagement and effectively aid in knowledge retention.\nRead Now →\nLEADERSHIP \nThe Critical Leadership Gap Amid the Generative AI Revolution\nBeyond the good that emerging generative AI technologies can drive, there are also very real, very substantial downside risks that must be understood, managed and mitigated.\nRead Now →\nSTRATEGY, ALIGNMENT AND PLANNING \nIn an Age of Continuous Change, We Need Transformative Learning\nTraditional models of learning that focus on knowledge, skills and attitudes are inadequate to prepare individuals for dramatic change.\nRead Now →\nWORKFORCE DEVELOPMENT \nThe Importance of Safety Excellence in Manufacturing\nAchieving and sustaining safety excellence is a business imperative to protect employee lives and health and ensure excellence in environmental, health and safety.\nRead Now →\nLEARNING TECHNOLOGIES \nChoosing and Launching Your First LMS: 8 Steps for Success\nSelecting and implementing a new LMS isn't easy: Follow these steps to get started and set yourself up for a successful launch.\nRead Now →\nDIVERSITY, EQUITY AND INCLUSION \nAI-Enabled Tools for Neurodivergent Professionals\nArtificial intelligence (AI)-enabled tools can provide support for neurodivergent professionals by offering features tailored to their needs.\nRead Now →\nCOMPLIANCE \nCaught in the Web: Examining AI's Complicated Relationship With Financial Fraud\nIntegrating fraud prevention with financial crime initiatives strengthens defenses against AI and fosters collaboration to mitigate risk.\nRead Now →\nMEASUREMENT AND ANALYTICS \nHow Data Technology Is Reinventing Performance Reviews for the Better\nThis article shares tips on how data technology can improve managers' approach to conducting equitable employee performance reviews.\nRead Now →\nTHE BUSINESS OF LEARNING:\nTHE TRAINING INDUSTRY PODCAST\nEpisode 74: Leading and Working Across Generations\n \nEpisode 73: The State of DEI Training in 2024\n \nEpisode 72: What’s Next in Learning Tech? Exploring Learning Technology Trends and Innovations\nEpisode 71: Learning Reinforcement — Delivering Training That “Sticks”\n \nTRAINING INDUSTRY RESEARCH\nNavigating the L&D Tech Stack: Strategies for Modern Organizations\nLearning Measurement for Modern Businesses: Making Sense of ISO 30437\n[State of the Industry Report] The Leadership Training Market\n[State of the Industry Report] The Sales Training Market\n \nExplore Research\nUPCOMING WEBINARS\nMay 8, 2024 | 11:00 a.m. ET \n[Leader Talk] Finding Success Through Adaptive Learning\nRegister Now →\n \n \nMay 9, 2024 | 1:00 p.m. ET \n[Product Demo] Harnessing AI to Tackle Front-Line and Leader Learning Challenges\nRegister Now →\n \n \nTRAINING INDUSTRY COURSES\n \nCPTM PRACTICUMS\nMay 6-9, 2024\nMay 13-16, 2024\nJune 1-3, 2024\nJune 10-13, 2024\nJune 11-14, 2024\nJune 24-27, 2024\nJuly 15-18, 2024\nJuly 22-25, 2024\n \nCERTIFICATES\nCompetency Modeling\nMay 6-7, 2024\nDevelopment and Delivery\nMay 8-9, 2024\nLearning Technologies\nMay 21-22, 2024\nNeeds Assessment\nJune 13-14, 2024\nMeasuring Impact\nJune 17-18, 2024\nLeadership Development\nJuly 29-30, 2024\n \nAGILE CERTIFICATION\nMay 14-16, 2024\nAug. 6-8, 2024\nOct. 15-17, 2024\nDec. 10-12, 2024\n \nWORKSHOPS\nLearning Analytics\nMay 20, 2024\nDesign Thinking\nJune 20, 2024\nInternal Consulting\nJuly 17, 2024\nStrategic Planning\nJuly 29, 2024\nRemote Learning\nNov. 6, 2024\nThe \ntiming of our courses\n is meant to be convenient for you and work for all time zones and work schedules. \nPlease let us know\n if you are struggling to find a course for you.\nDive Into L&D’s Most Relevant Content!\nCompliance\n \nContent Development\n \nDiversity, Equity and Inclusion\n \nIT and Technical Training\nLeadership\n \nLearning Services and Outsourcing\nLearning Technologies\n \nMeasurement and Analytics\n \nOnboarding\n \nPerformance Management\n \nPersonalization and Learning Pathways\nProfessional Development\n \nRemote Learning\nSales\n \nStrategy, Alignment and Planning\n \nWorkforce Development\n \nArticles\nWebinars\nThe Business of Learning Podcast\nResearch\nMagazine\nStore\nAnti-racism Resources\nWhat did you think of this newsletter?\nExcellent! \nNot My Favorite..\n.\n \nDid a friend forward this newsletter to you? \nYou can subscribe here\n.\nConnect With Us\nFacebook\n | \nTwitter\n | \nLinkedIn\n | \nInstagram\nEditorial\nContact an editor\nAdvertising\nContact our team\n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ninfo@trainingindustry.com\n1.866.298.4203\n \n \n© 2024 Training Industry, Inc.\nEngage with more than 250,000 corporate training leaders.\nGet the \nmedia kit\n or contact us directly at \ninfo@trainingindustry.com\nupdate subscription preferences",
    "received_at": "2024-05-05T22:19:53+00:00",
    "sent_at": "2024-05-05T22:19:44+00:00",
    "date_extracted": "2025-04-02T20:00:06.580500"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAAC1L9OZAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAGm8BVTQvZlDhohNsDOLfpQ=",
    "from": "admin@worldtrademarkreview.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "admin@worldtrademarkreview.com",
    "in_reply_to": "N/A",
    "subject": "Extra use of TM symbol; insights from EUIPO head, General Court judges and Nestlé; how to litigate in India; and much more",
    "body": "WTR SUNDAY DIGEST\n05 May 2024\n \n \nExtra use of TM symbol; insights from EUIPO head, General Court judges and Nestlé; how to litigate in India; and much more\n \nEverything we covered on WTR over the past seven days, and all you need to know from the world of trademarks to set yourself up for the start of another busy week.\n \nGlobal IP Benchmarking Survey\n \nHave your say as part of WTR and IAM’s \npioneering initiative\n to take the pulse of the global IP industry. \nComplete our survey\n covering everything from internal IP operations to generative AI and registry services.\n \nMonday 29 April\n \nA new study sheds light on the phenomenon of \n‘extra-legal’ uses of the trademark (™) symbol\n, which risks becoming a “source of confusion”, the co-author tells WTR. \n \nTarget \nleads the pack\n as energy brands’ stock values rise in this month’s WTR Brand Elite analysis.\n \nPlus:\nGeneral Court confirms that PABLO ESCOBAR is contrary to public policy and accepted principles of morality\n (European Union)\nAnti-counterfeiting efforts in Africa: recent developments in South Africa and Uganda\n (South Africa)\n \nTuesday 30 April\n \nNike and Bape \nsettle their lawsuit\n, Estée Lauder and Microsoft partner up, TikTok Shop expands in the United Kingdom, and more.\n \nWe offer strategies for brand protection at \nthe Pakistan border\n.\n \nPlus:\nThe META dispute: what you need to know \n(Brazil)\nJPO finds no likelihood of confusion between KOKO and COCO\n (Japan)\n \nWednesday 1 May\n \nUkraine publishes its \n2024-2028 strategic plan\n and Venezuela announces IP reforms, in this week’s IP office updates.\n \nWe outline popular \nsocial media platforms\n worth monitoring in Sweden.\n \nPlus:\nGeneral Court: Board of Appeal erred in finding that handle design lacked individual character\n (European Union)\nConstitutional Court eases procedural burden by annulling key mediation rule\n (Türkiye)\n \nThursday 2 May\n \nDucati, video games and diversification in intellectual property are the key talking points in a \nnew WIPO report\n exploring the drivers of innovation.\n \nIn a special Long Read, partners at gold-ranked law firms in India create a ‘how to’ guide for \nsuccessful litigation\n in the country. \n \nPlus:\nGeneral Court finds that Board of Appeal infringed right to be heard in opposition proceedings\n (European Union)\nDelhi High Court cancels OTRINIR registration, finds it similar to GSK’s OTRIVIN \n(India)\nNinth Circuit clarifies power of district courts to cancel pending applications in infringement spat\n (Market Insight: United States)\n \nFriday 3 May\n \nNissan \ntakes on ‘nissan.ai’\n, Tesla sues an India-based battery seller, a TikTok boycott ends, and more.\n \nData analysis reveals the most \nprolific copyright plaintiffs\n before US district courts – and their success rates.\n \nPlus:\nIP High Court upholds refusal to register colours of Hermès packaging\n (Japan)\nNUTRIBEN marks granted enhanced protection in BIONUBEN dispute\n (Spain)\n \nSaturday 4 May\n \nThe EUIPO's João Negrão, EU General Court and Board of Appeal judges, and in-house experts from Nestlé and Assa Abloy reflect on the \nfuture of European trademark, copyright and design law\n, at the fifth EUIPO IP Case Law Conference.\n \nSpecial Report\n \nWTR’s \nlatest Special Report\n examines the future of \nbrand protection on social media\n, offering insights and strategies to help brand owners mitigate the risks and seize new opportunities for brand growth in an evolving digital world.\n \nSubscribe\nFollow on\n \n \nFollow on\n \n \nLaw Business Research \n- Registered office: Holborn Gate, 330 High Holborn, WC1V 7QT, London, United Kingdom. \nRegistered in England and Wales number 03281866\nManage your email preferences, unsubscribe or opt out.\nTo receive our emails without interruption, please add us to your safe senders list.",
    "received_at": "2024-05-05T10:35:25+00:00",
    "sent_at": "2024-05-05T10:35:17+00:00",
    "date_extracted": "2025-04-02T20:00:06.723003"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNMgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAHQjpjPuAd5Kg5N8382k_Go=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "⏰ 30 Days to TICE – Are You Ready to Be Inspired?",
    "body": "Join us for keynotes that will redefine your L&D strategy.\nView this email in your browser\n.\n \nThe countdown is on! ONE MONTH TO GO! 🎉\nThe Training Industry Conference & Expo (TICE)\n is just 30 days away! Get ready to kick off each day with transformative \nkeynote sessions\n designed to spark your strategic thinking and set the tone for the rest of the conference.\nREGISTER NOW\n \nDAY ONE\nThe Future of Human-AI Collaboration\nKian Gohar, CEO and Founder of Geolab\nRedefine the role of artificial intelligence (AI) in learning and development (L&D) with Kian Gohar for his opening keynote session on \"The Future of Human-AI Collaboration.\" Discover firsthand how AI can enhance human capabilities and create more impactful learning experiences.\nDAY TWO\nPanel Discussion\nAI In Action: How New Tech Is Transforming L&D\nOur group of seasoned L&D professionals will share their insights and real-world experiences on leveraging AI in their work. From content creation and personalization to coaching and administrative support, discover how AI is impacting the L&D landscape.\nDAY THREE\nEvolve. Or Else. The Path to Becoming Trusted Learning Advisors.\nDr. Keith Keating, Chief Learning Officer of BDO\nFor too long, learning leaders have felt like order-takers, implementing learning programs from those outside the training function in their organization. Join Dr. Keith Keating's keynote session to discover how you can go from order taker to innovator and elevate your role as a learning leader within your organization.\nJoin us June 4-6 in Raleigh, N.C. for three days filled with learning, connections and growth! We can’t wait to welcome you!\n \n  \nREGISTER NOW\n \nPre-Conference\nAgenda\nBring Your Team\nSPONSORED BY\n \nFollow along with the latest #TICE2024 updates!​\n \nI don't want to receive updates about this event.\n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ninfo@trainingindustry.com\n1.866.298.4203\n \n \n© 2024 Training Industry, Inc.\nEngage with more than 250,000 corporate training leaders.\nGet the \nmedia kit\n or contact us directly at \ninfo@trainingindustry.com\n \nUpdate subscription preferences",
    "received_at": "2024-05-04T15:21:38+00:00",
    "sent_at": "2024-05-04T15:21:31+00:00",
    "date_extracted": "2025-04-02T20:00:07.151990"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNMQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQANio6Ad851VHrLsBIrBNCRA=",
    "from": "contact@mail.hunter.io",
    "to": "m.neu@lcwmail.com",
    "reply_to": "contact@mail.hunter.io",
    "in_reply_to": "N/A",
    "subject": "Shorter emails get more replies",
    "body": "Your fresh batch of outreach resources\n ‌ ‌ ‌ \n͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ \n \nYour fresh batch of outreach resources\nFind out the ideal cold email length based on Hunter's data, and discover new creative ways for finding prospects and sending relevant campaigns with Hunter!\n \nShort emails get more replies... technically\nWe analyzed 34 million messages to find the best cold email word count.\nAs expected, shorter emails get more replies on average. But you might be surprised to see the difference isn't all that significant.\nRead our word count analysis\n \n \nFind lookalike companies with Hunter\nHunter Discover has been out for a couple of weeks, and we're thrilled to see more users adopting it into their outreach workflows.\nOne creative way of using Discover is to find prospects that are similar to your existing leads or customers. This article explains how.\nFind lookalike companies using Discover\n \n \nUse Google reviews in your campaigns\nIf you're targeting businesses with a local presence, looking at Google reviews is an excellent way to expand your research.\nBut analyzing them at scale is incredibly time-consuming. This article outlines a workflow you can use to automate the process.\nAnalyze Google reviews at scale\n \n \nThat’s it for now. Happy prospecting!\nThe Hunter team\n \nFollow\nNeed help? \nContact us\n.\nVisit \nhunter.io\n \nUnsubscribe\n • \nView in Browser\nHunter Web Services, Inc. 2810 N Church St #50754, Wilmington Delaware 19802-4447",
    "received_at": "2024-05-02T15:00:30+00:00",
    "sent_at": "2024-05-02T15:00:22+00:00",
    "date_extracted": "2025-04-02T20:00:07.161120"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNMAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAIFBuXcV_LlOm32_rRph3ag=",
    "from": "contact@newsletter.hunter.io",
    "to": "m.neu@lcwmail.com",
    "reply_to": "contact@newsletter.hunter.io",
    "in_reply_to": "N/A",
    "subject": "Shorter emails get more replies",
    "body": "You don't often get email from contact@newsletter.hunter.io. \nLearn why this is important\nYour fresh batch of outreach resources\n ‌ ‌ ‌ \n͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ ͏ ‌     ­ \n \nYour fresh batch of outreach resources\nFind out the ideal cold email length based on Hunter's data, and discover new creative ways for finding prospects and sending relevant campaigns with Hunter!\n \nShort emails get more replies... technically\nWe analyzed 34 million messages to find the best cold email word count.\nAs expected, shorter emails get more replies on average. But you might be surprised to see the difference isn't all that significant.\nRead our word count analysis\n \n \nFind lookalike companies with Hunter\nHunter Discover has been out for a couple of weeks, and we're thrilled to see more users adopting it into their outreach workflows.\nOne creative way of using Discover is to find prospects that are similar to your existing leads or customers. This article explains how.\nFind lookalike companies using Discover\n \n \nUse Google reviews in your campaigns\nIf you're targeting businesses with a local presence, looking at Google reviews is an excellent way to expand your research.\nBut analyzing them at scale is incredibly time-consuming. This article outlines a workflow you can use to automate the process.\nAnalyze Google reviews at scale\n \n \nThat’s it for now. Happy prospecting!\nThe Hunter team\n \nFollow\nNeed help? \nContact us\n.\nVisit \nhunter.io\n \nUnsubscribe\n • \nView in Browser\nHunter Web Services, Inc. 2810 N Church St #50754, Wilmington Delaware 19802-4447",
    "received_at": "2024-05-02T15:00:28+00:00",
    "sent_at": "2024-05-02T15:00:22+00:00",
    "date_extracted": "2025-04-02T20:00:07.514616"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNLwAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQADLGbuZt6dVOhZHYlphT-uw=",
    "from": "frida.johansson@fmsend.eu",
    "to": "m.neu@lcwmail.com",
    "reply_to": "frida.johansson@promoteinternational.com",
    "in_reply_to": "N/A",
    "subject": "Regarding meeting",
    "body": "You don't often get email from frida.johansson@fmsend.eu. \nLearn why this is important\nHi Melissa,\n  \nAre you currently using a platform to support your training programs, or are you considering acquiring one? \nIf so, the Promote Platform could be an ideal choice for you.\nI'm Frida Johansson, and I’m a platform specialist here at Promote International.\nAt Promote we believe that the effectiveness of learning initiatives largely depends on their real-world application and participant engagement. \nOur platform is designed to enhance the entire learning cycle, fostering teamwork, securing knowledge retention, and facilitating the application of newly acquired skills directly within the flow of work.\nI would be delighted to demonstrate how our platform can address the specific needs of your organization. \nCould we arrange a brief conversation or a demonstration session at your convenience with me or one of my colleagues?\nI look forward to hearing from you!\n  \nHave a great day!\n  \n \nFrida Johansson\nPromote Platform Specialist\nPromote International\nSlussplan 9\n111 30 Stockholm, Sweden\nTry the platform\nwww.promoteint.com\n \nMessage sent by Promote International at Slussplan 9, 111 30 Stockholm, Stockholms län, Sweden. \n  Don't want to receive emails from us? Manage your email preferences \nhere\n.",
    "received_at": "2024-05-02T14:42:24+00:00",
    "sent_at": "2024-05-02T14:40:15+00:00",
    "date_extracted": "2025-04-02T20:00:07.957410"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNLgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAOsJ5su3N51NllmGGx4feuk=",
    "from": "admin@worldtrademarkreview.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "admin@worldtrademarkreview.com",
    "in_reply_to": "N/A",
    "subject": "Risk of confusion over TM symbol; give us your thoughts; Lawful Use rule under fire",
    "body": "02 May 2024 \n \nEditor's Round-Up\nA new study has shed light on the phenomenon of \n‘extra-legal’ uses of the trademark (™) symbol\n. Analysis of how non-commercial entities use the symbol in everyday digital interactions – ranging from parody to general informal use – uncovers a risk of it becoming a “source of confusion”, the study’s co-author tells WTR.\n \nElsewhere, WTR and sister platform IAM \nhave launched\n the new Global IP Benchmarking Survey, which aims to take the pulse of the global IP industry on everything from internal practice operations to national registry services. Take five minutes to complete \nthe anonymous survey\n today.\n \nOther trending content:\n \nWhy the USPTO’s Lawful Use rule is well past its prime\n \nTarget leads the pack as energy brand stock values rise: WTR Brand Elite analysis\n \nForeign brands should not be put off by slow progress at Myanmar IP department\n \nBig Five tech US litigation data: Meta\n \nVictoria Arnold-Rees\nEditor\nMarket Insight \nUSA \nMcDermott Will & Emery \nNinth Circuit clarifies power of district courts to cancel pending applications in infringement spat\n \nIn a dispute between two smoking product retailers, the Ninth Circuit has upheld a district court decision to cancel a pending trademark application. The decision sheds light on the jurisdiction of federal courts when it comes to resolving cases by cancelling pending applications.\nAuthors:\nCecilia Choy\n \nInsight \nGrau & Angulo\n \nEsther Gómez García\n \nSpain: Alicante Commercial Court Takes Issue with Online ‘Hidden’ Trademark Use\n \nFeatured in \nThe Trademark Litigation Review 2024\n \nUntil recently, online hidden use of a competitor’s trademark was analysed in relation to the use of keywords within Google AdWords. However, a fresh ruling has disturbed this consensus by highlighting that the use of a competitor’s trademark in a non-apparent way may also constitute infringement or amount to unfair competition. \nRead more »\n \nSujata Chaudhri IP Attorneys\n \nUrfee Roomi\n \nJanaki Arun\n \nJaskaran Singh\n \nWhat Rights Holders Need to Know as the Court Landscape Continues to Evolve\n \nFeatured in \nInside India’s IP Market: a Guide 2024\n \nCase backlogs and the abolition of the IPAB has prompted some much needed changes to IP enforcement. These should help to streamline procedures and make it more efficient to obtain patent protection, but there are still details that require clarification from the government and the courts. \nRead more »\n \nEvents \n \n  10 - 12 June 2024 | Palace Hotel, San Francisco \nIPBC Global 2024\n \nIPBC Global is the world’s foremost gathering of senior thought leaders and decision makers operating in the global IP market.\n \nCorporate executives, deal makers, investors, policy experts and legal professionals will come together to share insights, discuss new trends, and build their networks.\n \nStay ahead of the game and discover new opportunities at IPBC Global 2024.\nLearn more\n \n  8 - 9 October 2024 | New York, USA \nWTR Live: Brand Strategy Summit USA 2024\n \nWTR Live: Brand Strategy Summit USA is returning to New York on 8 and 9 October to unite senior brand leaders, in-house trademark professionals, policy makers and their trusted legal advisers.  \n \nOver the course of two days, our future-facing, expert-level conference will empower you with the commercial and strategic insight necessary to overcome any brand protection challenges you might face.\nLearn more\nSubscribe\nFollow on\n \n \nFollow on\n \n \nLaw Business Research \n- Registered office: Holborn Gate, 330 High Holborn, WC1V 7QT, London, United Kingdom. \nRegistered in England and Wales number 03281866\nManage your email preferences, unsubscribe or opt out.\nTo receive our emails without interruption, please add us to your safe senders list.",
    "received_at": "2024-05-02T14:25:20+00:00",
    "sent_at": "2024-05-02T14:25:04+00:00",
    "date_extracted": "2025-04-02T20:00:07.783454"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNLQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAEromS6gvDREvA9TzfrYBRI=",
    "from": "calendar@fromdayone.co",
    "to": "m.neu@lcwmail.com",
    "reply_to": "calendar@fromdayone.co",
    "in_reply_to": "N/A",
    "subject": "Full Calendar - Upcoming Events",
    "body": "You don't often get email from calendar@fromdayone.co. \nLearn why this is important\n From Day One is pleased to invite you to our upcoming events, each accredited by SHRM and HRCI, unless otherwise noted.\n \nView this email in your browser\n \n \nFrom Day One is pleased to invite you to our upcoming events\nOur weekly \nwebinars\n are each 60 minutes, complimentary to attend, and qualify for 1 credit from SHRM and HRCI.\nOur monthly half-day \nvirtual conferences \ninclude keynote, fireside chat, and panel discussions on our virtual main stage, as well as workshop sessions, chat, and one-on-one networking opportunities that facilitate interaction with our presenters and your fellow participants. They each qualify for 3 credits from SHRM and HRCI.\nOur \nlive events\n are coming to a city near you. Each one-day conference brings together leading thinkers and top executives in HR, talent acquisition, diversity, employee engagement, benefits, and CSR for an engaging, up-to-the-minute conversation about how employers can build stronger bonds of trust and connection with their workers and their communities. They each qualify for 4 credits from SHRM and HRCI.\nOur \nhalf-day live events\n bring together leading thinkers and top executives in more focused sectors. They each qualify for 3 credits from SHRM and HRCI. \nWEBINAR\n \nMay 1: Building an Effective Talent Strategy for the Skills of the Future: a Case Study\nThe world of work keeps changing. This creates a challenging environment for organizations to hire and develop people with the right skills, at scale. In fact, 77% of talent leaders said in a survey that their strategy is more focused on agility this year, an 11% increase from last year. So, is your business hiring and mobilizing for the future of work? Join us for a fireside chat with Andy Nelesen, Global Head of Talent Acquisition Solutions at SHL, and Richard Chambers, Ph.D., Talent Director at General Mills, as they explore how enterprising organizations are embracing skills to maximize their hiring, talent management, and careers strategies. \nRegister now\nWEBINAR\n \nMay 6: Intentional Recruiting: Bridging Business Goals with Human-Centric Hiring to Impact the Bottom Line\nRecruiting the best possible workforce for your organization requires collaborating with leadership to achieve clear business goals. Discover how HR teams can elevate hiring practice in service of your company's long-term vision. In this webinar, you'll learn how innovative hiring techniques, technology, and data integration practices can establish your HR team as an essential contributor to overall business success.\nRegister\n \nnow\nWEBINAR\n \nMay 8: The Secrets to Boosting Remote-Team Productivity and Performance\nTo attract talent, employers need to offer remote and hybrid work, yet also need to create innovative arrangements that work for both the individual employees and the organization. Employees tend to think they're more productive working from home, yet research indicates that's not always the case. How to bridge the gap and ensure optimal performance? During this webcast, experts from ActivTrak will explore findings from more than 9,500 customers. As well as dashboards for measuring and improving productivity in the workplace. You’ll learn how to use these sources and tools to:\n- Measure and improve productivity across teams and individuals using industry benchmarks\n- Drive effective coaching conversations to maximize efficiency\n- Quickly spot signs of disengagement and burnout\n- Ensure optimal work balance among teams and individuals\n- Identify opportunities for performance improvement \nRegister now\nWEBINAR\n \nMay 13: Retention is the New Recruiting: Strategies to Build and Keep a High-performing Workforce\nJoin Phil Willburn, VP of People Analytics and Greg Anderson, Principal Product Marketer at Workday as they share research and insights from Workday’s latest hiring and talent trends report. Trends in hiring reflect more than the state of the economy. They also reflect attitudes toward work, workforce mobility, and which industries are poised to weather future labor market shifts. Metrics from Workday customers indicate the hiring slowdown may be coming to an end. This webinar will explore how that impacts organizations’ talent strategies and why that makes “retaining” the new “recruiting.” Workday will also pull back the curtain and share how they apply their own technology and best practices about talent and performance philosophy, internal mobility, and flex work.\nRegister\n \nnow\nLIVE EVENT\n \nMay 14: Minneapolis, MN - Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nWEBINAR\n \nMay 15: Reducing Healthcare Costs by Reversing Chronic Care Conditions\nWith 60 percent of American adults living with chronic conditions like heart disease and diabetes, the stakes for effective healthcare management have never been higher. These persistent diseases demand continuous medical attention, impacting daily life and work productivity. They are not only leading causes of death in the U.S. but also major drivers of the nation's staggering $4.1 trillion annual healthcare costs. For employers, this presents a critical and unparalleled opportunity to transform this challenge into a strategic advantage. This 60-minute webinar offers invaluable insights into navigating and mitigating the financial impact of chronic diseases on your business, all while fostering a healthier, more productive workforce. Key Highlights of the Webinar:\n- Hear directly from two esteemed physicians at the forefront of battling chronic diseases, reversing these conditions through innovative approaches.\n- Discover how digital health point solutions can be leveraged to monitor health metrics, encourage healthier lifestyle choices, and facilitate effective disease management.\n- Understand how building a strong patient-doctor relationship can be a cornerstone in preventing and managing chronic conditions.\nRegister\n \nnow\nWEBINAR\n \nMay 21: Excellence in Hiring: Designing the Optimal Employee-Selection Process\nDesigning an effective selection process is crucial for attracting and retaining top talent. This webinar will explore the key components of a successful selection process, from defining job requirements to evaluating candidates and making the final decision. Experts from Fountain, a high-volume hiring platform, will discuss how to leverage technology and data to streamline the process, as well as how to ensure that your selection criteria align with your organization’s values and goals. Whether you’re a seasoned HR professional or new to the field, this conversation will provide valuable insights and best practices for setting up a selection process that drives success for your organization. Join us to learn how to build a talent-acquisition strategy that helps you identify, hire, and retain the best candidates for your team. \nRegister now\nVIRTUAL CONFERENCE\n \nMay 22: The Art and Science of Employee Retention, Coaching and Advancement\nWhile the pace of job-hopping has eased, employers have a powerful motivation to retain skilled workers, both for financial and cultural reasons. How can employers use new tools, including AI, to gain insights about what’s inspiring their workers to stay committed–or walk out the door? Since attrition is often caused by poor relationships with managers, what are innovative ways for employers to train their workers to be better leaders at a time when workers have higher expectations for job satisfaction? How can technology help make coaching more effective? \nRegister now\nLIVE EVENT\n \nMay 23: Manhattan, NY - Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nWEBINAR\n \nMay 30: Hiring Developers: How to Build a Nearly Perfect Tech-Recruitment Process\nRealistic, fair, fast, engaging, effective, precise, structured, memorable, collaborative, skills-based, inclusive–can your tech-recruitment process have it all? When hiring developers, is there really such a thing as the perfect process? Probably not. But, this webinar can help you get close. Join our panel of expert speakers as they explore what an optimal tech-hiring process looks like and share real-life examples of the good and the bad. Ask your own questions during a live Q&A and leverage our experts’ experience and lessons learned to improve the way you hire developers.\nRegister now\nWEBINAR\n \nJune 4: Paving the Way for All Paths to Parenthood\nStudies indicate that 29% of LGBTQ+ couples are raising children, and 63% of millennial LGBTQ+ couples are hoping to expand their family in the near future. But, surrogacy typically costs $60-100k per child. If your current family building benefits aren’t built to support these expenses and every path to parenthood, they may not be inclusive enough to meet your DEIB, retention or talent acquisition goals. Join this webinar to learn how to evolve your benefits to be more inclusive, and ways to support surrogacy, egg/sperm donorship, adoption/fostering. \nRegister now\nWEBINAR\n \nJune 11: High-Performance Culture: Creating a Workplace Where People and Productivity Thrive\nIn today's ever-changing world of work, a high-performance culture that’s both adaptable and resilient is the key to not just surviving, but thriving. Join us for a deep dive into Arbinger's latest research, where we'll explore how to cultivate excellence through a culture that fosters innovation, bounces back from challenges, and produces exceptional results—even with limited resources.\nRegister\n \nnow\nVIRTUAL CONFERENCE\n \nJune 12: \nBringing Talent Acquisition into the Digital Age\nDespite layoffs making headlines now, all the demographic and digital trends point toward tough competition for workers in the future–maybe sooner than most expect. What are the new techniques and tools that talent-acquisition can use to envision the workforce their company will need in the future? What data and insights can HR and TA leaders provide to the company to be ahead of trends? How can companies do a better job of internal recruiting and promoting internal mobility? What are the best practices for hiring based on skills and potential, rather than credentials? \nRegister now\nWEBINAR\n \nJune 13: Evaluating Financial Wellbeing Programs: How to Choose the Best Solution for Your Workforce\nFinancial wellbeing has quickly become the #1 workplace benefit for US and global organizations. How can employers evaluate financial wellbeing solutions to fit their unique needs? This engaging panel discussion will provide actionable approaches to assess and select programs tailored to meet the diverse needs of your workforce. Hosted by industry experts, this session will empower benefits decision-makers with the tools to evaluate financial wellbeing program features, cost-effectiveness, and measurable outcomes. The result is a financial wellbeing roadmap aligned with employer goals to foster workplace financial resilience.\nRegister now\nLIVE EVENT\n \nJune 13: San Francisco, CA - Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nWEBINAR\n \nJune 18: The ROI of Employee Experience: Recent Research and Best Practices\nAs HR invests into improving the employee experience, it's critical to understand the impact of those investments. Delve into the insights from our 2024 HR research featuring inputs from over 1,000 HR leaders to see the crucial link between positive return on investment (ROI) and strategic investments in employee experience. Learn what key HR technologies companies are investing in this year that have the largest influence on seeing ROI and how to think about and present ROI proof to your colleagues and executive team.\nRegister now\nWEBINAR\n \nJune 20: How to Transform Your Organization into a Skills-Based Powerhouse\nWith business priorities changing quickly and often, it can feel impossible to keep up with talent demands. Organizing work around people and their skills can maximize agility, productivity, and performance. Be part of the growing population of talent leaders moving their organization towards a skills-based approach. This session is designed to guide leaders and HR professionals through the process of becoming a skills-centric organization. Join the discussion on:\n- The value of a skills-based approach\n- How to get started\n- Best practices in integrating skills assessment into recruitment, mobility and talent development\n- How to gain alignment across key stakeholders\nRegister now\nWEBINAR\n \nJune 25: Boosting Financial Wellness by Helping Employees Meet Their Everyday Needs\nWhen workers struggle to make ends meet between paychecks, they often turn to costly solutions like payday loans and credit-card debt. Yet employee benefits such as Earned Wage Access can give them quicker access to the money they need to pay bills, avoid late fees, and meet unexpected expenses. Join our webinar to learn how employers can give their workers more control over how and when they get paid–and how this can reduce employee stress, boost productivity, and help companies attract and retain their workers.\nRegister now\nWEBINAR\n \nJune 26: Redefining Recruitment: The Advantages and Challenges of Skills-Based Hiring\nSkills-based hiring can be an effective way to expand the talent pool, reduce turnover, and improve overall performance when hiring an hourly workforce. What strategies can leaders employ to effectively identify and prioritize the specific skills required for their workforce, particularly when considering hourly positions? What are the key benefits of adopting a skills-based hiring approach over traditional methods, and what are the challenges to getting there? How can leaders ensure hiring managers have the education and tools to properly conduct a skills-based interview and approach? \nRegister now\nWEBINAR\n \nJuly 2: Treating Substance Use With a Dedicated Program: A Case Study on the ROI of Compassionate Care ?\nSubstance-use disorder (SUD) is a top cost driver for employers, according to the largest study of substance-use treatment by the Centers for Disease Control. As a result, employers increasingly are seeking to incorporate SUD treatment into their benefit offerings through their EAP or mental health provider. However, a behavioral health strategy that doesn’t include dedicated substance-use management has significant shortcomings when it comes to efficacy and cost control. In this employer-focused webinar, we’ll explore why a leading health care system invested in dedicated substance-use management for their employees and the results they’ve achieved, focusing on cost savings, outcomes, and member engagement. This session aims to foster understanding of the complexities of SUD care and highlight the clinical and financial impact that dedicated substance-use treatment provides. \nRegister now\nVIRTUAL CONFERENCE\n \nJuly 10: Learning and Development: How New Tools Are Changing Upskilling and Career Mobility\nAs employers put more emphasis on skills as the currency for worker development, they’re seeking new ways to measure them, fill in gaps, and predict the skills needed in the future. How can these new tools, including AI, create better matches between employees and projects? How can employers gain insights from the data they gather? Why do real-world simulations help measure certain skills better than traditional assessments? \nRegister now\nVIRTUAL CONFERENCE\n \nJuly 17: Innovative Benefits That Support Healthy Families and Caregivers\nAs the pandemic’s caregiving crisis showed, employers found significant gaps in their support for the parents and other caregivers in their workforces. The resulting scramble to help has produced a wealth of new HR policies, benefit offerings, and management practices. Where is the greatest demand for support, as well as the most innovative new methods? What have been the most cost-effective ways to help caregivers of all kinds, including parents as well as “sandwich generation” workers caring for elderly and disabled relatives? \nRegister now\nVIRTUAL CONFERENCE\n \nAugust 7: Employee Engagement: Using Technology to Gain Insight Into Work Needs and Ambitions\nTraditional methods like town-hall meetings and surveys can be effective, but data and well-drawn insights can give top leaders a heads up about evolving patterns and trends in their workforces. How can AI and other technology be deployed in a way that brings new insights yet still respects privacy and the individual human factors at play? What approaches will bring employers new empathy for worker needs, ambitions, and well-being? \nRegister now\nVIRTUAL CONFERENCE\n \nAugust 28: Pursuing Higher Productivity With Human Factors in Mind\nIn a competitive and uncertain climate, most companies need to do more with less. Yet if workers are their greatest asset, employers need to make sure the push for greater output is sustainable. What is the latest thinking about how to measure productivity, the means for stimulating it, and ensuring that workers have the energy to meet their goals–as well as thrive over the long run? \nRegister now\nLIVE EVENT\n \nSeptember 12: Boston, MA \n- Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nWEBINAR\n \nSeptember 17: Support the Change: Why Menopause Should Be Part of Your Women’s Health Strategy\nOffering solutions to improve and support needs specific to women can also be an important factor to retention. But a new survey reports that only 1% of US women have menopause support as part of their employee sponsored benefits. What’s more, according to a new survey, 85% of women said they don’t know enough about menopause, and 83% experiencing menopause report that their symptoms impact their ability to work. Join us for this webinar to learn how employers can better support women experiencing The Change, and the impact it can have on productivity, medical spend and retention. \nRegister now\nLIVE EVENT - HALF DAY\n \nSeptember 17: New York, NY - Benefits in 2024 and Beyond: Innovative and Inclusive Approaches for Worker Well-Being and Cost Effectiveness\nA wide range of benefits allows employers to tackle a broad spectrum of their goals, spanning from retaining and engaging employees to promoting diversity and inclusion within the workplace. What are the cutting-edge benefits available that cater to the needs of every worker? How can companies evaluate their workforce needs and cultivate awareness and participation in their offerings? What trends are emerging and what can be expected in the future of benefits? \nRegister\n \nnow\nVIRTUAL CONFERENCE\n \nSeptember 18: Building a Corporate Culture That Workers Can Understand, Influence and Embrace\nCompany culture is amorphous yet vital–the shared beliefs, values, traditions and behaviors that drive the actions of individuals and the organization as a whole. Who should be the architects of a company’s culture and how should it be designed and constructed? How should the culture be communicated, broadly and in everyday actions? How should a company start out on a project to evolve its culture in a credible way? \nRegister now\nLIVE EVENT\n \nSeptember 24: Philadelphia, PA \n- Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nLIVE EVENT\n \nOctober 1: Denver, CO \n- Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nLIVE EVENT\n \nOctober 9: Los Angeles, CA \n- Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nVIRTUAL CONFERENCE\n \nOctober 16: Modernizing Your Workplace for a More Flexible, Inclusive Era\nThe arrival of hybrid work sent virtually every employer back to the drawing board about what the workplace should look like, including floor plans, digital platforms, meetings, and even office furniture. After more than three years of experimenting, what have innovative companies discovered about what works–and what doesn’t? How have they improved workplace environments to be healthier, as well as more productive? How have these changes affected the goals of diversity, equity, inclusion, and belonging?\nRegister now\nLIVE EVENT\n \nOctober 24: Austin, TX \n- Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nLIVE EVENT\n \nOctober 30: Brooklyn, NY \n- Building a Culture for Workers and Companies to Thrive in Times of Change\nIn an era of digital transformation and rising employee expectations, companies will need to become even more attuned to the needs and aspirations of workers to keep them engaged and satisfied on their career paths. And in an environment of hybrid work and strained profits, employers will have to focus on making work both efficient and sustainable. How can companies do more with less, while maintaining employee well-being? What are the next frontiers in talent acquisition, employee benefits, learning and development, and diversity, equity, inclusion and belonging? \nRegister now\nYou're getting the From Day One full calendar of events because you signed up on our website or during the application process for one of our events. We send this calendar once a month.\nIf you like it, you're in luck: we'll send you another one next month. If you'd prefer to unsubscribe just click the link below and we'll take care of it.\nCopyright © 2024 From Day One, Inc., All rights reserved.\nYou are receiving this email because you signed up for our monthly calendar email at www.fromdayone.co.\nOur mailing address is:\nFrom Day One, Inc.\n \n18 Bridge St Ste 2F\nBrooklyn\n, \nNY\n \n11201-1107\nAdd us to your address book\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-05-01T16:09:31+00:00",
    "sent_at": "2024-05-01T16:00:51+00:00",
    "date_extracted": "2025-04-02T20:00:08.309960"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNLAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAC0pZTCUVg1HqI-35ER72I4=",
    "from": "connect@email.claconnect.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "connect@email.claconnect.com",
    "in_reply_to": "N/A",
    "subject": "New Overtime Rules To Affect Millions of Employees and Their Employers",
    "body": "The FLSA updated salary thresholds for exempt employees. Review how new overtime rules could impact your organization.\nView in browser\n \n \n \nNew Overtime Rules To Affect Millions of Employees and Their Employers \nThe FLSA updated salary thresholds for exempt employees. Review how new overtime rules could impact your organization.\nRead More\n \n \nTax Savings Are Heating Up for Geothermal HVAC\n \nWhat to Know Before Filing a Real Estate Tax Appeal\n \nDownload Guide\n \nBROAD-INTEREST WEBINARS\nMay 1, 2024\nDesigning and Integrating Your HR and Talent Acquisition Strategic Blueprint\nMay 14, 2024\nInvesting During Times of Turbulence\nMay 14, 2024\nIndia Market Entry: Overcoming Challenges and Finding Opportunities\nINDUSTRY-SPECIFIC INSIGHTS\nFinancial services\nWEBINAR: May 7, 2024\nNavigating a Data-Driven Strategy for Your Financial Institution\nWEBINAR: May 30, 2024\nVendors, Banks, and Credit Unions in the Digital World\nGovernment\nTransforming Government Services with AI, Automation\nHealth care\nHHS Finalizes 340B Dispute Resolution Process\nCMS Proposes 2.6% Hospice Increase, HOPE Tool Implementation\nCMS Proposes 4.1% Increase in 2025 for Skilled Nursing Facilities\nNursing Homes Mandated to Provide Certain Levels of Staffing Under Final Rule\nWEBINAR: May 22, 2024 \nUnpacking the New Mandatory Nursing Home Staffing Requirements\nManufacturing\nIRS Announces Round 2 of Section 48C Tax Credit Allocations\nNonprofit\nCECL for Nonprofits\nCharting Sustainability: Navigating the Path for Nonprofit Organizations\nWEBINAR: May 16, 2024 \nConsidering a Capital Campaign? Implications for Fundraising and Finances\nPrivate equity\nCredits and Incentives: A Guide for Private Equity Companies\nReal estate\nFinCEN Takes Action to Combat Money Laundering in Real Estate\nTechnology\nSaaS Sales Tax: Part IV – Compliance\nIt takes balance.\nTurn challenges into opportunities. We’ll get you there.\nGet Started\n \n \n  \n  \n  \n  \n \nCPAs\n  |  \nConsultants\n  |  \nWealth Advisors\nClient Login\n \n \n|\n  \nContact\n \n |\n  \nCLAconnect.com\nYou received this email because you are subscribed to Perspectives from CLA. \nUpdate your \nemail preferences\n to choose the types of emails you receive. \nUnsubscribe\nThe information contained in the email does not constitute the rendering of legal, accounting, investment, tax, or other professional services, but rather is intended as a means to inform our clients and friends about current topics of interest. This is a complimentary service from which you can unsubscribe at any time. CLA respects your privacy and will not share your address information with any third party without your expressed consent.\nView disclaimers for \nCliftonLarsonAllen LLP\n, \nCLA Global Limited\n, and \nCliftonLarsonAllen Wealth Advisors, LLC\n.\n \n©2024 CliftonLarsonAllen LLP\nCLA, 220 South 6th St, Suite 300, Minneapolis, MN  55402   \n210402 | Professional Services",
    "received_at": "2024-05-01T10:23:44+00:00",
    "sent_at": "2024-05-01T10:23:34+00:00",
    "date_extracted": "2025-04-02T20:00:08.544615"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNKwAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAIIBtdc2D6FIkZUmljtf7P0=",
    "from": "info@cultureconusa.org",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@cultureconusa.org",
    "in_reply_to": "N/A",
    "subject": "Ending Tonight: CultureCon 2024 Discounted Ticket Sale",
    "body": "You don't often get email from info@cultureconusa.org. \nLearn why this is important\nDiscounted Ticket Sale Ending at 11:59PM CST\n \n \n[Ending Tonight]\nCultureCon 2024 Discounted Ticket Sale\n---\n \nBe in community with Culture Geeks representing Fanatics, Atlassian, Gallup, Activison and many other innovative, human-centered organizations. \nOrder your CultureCon 2024 Discounted Tickets by 11:59PM CST and save at least $200 on final pricing.\nSave Now\n \nWe believe\n everyone deserves the opportunity to work and thrive within organizational cultures that embrace their full, authentic self. \nWe create\n experiences and curate meaningful connections that empower individuals to become cultural change agents. \nYou can\n join our community of Culture Geeks and support the movement towards more uplifting, fulfilling, and healthier workplaces.\n \n \n \n \n \nCopyright © 2024 CultureCon, LLC, All rights reserved.\nYou are receiving this email because you opted in via our website.\nOur mailing address is:\nCultureCon, LLC\n \n111 King Street, Suite 33\nMadison\n, \nWI\n \n53703\nAdd us to your address book\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-04-30T14:14:01+00:00",
    "sent_at": "2024-04-30T14:00:27+00:00",
    "date_extracted": "2025-04-02T20:00:08.559124"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNKgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAFjQXaPNyxxEuG2XuKK6l-Y=",
    "from": "office@sietareu.org",
    "to": "m.neu@lcwmail.com",
    "reply_to": "office@sietareu.org",
    "in_reply_to": "N/A",
    "subject": "LAST Day of Early Bird Registration!",
    "body": "You don't often get email from office@sietareu.org. \nLearn why this is important\nView this email in your browser\n \nLast Day of Early Bird Registration!\nRegister here\n \nDear SIETAR Friends,\nKindly reminder that today, 30th of April, is the final day to seize the opportunity of \nEarly Bird rates \nfor the \nSIETAR Europa Congress\n Registration!\nIt promises to be an enriching gathering, bringing together professionals and experts from diverse fields to explore the forefront of intercultural communication, diversity, and inclusion.\nWait no further, and register \nNOW\n to benefit from the Early Bird rates:\nClick here to register\n \nWe look forward to welcoming you to the SIETAR Europa Congress in Lille from \n4th until 8th of June 2024\n at \nthe IÉSEG School of Management\n!\n \nBest regards,\nThe SIETAR Europa Congress Steering Committee\n \n \nShare\n \n \nTweet\n \n \nShare\n \n \nForward\n \nCopyright © 2024 SIETAR EUROPA, All rights reserved.\nSIETAR\nPlease do not reply to this email. This email address is not monitored! \nContact us at \ncommunication@sietareu.org\n (to reach the Communication Committee), \nvirtual-events@sietareu.org\n (for questions related to webinars and CCC Breaks), \noffice@sietareu.org\n (for administrative inquiries), \npresident@sietareu.org\n (to reach SIETAR Europa's President), \ncongress@sietareu.org\n (to get in touch with the Congress Team), or \nseudm@sietareu.org\n (to get in touch with the SEU Direct Members Team).\nOur mailing address is:\nSIETAR EUROPA\n \n637 Boulevard de la Tavernière, F-06210 Mandelieu la Napoule (France),\nMandelieu la Napoule\n \nF-06210\n \nFrance\nAdd us to your address book\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-04-30T08:29:44+00:00",
    "sent_at": "2024-04-30T08:29:36+00:00",
    "date_extracted": "2025-04-02T20:00:08.992572"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNKQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAIdsrGwCQH5CkhyJTbdx7Y8=",
    "from": "events@opensesame.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "events@opensesame.com",
    "in_reply_to": "N/A",
    "subject": "See you in NOLA? The coffee is on us.",
    "body": "You don't often get email from events@opensesame.com. \nLearn why this is important\nJoin us at ATD24!\n \nHi Melissa,\nWe're headed to ATD24, and we hope you’ll join us there. \nStop by booth #3301 for freshly brewed coffee\n the first two mornings of the conference. We’ll have product demos too—including something new! \nPlus, when you come scan your badge, we’ll donate $5 to a local charity. So come get caffeinated, do some good, and see how we’re pushing the envelope in personalized learning. \nWe can’t wait to see you there!\nCheers,\nThe OpenSesame team\nGet the details\n    \n    \n    \n    \n© 2024 OPENSESAME\nOpenSesame\n1606 Headway Cir\nSuite 9405\nAustin, TX 78754\nOpenSesame is committed to protecting and respecting your privacy. You may unsubscribe from these communications at any time.\nupdate subscription preferences",
    "received_at": "2024-04-29T16:34:58+00:00",
    "sent_at": "2024-04-29T16:34:42+00:00",
    "date_extracted": "2025-04-02T20:00:09.128324"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNKAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAAKHViCx-2ZHvU-gWjrAZmg=",
    "from": "no-reply@youexec.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "no-reply@youexec.com",
    "in_reply_to": "N/A",
    "subject": "🎒 Media kit",
    "body": "How to attract potential advertisers, sponsors, and partnerships in the creator economy? Use this...\n \n \nPRESENTATIONS\nCreator Media Kit \nNew!\n \n \nHow to attract potential advertisers, sponsors, and partnerships in the creator economy? Use this Creator Media Kit to bridge the creative world with the business sphere. This comprehensive deck...\nDownload template \nShare \nPRESENTATIONS\nBrand Positioning Strategy \n \nDoes your company still struggle with the best way to communicate your value to consumers? An effective brand positioning strategy can set you apart from competitors and reinforce your core value...\nDownload template \nShare \nPRESENTATIONS\nPR Strategy \n \nNeed a way to manage brand image and improve public perception? This PR Strategy presentation provides a comprehensive suite of tools to craft the best approach that elevates any business?s PR effort.\nDownload template \nShare \nPRESENTATIONS\nSocial Media Report \n \nNeed social media platforms to generate better return on investment? Our Social Media Report collection provides customizable slides for traffic analysis, audience engagement and growth, social...\nDownload template \nShare \nNot relevant? \nPersonalize\n future emails. \nYou Exec LLC, 18 Bartol St. #1090 San Francisco, CA 94133. Do not reply to this email. \nTo stop receiving these emails, \nunsubscribe\n. Have questions? \nContact us\n.",
    "received_at": "2024-04-29T13:20:23+00:00",
    "sent_at": "2024-04-29T13:15:39+00:00",
    "date_extracted": "2025-04-02T20:00:09.123677"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNJwAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQACd5gwTewc9NvhLCXWpqn3M=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "Training Industry Weekly Recap 📅 April 28, 2024",
    "body": "Adaptive learning Leader Talk, Spring magazine release and more.\nView this email in your browser\nTHE BUSINESS OF LEARNING™\nIf we’ve learned anything so far this year, it’s that the key to achieving continuous business success relies on learning leaders’ ability to adapt and be agile in a time of constant change. That’s why it’s important for learning leaders to develop and hone their skills so they can efficaciously lead learning in the modern workplace.\nTo help you get started, check out:\nA \nLeader Talk\n on finding success through adaptive learning to discover how adaptive learning technologies can tailor content for unique learning paths.\nTraining Industry Magazine's Spring Issue\n focused on the role of the learning leader in the modern workplace.\nOur Training Industry Research e-book, “\nThe Anatomy of the Modern Learning System\n,” for insights on developing effective learning programs in a rapidly changing industry.\nAs always, we love hearing from you. Email us at \neditor@trainingindustry.com\n with any comments and suggestions.\nDanielle Johnson\nAssociate Editor \n🗣 [Leader Talk] Finding Success Through Adaptive Learning\nJoin us May 8 for our upcoming \nLeader Talk\n where we’ll explore how to personalize training for diverse learning needs. Discover how adaptive learning technologies tailor content for unique learning paths, increase engagement and boost retention. Experts from Allego, Google, Infopro Learning and Skillable will share tips for creating effective learning experiences that drive productivity and performance. Leave equipped with actionable insights to implement adaptive learning strategies in your organization.\nRegister Now\n \n📰 Hot off the Press! Training Industry Magazine Spring Issue    \nThis issue of Training Industry Magazine focuses on the role of the learning leader, exploring effective management of training and development in the modern workplace. \nThis issue\n covers selecting the right learning technologies, measuring training's impact, budgeting, fostering an inclusive learning environment and the exciting possibilities of artificial intelligence (AI) in training. Check it out for insider tips on improving your L&D strategy! \nRead Now\n \n🥇 The Leading Certification for Training Managers\nThousands of L&D professionals worldwide have completed the \nCertified Professional in Training Management (CPTM™)\n program, with 91 graduates from the first quarter of 2024! Congratulations to these graduates, from diverse roles, locations and industries, featured in the Training Industry Magazine Spring issue, with a special callout for training teams who earn their credential together.  \nView All the Graduates\n \n📚 [E-Book] The Anatomy of the Modern Learning System \nThis Training Industry Research e-book offers L&D leaders a deep understanding of modern learning systems within the broader organizational framework. Learn to harness data for maximum business impact, align training with evolving learner preferences and approach training as a dynamic system. \nDownload now\n for essential insights on developing effective learning programs in a rapidly changing industry. \nLearn More\n \nPROFESSIONAL DEVELOPMENT \nCase Study: Becoming a CPTM in 2024\nLearn about one learning leader's journey toward earning her Certified Professional in Training Management (CPTM™) credential.\nRead Now →\nARTIFICIAL INTELLIGENCE \nL&D Strategies for Practical AI Implementation\nIt’s important that organizations implement AI with training that is relevant to and effective for their workforce.\nRead Now →\nLEADERSHIP \nNurturing Well-Rounded Leaders: Integrating Personal Passions Into Leadership Development\nThis article will explore how personal interests can be interwoven into leadership skills to produce the most effective leaders of the future.\nRead Now →\nWORKFORCE DEVELOPMENT \nHuman-Centered AI: Data-Driven Transformation in Manufacturing\nWith an approach to human-centered AI, business leaders can make data-driven decisions for their manufacturing workforce.\nRead Now →\nARTIFICIAL INTELLIGENCE \nHarnessing the Power of AI for Personalized Learning\nDiscover how to use AI to create personalized learning experiences that are as unique and dynamic as the employees you serve.\nRead Now →\nSTRATEGY, ALIGNMENT AND PLANNING \nA Not-So-Secret Revolution in Mass-Scale Skills Development\nArtificial intelligence (AI) is working to provide more personalized, innovative learning solutions at scale. Learn how in this article.\nRead Now →\nCOMPLIANCE \nHow to Tackle Unconscious Bias in the Workplace\nThis article reviews tips for handling unconscious bias awareness training for employees to cultivate inclusivity in the workplace.\nRead Now →\nSALES \nImproving CRM Integration With Strategic Sales Training\nThis article offers strategies to improve CRM adoption with training and, in turn, make your sales force more effective.\nRead Now →\nLEARNING TECHNOLOGIES \nIntegrating AI Into Your LMS for Personalized Learning at Scale\nAI-driven LMS platforms can recommend personalized learning paths aligned with individual growth trajectories.\nRead Now →\nCOMPLIANCE \nRecognizing the Benefits of Implementing Company-Wide Cybersecurity Awareness Training\nThis article reviews best practices to implementing a company-wide cybersecurity awareness training program to protect your business.\nRead Now →\nTHE BUSINESS OF LEARNING:\nTHE TRAINING INDUSTRY PODCAST\nEpisode 74: Leading and Working Across Generations\n \nEpisode 73: The State of DEI Training in 2024\n \nEpisode 72: What’s Next in Learning Tech? Exploring Learning Technology Trends and Innovations\nEpisode 71: Learning Reinforcement — Delivering Training That “Sticks”\n \nTRAINING INDUSTRY RESEARCH\nNavigating the L&D Tech Stack: Strategies for Modern Organizations\nLearning Measurement for Modern Businesses: Making Sense of ISO 30437\n[State of the Industry Report] The Leadership Training Market\n[State of the Industry Report] The Sales Training Market\n \nExplore Research\nUPCOMING WEBINARS\nApr 29, 2024 | 1:00 p.m. ET \nA Recipe for Success: Developing Learning Programs With Curriculum Mapping\nRegister Now →\n \n \nApr 30, 2024 | 11:00 a.m. ET\nDrive Learner Engagement With Conversion Rate Optimization\nRegister Now →\n \n \nMay 1, 2024 | 1:00 p.m. ET \nSolving the L&D Disconnect: Frontline Worker Skills Growth in 2024 and Beyond\nRegister Now →\n \n \nTRAINING INDUSTRY COURSES\n \nCPTM PRACTICUMS\nMay 6-9, 2024\nMay 13-16, 2024\nJune 1-3, 2024\nJune 10-13, 2024\nJune 11-14, 2024\nJune 24-27, 2024\nJuly 15-18, 2024\nJuly 22-25, 2024\n \nCERTIFICATES\nNeeds Assessment\nApril 29-30, 2024\nLeadership Development\nMay 1-2, 2024\nMeasuring Impact\nMay 1-2, 2024\nCompetency Modeling\nMay 6-7, 2024\nDevelopment and Delivery\nMay 8-9, 2024\nLearning Technologies\nMay 21-22, 2024\n \nAGILE CERTIFICATION\nMay 14-16, 2024\nAug. 6-8, 2024\nOct. 15-17, 2024\nDec. 10-12, 2024\n \nWORKSHOPS\nStrategic Planning\nApril 29, 2024\nRemote Learning\nMay 3, 2024\nLearning Analytics\nMay 20, 2024\nDesign Thinking\nJune 20, 2024\nInternal Consulting\nJuly 17, 2024\nThe \ntiming of our courses\n is meant to be convenient for you and work for all time zones and work schedules. \nPlease let us know\n if you are struggling to find a course for you.\nDive Into L&D’s Most Relevant Content!\nCompliance\n \nContent Development\n \nDiversity, Equity and Inclusion\n \nIT and Technical Training\nLeadership\n \nLearning Services and Outsourcing\nLearning Technologies\n \nMeasurement and Analytics\n \nOnboarding\n \nPerformance Management\n \nPersonalization and Learning Pathways\nProfessional Development\n \nRemote Learning\nSales\n \nStrategy, Alignment and Planning\n \nWorkforce Development\n \nArticles\nWebinars\nThe Business of Learning Podcast\nResearch\nMagazine\nStore\nAnti-racism Resources\nWhat did you think of this newsletter?\nExcellent! \nNot My Favorite..\n.\n \nDid a friend forward this newsletter to you? \nYou can subscribe here\n.\nConnect With Us\nFacebook\n | \nTwitter\n | \nLinkedIn\n | \nInstagram\nEditorial\nContact an editor\nAdvertising\nContact our team\n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ninfo@trainingindustry.com\n1.866.298.4203\n \n \n© 2024 Training Industry, Inc.\nEngage with more than 250,000 corporate training leaders.\nGet the \nmedia kit\n or contact us directly at \ninfo@trainingindustry.com\nupdate subscription preferences",
    "received_at": "2024-04-28T21:12:34+00:00",
    "sent_at": "2024-04-28T21:12:27+00:00",
    "date_extracted": "2025-04-02T20:00:09.665970"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNJgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAPYv1SU0oGlJnzEaOQw_F0M=",
    "from": "admin@worldtrademarkreview.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "admin@worldtrademarkreview.com",
    "in_reply_to": "N/A",
    "subject": "Corporate leaders revealed; INTA discusses Annual Meeting plans; USTR Special 301 released; and much more",
    "body": "WTR SUNDAY DIGEST\n28 April 2024\n \n \nCorporate leaders revealed; INTA discusses Annual Meeting plans; USTR Special 301 released; and much more\n \nEverything we covered on WTR over the past seven days, and all you need to know from the world of trademarks to set yourself up for the start of another busy week.\n \nWTR 300: The World’s Leading Corporate Trademark Professionals\n \nDiscover the \nleading lights\n of the corporate trademark world in our new \nWTR 300\n.\n \nMonday 22 April\n \nOn Earth Day, representatives from Rouse explain why brands are struggling to register \ngreen marks\n in Southeast Asia.\n \nWe unpick recent instances of the EU General Court \ndisagreeing with the EUIPO\n.\n \nPlus:\nGeneral Court: Board of Appeal correctly limited its likelihood of confusion assessment to part of the relevant public \n(European Union)\nPanel gives respondent the benefit of the doubt in UDRP case\n (International)\n \nTuesday 23 April\n \nThis month’s \nlegislation and policy watch\n sees Tennessee sign the ELVIS Act, Hong Kong reduce IP-related tax, the United States introduce new AI copyright transparency rules, and more.\n \nGreggs’ brand value rises, and Pink files an opposition against Pharrell Williams, in \nTuesday’s news digest\n.\n \nPlus:\nAruba Tourism Authority fails to obtain cancellation of ARUBA mark\n (Argentina)\nProducer of Moët & Chandon champagne victorious in CLUB MOET dispute\n (Japan)\n \nWednesday 24 April\n \nWTR chats with the co-chairs of this year’s INTA Annual Meeting to find out what the \nevent has in store\n for registered participants.\n \nIPONZ issues guidance on the use of Māori elements, and the EUIPO implements a common practice on objectionable marks, in this week’s \nIP office updates\n.\n \nWe explore the processes for protecting brands on \nsocial media in Thailand\n – and the popular platforms to pay attention to.\n \nPlus:\nDelhi High Court passes summary judgment and awards costs to plaintiff in ANGSANA dispute\n (India)\nExtraordinary measure implemented to revitalise economy in areas damaged by rain\n (Peru)\n \nThursday 25 April\n \nThe latest \nUSTR Special 301 Report\n criticises the EU GI “agenda” and reiterates concerns about IP rights in Russia.\n \nForeign brand owners should not be put off by slow \nprogress at the Myanmar IP department\n, local experts suggest, one year after its grand opening.\n \nPlus:\nGeneral Court: Board of Appeal decision breached opponent’s right to be heard\n (European Union)\nIs use of a mark as a smartphone app icon use in respect of the services provided by the app?\n (South Korea)\nSecond Circuit denies Modelo summary judgment over ambiguous terms in licensing agreement\n (Market Insight: United States)\n \nFriday 26 April\n \nBarbie’s brand value\n rises, Louis Vuitton launches an NFT jacket, the Scotch Whisky Association celebrates an anti-counterfeiting raid in South Korea, and more.\n \nWe analyse US court \ndata for Meta\n, as part of a mini-series examining trademark litigation involving the Big Five tech firms.\n \nPlus:\nBoard of Appeal applies neutralisation principle in dispute between chocolate manufacturers\n (Estonia)\nGeneral Court: no likelihood of confusion between identical marks due to dissimilarity of goods and services\n (European Union)\n \nSaturday 27 April\n \nRitter Spencer Cheng’s Chelsie Spencer argues that the \nUSPTO’s Lawful Use rule\n is well past its prime, in this week’s opinion column.\n \nSpecial Report\n \nWTR’s \nlatest Special Report\n examines the future of \nbrand protection on social media\n, offering insights and strategies to help brand owners mitigate the risks and seize new opportunities for brand growth in an evolving digital world.\n \nSubscribe\nFollow on\n \n \nFollow on\n \n \nLaw Business Research \n- Registered office: Holborn Gate, 330 High Holborn, WC1V 7QT, London, United Kingdom. \nRegistered in England and Wales number 03281866\nManage your email preferences, unsubscribe or opt out.\nTo receive our emails without interruption, please add us to your safe senders list.",
    "received_at": "2024-04-28T10:36:24+00:00",
    "sent_at": "2024-04-28T10:36:15+00:00",
    "date_extracted": "2025-04-02T20:00:09.745309"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzxBNJQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAFVcaCBVGpRAoHL3QYMTMXk=",
    "from": "noreply@notifications.hubspot.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "noreply@notifications.hubspot.com",
    "in_reply_to": "N/A",
    "subject": "Your free HubSpot account will be deactivated in 1 day(s)",
    "body": "Your free HubSpot account will be deactivated in 1 day(s)\n \n \nIt looks like you haven't signed into this HubSpot account for a while: (Hub ID: 43627884; Account: LCW) with sales, marketing, service. Free HubSpot accounts are deactivated after 210 days of inactivity. You'll still be able to sign in and use your active HubSpot accounts: Hub 40820251 (lcwmail.com).\n \nWe'd love for you to stick around.\nTo keep your account open, please sign in by April 27, 2024. \n \nNeed help?\nHere's a handy guide to get you up and running again.\n \n \nDon't want this account anymore?\nHere's how you can delete it.\n \n \nSign in\n \nOr use your browser to go to HubSpot.com and log in from there. \n \nThis message was sent to m.neu@lcwmail.com because you’re a user in the \nhubspot-developers-1g25dvr.com\n (Hub ID: 43627884) account. You can't unsubscribe from important emails about your account like this one. Want to change other notifications? Go to your \npreferences page\n. \nHubSpot, Inc.\n2 Canal Park\nCambridge, MA 02141",
    "received_at": "2024-04-26T10:43:49+00:00",
    "sent_at": "2024-04-26T10:43:44+00:00",
    "date_extracted": "2025-04-02T20:00:09.907272"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzwxNYAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAHmkrsb-WbFBo7a09XHM9K0=",
    "from": "noreply@notifications.hubspot.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "noreply@notifications.hubspot.com",
    "in_reply_to": "N/A",
    "subject": "Your free HubSpot account will be deactivated in 1 day(s)",
    "body": "Your free HubSpot account will be deactivated in 1 day(s)\n \n \nIt looks like you haven't signed into this HubSpot account for a while: (Hub ID: 40820251; Account: Lcwmail) with sales, marketing, service. Free HubSpot accounts are deactivated after 210 days of inactivity. You'll still be able to sign in and use your active HubSpot accounts: Hub 43627884 (hubspot-developers-1g25dvr.com).\n \nWe'd love for you to stick around.\nTo keep your account open, please sign in by April 27, 2024. \n \nNeed help?\nHere's a handy guide to get you up and running again.\n \n \nDon't want this account anymore?\nHere's how you can delete it.\n \n \nSign in\n \nOr use your browser to go to HubSpot.com and log in from there. \n \nThis message was sent to m.neu@lcwmail.com because you’re a user in the \nlcwmail.com\n (Hub ID: 40820251) account. You can't unsubscribe from important emails about your account like this one. Want to change other notifications? Go to your \npreferences page\n. \nHubSpot, Inc.\n2 Canal Park\nCambridge, MA 02141",
    "received_at": "2024-04-26T10:17:12+00:00",
    "sent_at": "2024-04-26T10:17:08+00:00",
    "date_extracted": "2025-04-02T20:00:10.256951"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzkUiwgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAGJC32rGwcdEkEjhB5u7ecw=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "You’re Invited: Share L&D Insights in Our Pulse Survey",
    "body": "Unveil the pulse of the L&D market. \nView this email  in your browser\nAt Training Industry, we’re driven by a passion for understanding the learning and development (L&D) landscape. We rely on perspectives like yours to continuously conduct research revealing cutting-edge insights and best practices for corporate training professionals.\nWe invite you to participate in our latest research to help highlight what’s currently happening inside L&D departments — from challenges to learning initiatives. Please take five minutes to complete \nthis short survey\n to help us capture the pulse of the L&D market.\nComplete Survey\nAs always, your responses are kept completely confidential. Thank you for your valuable contribution.\n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ninfo@trainingindustry.com\n1.866.298.4203\n \n \n© 2024 Training Industry, Inc.\nEngage with more than 250,000 corporate training leaders.\nGet the \nmedia kit\n or contact us directly at \ninfo@trainingindustry.com\nupdate subscription preferences",
    "received_at": "2024-04-25T17:04:05+00:00",
    "sent_at": "2024-04-25T17:03:58+00:00",
    "date_extracted": "2025-04-02T20:00:10.346738"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzkUiwQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAHkh5BcN8RtMjHDxkesMfW0=",
    "from": "info@cultureconusa.org",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@cultureconusa.org",
    "in_reply_to": "N/A",
    "subject": "Ending Soon: CultureCon 2024 Discounted Ticket Sale",
    "body": "You don't often get email from info@cultureconusa.org. \nLearn why this is important\nDiscounted Ticket Sale Ending Soon\n \n \n[Ending Soon]\nCultureCon 2024 Discounted Ticket Sale\n---\n \nBe in community with Culture Geeks representing Fanatics, Atlassian, Gallup, Activison and many other human-centered organizations. \nCultureCon 2024 Discounted tickets are available through April 30th.\nSave Now\n \n[Two Weeks Away]\nCultureCon's Inaugural EdGov Summit\n---\n \nDo you work in higher education or government? Take this unique opportunity to connect with fellow public sector leaders. Discover innovative strategies and actionable insights to transform your workplace culture. Limited tickets are still available—secure your spot today and be part of this inaugural event!\nRegister\n \n[New Blog]\n\"\nNavigating the Clash: Unveiling Workplace Dynamics and Mirrortocracy's Impact on Marginalized Workers\"\n---\n \nBryetta Calloway\n, VP of Global Marketing and Communications at \nMassChallenge\n, is our most recent guest blogger! In her article, Bryetta dives into the critical clash between meritocracy and 'mirrortocracy'—a phenomenon where decision-makers favor those who reflect their own backgrounds, inadvertently perpetuating inequality.\nFull Article\n \nWe believe\n everyone deserves the opportunity to work and thrive within organizational cultures that embrace their full, authentic self. \nWe create\n experiences and curate meaningful connections that empower individuals to become cultural change agents. \nYou can\n join our community of Culture Geeks and support the movement towards more uplifting, fulfilling, and healthier workplaces.\n \n \n \n \n \nCopyright © 2024 CultureCon, LLC, All rights reserved.\nYou are receiving this email because you opted in via our website.\nOur mailing address is:\nCultureCon, LLC\n \n111 King Street, Suite 33\nMadison\n, \nWI\n \n53703\nAdd us to your address book\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-04-25T16:04:11+00:00",
    "sent_at": "2024-04-25T16:00:22+00:00",
    "date_extracted": "2025-04-02T20:00:10.518438"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACzkUiwAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAIBtzU8hpXBClVG1TB5NIkc=",
    "from": "admin@worldtrademarkreview.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "admin@worldtrademarkreview.com",
    "in_reply_to": "N/A",
    "subject": "WTR 300 out today; Apple court success rate; SHOP SAFE scrutiny",
    "body": "25 April 2024 \n \nEditor's Round-Up\nToday, we unveil \nthis year’s WTR 300\n – a \nvaluable guide to\n the corporate brand professionals deemed to be leading lights of the industry. Click \nhere\n to discover who has been recognised for their world-class trademark expertise and ongoing efforts to protect brands around the globe.\n \nElsewhere this week, we unpicked \nApple’s US trademark litigation data\n to determine the company’s current success rates before the courts.\n \nOther trending content:\n \nFive minutes with… INTA’s Annual Meeting co-chairs 2024\n \nEarth Day: why brands are struggling to register green marks in Southeast Asia\n \nSocial media in Thailand: what brand owners need to know\n \nIP budgets forecast to rise in 2024; trademark clearance to cause headaches for in-house teams\n \nPandabuy raid update: UK police and Corsearch expand on their role, as warehouses ‘reopen’\n \nVictoria Arnold-Rees\nEditor\nLong Read\n \nDoes the US SHOP SAFE Act go too far in shifting liability? \n \nIn our latest opinion column, Megan Bannigan, Christopher Ford, Kate Saba and Hannah Beattie at Debevoise & Plimpton argue that the current provisions of the US SHOP SAFE Act, while well-intentioned, go too far in shifting liability onto e-commerce sites for online counterfeiting. \nRead more\nMarket Insight \nUSA \nMcDermott Will & Emery \nSecond Circuit denies Modelo summary judgment over ambiguous terms in licensing agreement\n \nThe scope of the definition of ‘beer’ in a trademark licensing agreement has been called into question after the licensee began selling hard seltzers under the plaintiff’s brand. The court’s summary judgment denial highlights the need for specificity when it comes to defining products in such agreements. \nAuthors:\nTessa Kroll \nInsight \nAllen & Overy\n \nKrystyna Szczepanowska-Kozlowska\n \nPoland: Amends to Civil Procedure Code Act to have Serious Impact on Enforceability\n \nFeatured in \nThe Trademark Litigation Review 2024\n \nWhile Poland’s new changes are beneficial for defendants as they provide more opportunities to defend against allegations of infringement, the likelihood of a preliminary injunction being granted is much lower than previously. Meanwhile, recent Supreme Court judgments have covered issues from free movement of goods and limitation periods to civil proceedings remedies. \nRead more »\n \nThe Legal Co Ltd\n \nPanisa Suwanmatajarn\n \nThailand: Examiners’ Unique Approach to Distinctiveness Underscores Complex Registration Process\n \nFeatured in \nThe Trademark Prosecution Review 2024\n \nThere are several key aspects about Thailand’s registration process that rights holders need to know, from the first-to-file system to renewals. One key element is that examiners tend to consider any abbreviated mark to be non-distinctive; the same goes for captions or descriptions of goods or services. \nRead more »\n \nEvents \n \n  10 - 12 June 2024 | Palace Hotel, San Francisco \nIPBC Global 2024\n \nIPBC Global is the world’s foremost gathering of senior thought leaders and decision makers operating in the global IP market.\n \nCorporate executives, deal makers, investors, policy experts and legal professionals will come together to share insights, discuss new trends, and build their networks.\n \nStay ahead of the game and discover new opportunities at IPBC Global 2024.\nLearn more\n \n  8 - 9 October 2024 | New York, USA \nWTR Live: Brand Strategy Summit USA 2024\n \nWTR Live: Brand Strategy Summit USA is returning to New York on 8 and 9 October to unite senior brand leaders, in-house trademark professionals, policy makers and their trusted legal advisers.  \n \nOver the course of two days, our future-facing, expert-level conference will empower you with the commercial and strategic insight necessary to overcome any brand protection challenges you might face. \nLearn more\nSubscribe\nFollow on\n \n \nFollow on\n \n \nLaw Business Research \n- Registered office: Holborn Gate, 330 High Holborn, WC1V 7QT, London, United Kingdom. \nRegistered in England and Wales number 03281866\nManage your email preferences, unsubscribe or opt out.\nTo receive our emails without interruption, please add us to your safe senders list.",
    "received_at": "2024-04-25T14:20:32+00:00",
    "sent_at": "2024-04-25T14:20:19+00:00",
    "date_extracted": "2025-04-02T20:00:10.879544"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACy95YaQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQACIDswyo7g9Bis2ZezVbJCk=",
    "from": "connect@email.claconnect.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "connect@email.claconnect.com",
    "in_reply_to": "N/A",
    "subject": "What to Know Before Filing a Real Estate Tax Appeal",
    "body": "Learn to spot opportunities to potentially reduce your property taxes through a real estate property tax appeal.\nView in browser\n \n \n \nWhat to Know Before Filing a Real Estate Tax Appeal\nLearn to spot opportunities to potentially reduce your property taxes through a real estate property tax appeal.\nRead More\n \n \nWhat You Can Do to Prepare for the New IIA Standards\n \nHow Businesses Can Cash In on the $5.5 Billion Visa/Mastercard Settlement\n \nDownload Guide\n \nBROAD-INTEREST WEBINARS\nApril 24, 2024\n2024 Economic Outlook — Second Quarter Update\nApril 25, 2024\nUnlock Your Business Potential — Outsourcing for Growth\nApril 30, 2024\nSage Intacct: Bank Rec Leading Practices — Automating Your Reconciliation\nMay 1, 2024\nDesigning and Integrating Your HR and Talent Acquisition Strategic Blueprint\nMay 14, 2024\nInvesting During Times of Turbulence\nINDUSTRY-SPECIFIC INSIGHTS\nFinancial services\nWEBINAR: May 7, 2024\nNavigating a Data-Driven Strategy for Your Financial Institution\nGovernment\nTransforming Government Services with AI, Automation\nWEBINAR: April 25, 2024\nData for Government: Crawl, Walk, Run — Part 1, Crawl\nHealth care\nFederal Goals for Cybersecurity in Health Care\nWEBINAR: April 25, 2024\nElevating Patient Care Through AI: Practical Use Cases for Health Care Executives\nNonprofit\nPrepare for Significant Changes to OMB’s Uniform Guidance\nMaking Technology an Integral Part of Your Nonprofit\nWEBINAR: May 16, 2024 \nConsidering a Capital Campaign? Implications for Fundraising and Finances\nPrivate equity\nFiled Your Taxes? Consider These 3 Strategies for an Improved 2024\nTechnology\nSaaS Sales Tax: Part III — Taxability\nIt takes balance.\nTurn challenges into opportunities. We’ll get you there.\nGet Started\n \n \n  \n  \n  \n  \n \nCPAs\n  |  \nConsultants\n  |  \nWealth Advisors\nClient Login\n \n \n|\n  \nContact\n \n |\n  \nCLAconnect.com\nYou received this email because you are subscribed to Perspectives from CLA. \nUpdate your \nemail preferences\n to choose the types of emails you receive. \nUnsubscribe\nThe information contained in the email does not constitute the rendering of legal, accounting, investment, tax, or other professional services, but rather is intended as a means to inform our clients and friends about current topics of interest. This is a complimentary service from which you can unsubscribe at any time. CLA respects your privacy and will not share your address information with any third party without your expressed consent.\nView disclaimers for \nCliftonLarsonAllen LLP\n, \nCLA Global Limited\n, and \nCliftonLarsonAllen Wealth Advisors, LLC\n.\n \n©2024 CliftonLarsonAllen LLP\nCLA, 220 South 6th St, Suite 300, Minneapolis, MN  55402   \n210401 | Professional Services",
    "received_at": "2024-04-24T10:35:25+00:00",
    "sent_at": "2024-04-24T10:35:18+00:00",
    "date_extracted": "2025-04-02T20:00:11.085919"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACy95YaAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQANxY6zR028RHuDLnBQOjabY=",
    "from": "connect@email.claconnect.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "connect@email.claconnect.com",
    "in_reply_to": "N/A",
    "subject": "Reminder: Enhance Your Workforce Planning, Recruitment, and Retention Efforts",
    "body": "Join our webinar and gain valuable insights into aligning your HR and TA efforts, leveraging technology, and measuring effectiveness.\nView in browser\n \n \n \nDesigning and Integrating Your HR and Talent Acquisition Strategic Blueprint\n \nWEBINAR  \n|  May 1  |  1 – 2 p.m. CT \nRecommended CPE: 1 CPE credit,  Personnel/Human Resources \nRegister Now\n \nThis \ncomplimentary \nwebinar aims to equip participants with knowledge and skills needed to develop and implement a cohesive strategic blueprint for human resources (HR) and talent acquisition (TA).  \n \nBy exploring the alignment of these functions with broader organizational objectives and delving into practical strategies for integrations, attendees can gain valuable insights into enhancing workforce planning and recruitment efforts for long-term success.  \n \nIn addition to the core learning objectives, participants will explore the role of technology and data analytics in modern HR and TA strategies. Participants can gain an understanding of key performance indicators and metrics used to assess various aspects of workforce planning, recruitment, and retention strategies. By learning how to analyze these metrics effectively, attendees will be equipped with tools to evaluate the success of their initiatives, identify areas for improvement, and make informed decisions to drive strategic outcomes within their organizations.  \n \nAt the end of this session, you will be able to:  \nRecognize the importance of aligning HR and TA strategies with overall organizational goals \nRecall leading practices for designing and integrating HR and TA strategies \nIdentify common challenges and potential improvements in designing and integrating HR and TA strategies \nRecall what you learned about leveraging technology and data analytics to enhance your HR and TA processes \nIdentify methods for measuring the effectiveness and impact of HR and TA initiatives through key performance indicators and metrics \nWho should attend  \nThis session is designed for business owners, executives, and HR and TA leaders.    \n \nSpeakers  \nJon Fagan\n, Principal \nVanessa Ethier\n, Director of HRCO \nPlease \nregister \nby April 30, 2024.  \n \nQuestions? \nContact Beth Taylor at \nbeth.taylor@CLAconnect.com\n or 414-238-6759. \nSee the \nevent web page\n for more details and CPE information. \n \nCan’t make the webinar?  \nFill out the registration and you will receive an email with the webinar recording and slides following the event. Recorded webinars are not eligible for CPE. Also, check out our \nevent calendar\n to see what else is happening.\n \nView CPE sponsorship information\n \nEvent Cancellation Policy\nRegister Now\n \nCreate Opportunities\nOur vast network of professionals and resources are seamlessly presented and delivered for you.\nLearn More\n \n  \n  \n  \n  \n \nCPAs\n  |  \nConsultants\n  |  \nWealth Advisors\nClient Login\n \n \n|\n  \nContact\n \n |\n  \nCLAconnect.com\nYou received this email because you are subscribed to Events from CLA. \nUpdate your \nemail preferences\n to choose the types of emails you receive. \nUnsubscribe\nThe information contained in the email does not constitute the rendering of legal, accounting, investment, tax, or other professional services, but rather is intended as a means to inform our clients and friends about current topics of interest. This is a complimentary service from which you can unsubscribe at any time. CLA respects your privacy and will not share your address information with any third party without your expressed consent.\nView disclaimers for \nCliftonLarsonAllen LLP\n, \nCLA Global Limited\n, and \nCliftonLarsonAllen Wealth Advisors, LLC\n.\n \n©2024 CliftonLarsonAllen LLP\nCLA, 220 South 6th St, Suite 300, Minneapolis, MN  55402   \nTAL-209320-EVENT | Professional Services",
    "received_at": "2024-04-23T14:11:19+00:00",
    "sent_at": "2024-04-23T14:11:00+00:00",
    "date_extracted": "2025-04-02T20:00:11.122997"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACy95YZwAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQACSsPEAF6a1EtFShXKxxVeA=",
    "from": "office@sietareu.org",
    "to": "m.neu@lcwmail.com",
    "reply_to": "office@sietareu.org",
    "in_reply_to": "N/A",
    "subject": "Last Chance: Early Bird Registration Extended Again!",
    "body": "You don't often get email from office@sietareu.org. \nLearn why this is important\nRegister until the 30th of April\n \nView this email in your browser\n \nEarly Bird Registration Extended Once Again until 30th of April!\nRegister here\n \nDear SIETAR Friends,\nGreat news! We've listened to your requests and decided to \nextend the Early Bird Registration\n for the upcoming SIETAR Europa Congress until \nApril 30th\n, just for you!\nSeize this opportunity to secure your spot and save money by registering early. This is your \nlast chance \nto take advantage of these special rates and be part of the vibrant discussions, workshops, and networking opportunities awaiting you in Lille.\nThe SIETAR Europa Congress will unite professionals and experts from various disciplines to delve into the latest trends and best practices in intercultural communication, diversity, and inclusion.\nDon't miss out! Register \nNOW\n to benefit from the Early Bird rates:\nClick here to register\n \nAlso don't forget about\n Pre-Congress Workshops \ntaking place before the main Congress begins (4th and 5th of June). You can get more information \nHERE\nWe look forward to welcoming you to the SIETAR Europa Congress in Lille from \n4th until 8th of June 2024\n at \nthe IÉSEG School of Management\n!\n \nBest regards,\nThe SIETAR Europa Congress Steering Committee\n \n \nShare\n \n \nTweet\n \n \nShare\n \n \nForward\n \nCopyright © 2024 SIETAR EUROPA, All rights reserved.\nSIETAR\nPlease do not reply to this email. This email address is not monitored! \nContact us at \ncommunication@sietareu.org\n (to reach the Communication Committee), \nvirtual-events@sietareu.org\n (for questions related to webinars and CCC Breaks), \noffice@sietareu.org\n (for administrative inquiries), \npresident@sietareu.org\n (to reach SIETAR Europa's President), \ncongress@sietareu.org\n (to get in touch with the Congress Team), or \nseudm@sietareu.org\n (to get in touch with the SEU Direct Members Team).\nOur mailing address is:\nSIETAR EUROPA\n \n637 Boulevard de la Tavernière, F-06210 Mandelieu la Napoule (France),\nMandelieu la Napoule\n \nF-06210\n \nFrance\nAdd us to your address book\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-04-23T13:00:11+00:00",
    "sent_at": "2024-04-23T12:58:27+00:00",
    "date_extracted": "2025-04-02T20:00:11.466843"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACy95YZgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAFxP21oxQnZPo9Yp_o8j06Y=",
    "from": "Microsoft365@info.microsoftemail.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "reply-ff3316707663-6_HTML-338350596-536002633-1742@info.microsoftemail.com",
    "in_reply_to": "N/A",
    "subject": "Get started with Microsoft Teams",
    "body": "You don't often get email from microsoft365@info.microsoftemail.com. \nLearn why this is important\nTransform the way you work with your team. ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ \nRead this email online | \nView in browser\n \nWork smarter and achieve more with Microsoft Teams\nImprove collaboration at work with meetings, chats, and calls all in one place—accessible from nearly anywhere. To get started, open Teams and download the \nquick start guide\n to learn at your own pace. \n \nOpen Teams\n \n‌\nWith Teams, staying connected has never felt easier.\n \nMeet from virtually anywhere\nSchedule meetings with people inside and outside your organization to keep the conversation going, no matter where you are. \n \nExpress yourself with chat\nShare your feelings with emojis and GIFs in chat. \n \nKeep your files in one place\nShare, edit, and organize files without ever leaving Teams, so you and your team can refer to them at any time. \n‌\nContinue to grow your skills with Teams, no matter how you learn.\nStart a training course\n \nGet answers to common questions\n \nWatch training videos on YouTube\n \nThis email was sent from an unmonitored mailbox. \nPrivacy Statement\n \nMicrosoft Corporation, One Microsoft Way, Redmond, WA 98052 USA",
    "received_at": "2024-04-22T17:34:06+00:00",
    "sent_at": "2024-04-22T17:33:55+00:00",
    "date_extracted": "2025-04-02T20:00:11.678152"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACy95YZQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQALxC5K7zGDxBu3RFS4gaLW8=",
    "from": "no-reply@youexec.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "no-reply@youexec.com",
    "in_reply_to": "N/A",
    "subject": "🎒 Financial reports",
    "body": "Organize income, cash flow, and balance sheets with out all-in-one Financial Statement Template....\n \n \nSPREADSHEETS\nFinancial Statements Template \nNew!\n \n \nOrganize income, cash flow, and balance sheets with out all-in-one Financial Statement Template. It offers monthly, quarterly, and yearly data visualizations with a dashboard to assess the company's...\nDownload model \nShare \nPRESENTATIONS\nFinancial Statements Presentation \nNew!\n \n \nHow to clearly show the performance of your organization with numbers? The three financial statements model ? which includes the balance sheet, the income statement, and the cash flow statement ?...\nDownload template \nShare \nPRESENTATIONS\nRevenue Model and Monetization Strategy \n \nWhat is the most effective revenue model or monetization strategy for your organization? This presentation provides a comprehensive guide to tried-and-true revenue models that can be highly...\nDownload template \nShare \nPRESENTATIONS\nBudget Proposal \n \nHow to develop an effective budget proposal and get the right amount of resources to fund worthwhile projects? This comprehensive budget plan presentation allows managers to quickly adapt to changes...\nDownload template \nShare \nNot relevant? \nPersonalize\n future emails. \nYou Exec LLC, 18 Bartol St. #1090 San Francisco, CA 94133. Do not reply to this email. \nTo stop receiving these emails, \nunsubscribe\n. Have questions? \nContact us\n.",
    "received_at": "2024-04-22T12:15:10+00:00",
    "sent_at": "2024-04-22T12:15:05+00:00",
    "date_extracted": "2025-04-02T20:00:11.703999"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACy95YZAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQABm9QmZ7apNIpPSg2HsS9mc=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "Training Industry Weekly Recap 📅 April 21, 2024",
    "body": "Upcoming Leader Talk, tech stack e-book and more.\nView this email in your browser\nTHE BUSINESS OF LEARNING™\nWith the second quarter in full swing, our editorial team at Training Industry is busy writing and publishing timely — and actionable — resources to help support your career growth. Looking to brush up on the latest trends and innovations in the corporate training market? Check out the latest \nM&A in Corporate Training column\n. Looking to optimize your learning tech stack? Our \nnew e-book\n can help.\nThis week, we’re also highlighting articles on topics like navigating difficult conversations and a beginner’s guide to AI-powered learning.\nRegardless of where you are in your learning and development (L&D) career journey, we’re here to help: Email \neditor@trainingindustry.com\n to let us know which topics you’d like to see us cover this quarter and beyond.\nSarah Gallo, CPTM\nSenior Editor \n🔝 Upgrade Your TICE Experience \nAre you ready to transform your approach to learning and development? The upcoming \nTraining Industry Conference & Expo (TICE)\n has the potential to become a career-defining experience that begins with our pre-conference courses, designed specifically for learning leaders like you. This is your chance to experience the Training Industry Courses curriculum in-person amongst your peers. It’s an opportunity to step away from the online routine and engage deeply with content crafted for your growth in leadership and strategy. \nLearn More\n \n🗣 [Leader Talk] Training a Global Workforce \nLearn how to better navigate the challenges of training a global workforce with our \nLeader Talk\n on April 25. This virtual event is key for learning leaders aiming to tackle the complexities of cross-cultural training. Discover strategies for overcoming language barriers, time zone differences and for fostering inclusivity. Gain actionable insights from experts on creating engaging, accessible eLearning and leveraging new technologies to meet diverse learning needs. Reserve your spot today! \nRegister Now \n \n📚 [New E-Book] Strategies for Navigating Your L&D Tech Stack\nLearn how to make the most of your learning tech stack with Training Industry Research’s latest e-book, \"\nNavigating the L&D Tech Stack: Strategies for Modern Organizations\n.” This resource offers data-backed insights into the latest in learning technology stacks, showcasing their various tools, trends and strategic applications for modern businesses. Download now to start exploring ways to improve your tech stack utilization.\nDownload a Preview\n \n🧭 Embark on a Learning Journey \nTraining Industry's expertly curated \nLearning Journeys\n combine certification, certificates and workshops to help you achieve your specific career goals. With learning paths that include \nevaluating performance\n, identifying training needs and managing learning technologies, there is a Learning Journey that will help you fill your unique skills gaps to become a more confident learning leader. \nLearn More\n \nLEARNING SERVICES AND OUTSOURCING \nM&A in Corporate Training: Deals of the First Quarter of 2024\nA round-up of the mergers, acquisitions and investments that took place in the corporate training market last quarter. These deals reflect the continued demand for AI upskilling, innovative learning technologies and more.\nRead Now →\nLEADERSHIP \nHow to Develop Leaders’ Conflict Resolution Skills, Part 2\nLearn how to train leaders to resolve team conflicts through reflection, coaching and by creating a psychologically safe environment.\nRead Now →\nLEARNING TECHNOLOGIES \nNavigating Learning Platforms: All-in-One or Traditional LMS?\nLearn whether an LMS, an LXP or a combined solution is right for your organization with these key considerations for selecting a learning technology platform.\nRead Now →\nCONTENT DEVELOPMENT \nBeyond Memorization: Elaboration Strategies in eLearning\nIn online learning, the principle of elaboration assumes a critical role in enhancing learner engagement and comprehension.\nRead Now →\nLEADERSHIP\nRethinking \"Face Time\" in Hybrid Work: Leadership Training for the Modern Workplace\nLearn how to develop and train leaders who can effectively manage hybrid teams and cultivate trust and connection.\nRead Now →\nWORKFORCE DEVELOPMENT\nCan Employee Training Be Your Secret Weapon Against Turnover?\nThis article explores the topic of employee turnover and the link to increased training and development opportunities for career growth.\nRead Now →\nPROFESSIONAL DEVELOPMENT \nHow to Avoid Panicking During Public Speaking or Networking Events: Tips for Trainers\nThis article outlines effective strategies to help you overcome your fear of public speaking and networking events so that you can show up and showcase your expertise as a learning leader with confidence and composure.\nRead Now →\nPERFORMANCE MANAGEMENT \nNavigating Difficult Conversations: How To Manage the Tension and Engage in a Collaborative Dialogue\nNavigating Difficult Conversations: How To Manage the Tension and Engage in a Collaborative Dialogue\nRead Now →\nPROFESSIONAL DEVELOPMENT \nL&D in the Age of AI: A Beginner’s Guide to AI-Powered Learning\nThis beginner's guide to artificial intelligence (AI) is intended for learning professionals looking to leverage the power of AI for more effective training and development.\nRead Now →\nCOMPLIANCE \nHow Employee Training Creates an Ethical Workplace Culture\nCreating an ethical workplace culture is all about increasing employee knowledge and training options regarding ethical guidelines. This article walks through various ethics and compliance training programs that promote a healthy and safe workplace.\nRead Now →\nTHE BUSINESS OF LEARNING:\nTHE TRAINING INDUSTRY PODCAST\nEpisode 74: Leading and Working Across Generations\n \nEpisode 73: The State of DEI Training in 2024\n \nEpisode 72: What’s Next in Learning Tech? Exploring Learning Technology Trends and Innovations\nEpisode 71: Learning Reinforcement — Delivering Training That “Sticks”\n \nTRAINING INDUSTRY RESEARCH\nNavigating the L&D Tech Stack: Strategies for Modern Organizations\nLearning Measurement for Modern Businesses: Making Sense of ISO 30437\n[State of the Industry Report] The Leadership Training Market\n[State of the Industry Report] The Sales Training Market\n \nExplore Research\nUPCOMING WEBINARS\nApr 23, 2024 | 1:00 p.m. ET \n[Product Demo] How to Create Better Learning Experiences Using Generative AI Images\nRegister Now →\n \n \nApr 24, 2024 | 11:00 a.m. ET\nDrive Learner Engagement With Conversion Rate Optimization\nRegister Now →\n \n \nTRAINING INDUSTRY COURSES\n \nCPTM PRACTICUMS\nApril 22-25, 2024\nMay 6-9, 2024\nMay 13-16, 2024\nJune 1-3, 2024\nJune 10-13, 2024\nJune 11-14, 2024\nJune 24-27, 2024\nJuly 15-18, 2024\nJuly 22-25, 2024\n \nCERTIFICATES\nNeeds Assessment\nApril 29-30, 2024\nLeadership Development\nMay 1-2, 2024\nMeasuring Impact\nMay 1-2, 2024\nCompetency Modeling\nMay 6-7, 2024\nDevelopment and Delivery\nMay 8-9, 2024\nLearning Technologies\nMay 21-22, 2024\n \nAGILE CERTIFICATION\nMay 14-16, 2024\nAug. 6-8, 2024\nOct. 15-17, 2024\nDec. 10-12, 2024\n \nWORKSHOPS\nInternal Consulting\nApril 25, 2024\nStrategic Planning\nApril 29, 2024\nRemote Learning\nMay 3, 2024\nLearning Analytics\nMay 20, 2024\nDesign Thinking\nJune 20, 2024\nThe \ntiming of our courses\n is meant to be convenient for you and work for all time zones and work schedules. \nPlease let us know\n if you are struggling to find a course for you.\nDive Into L&D’s Most Relevant Content!\nCompliance\n \nContent Development\n \nDiversity, Equity and Inclusion\n \nIT and Technical Training\nLeadership\n \nLearning Services and Outsourcing\nLearning Technologies\n \nMeasurement and Analytics\n \nOnboarding\n \nPerformance Management\n \nPersonalization and Learning Pathways\nProfessional Development\n \nRemote Learning\nSales\n \nStrategy, Alignment and Planning\n \nWorkforce Development\n \nArticles\nWebinars\nThe Business of Learning Podcast\nResearch\nMagazine\nStore\nAnti-racism Resources\nWhat did you think of this newsletter?\nExcellent! \nNot My Favorite..\n.\n \nDid a friend forward this newsletter to you? \nYou can subscribe here\n.\nConnect With Us\nFacebook\n | \nTwitter\n | \nLinkedIn\n | \nInstagram\nEditorial\nContact an editor\nAdvertising\nContact our team\n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ninfo@trainingindustry.com\n1.866.298.4203\n \n \n© 2024 Training Industry, Inc.\nEngage with more than 250,000 corporate training leaders.\nGet the \nmedia kit\n or contact us directly at \ninfo@trainingindustry.com\nupdate subscription preferences",
    "received_at": "2024-04-21T23:53:55+00:00",
    "sent_at": "2024-04-21T23:53:47+00:00",
    "date_extracted": "2025-04-02T20:00:12.045577"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KgAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAK-E7LuwUZpNk5z4jgsgsIM=",
    "from": "admin@worldtrademarkreview.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "admin@worldtrademarkreview.com",
    "in_reply_to": "N/A",
    "subject": "WTR Industry Awards shortlist; Pandabuy raids updates; Weixin brand protection report; and much more",
    "body": "WTR SUNDAY DIGEST\n21 April 2024\n \n \nWTR Industry Awards shortlist; Pandabuy raids updates; Weixin brand protection report; and much more\n \nEverything we covered on WTR over the past seven days, and all you need to know from the world of trademarks to set yourself up for the start of another busy week.\n \nSpecial Report\n \nWTR’s \nnew Special Report\n reveals what the future holds for \nbrand protection on social media\n, offering insights and strategies to help brand owners mitigate the risks and seize future opportunities for brand growth in an evolving digital world.\n \nMonday 15 April\n \nAfter WTR broke the news that Chinese shopping agent \nPandabuy had been raided\n following legal action from 16 brand owners, the investigation \ncontinued on Monday\n, with one community member claiming “nothing has hit the rep scene like this before”.\n \nMeta’s battle\n for use of its name in Brazil highlights the importance of being first to file in the country.\n \nWe kick off our latest series of Legal Updates you may have missed by looking at cases that demonstrate the hurdles faced by \nowners of non-traditional trademarks\n.\n \nPlus:\nNinth Circuit: federal courts have jurisdiction to hear challenges to trademark applications\n (United States)\nReopening of investigation into famous rapper’s death raises discussions about authorship of his work\n (Venezuela)\n \nTuesday 16 April\n \nComputer scientists at the University of Chicago have developed groundbreaking software that aims to help artists \nprotect themselves from AI mimicry\n.\n \nWe highlight recent \nsuccess stories in the fashion and luxury industry\n – providing insights into parody products and the fight against counterfeit goods online. \n \nMeta expands its AI offering, the \nCHILI CRUNCH controversy\n comes to an end, Michigan cannabis companies face lawsuits, and more.\n \nPlus:\nDelhi High Court grants well-known status to HALDIRAM mark and raps defendants for evading proceedings\n (India)\nUDRP decision highlights complexity in assessing bad-faith registration\n (International)\n \nWednesday 17 April\n \nWTR reveals the in-house teams and individuals \nshortlisted for this year’s WTR Industry Awards.\n \nThe latest IP office updates see revisions to Saudi Arabia’s rejection procedure, discussions of a new Korea IP commissioner, Iraq modifying its payment process, \nand more\n.\n \nWeixin’s \nannual brand protection report\n outlines the latest enhancements to its programme and efforts to crowdsource enforcement leads. \n \nPlus:\nRimowa unsuccessful in opposition against Japanese-character mark\n (Japan)\nINDECOPI issues new mandatory precedent on validity period of notoriety declarations\n (Peru)\n \nThursday 18 April\n \nIP \nbudgets are forecast to rise\n in 2024, but trademark clearance looks set to cause headaches for in-house teams, according to a new impact study by UnitedLex.\n \nUK police and Corsearch expand on their respective roles in the Pandabuy raids, as warehouses \nbegin to reopen\n.\n \nAfter examining a number of fashion and luxury trademark successes, we consider recent cases where brand owners in the industry have \nfailed to defend their rights\n. \n \nPlus:\nCentral Court of Instruction of National Court rules on admissibility of expert report on damages suffered by trademark owners\n (Spain)\nVEUVE CLICQUOT v VEUVE OLIVIER: TTAB favours petitioner as respondent defaults in cancellation action\n (United States)\nHow to curb the risk of non-use and invalidation challenges when it comes to trademark assignment in China\n (Market Insight: China)\nDelhi High Court restricts tech company from selling refurbished hard-drive disks in reverse passing off case\n (Market Insight: India)\nUSPTO proposes new filing rules for 2025\n (Market Insight: United States)\n \nFriday 19 April\n \nWe unpick \nApple’s US litigation data\n to reveal the company’s success rates fighting for its rights before the district courts and the TTAB.\n \nThe so-called ‘Banksy of trademarks’ reveals plans to \nrun for mayor of San Francisco\n, StockX issues its first anti-counterfeiting report, Casa Azul prevails in a tequila dispute, and more.\n \nPlus:\nGeneral Court provides detailed assessment of bad faith in invalidity proceedings\n (European Union)\n‘Deferment of announcement of verdict’ institution regulated again: potential impact for rights holders\n (Türkiye)\n \nSaturday 20 April\n \nThis week’s opinion column argues that the current provisions of the US SHOP SAFE Act, while well-intentioned, may go too far in \nshifting counterfeiting liability onto e-commerce sites\n.\n \nSubscribe\nFollow on\n \n \nFollow on\n \n \nLaw Business Research \n- Registered office: Holborn Gate, 330 High Holborn, WC1V 7QT, London, United Kingdom. \nRegistered in England and Wales number 03281866\nManage your email preferences, unsubscribe or opt out.\nTo receive our emails without interruption, please add us to your safe senders list.",
    "received_at": "2024-04-21T10:36:28+00:00",
    "sent_at": "2024-04-21T10:36:19+00:00",
    "date_extracted": "2025-04-02T20:00:12.302429"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KfwAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAILfhBgUDTlPlycd9o1f3I8=",
    "from": "Microsoft365@info.microsoftemail.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "reply-ff2e15777662-6_HTML-338350596-536002633-5561@info.microsoftemail.com",
    "in_reply_to": "N/A",
    "subject": "Get started with Microsoft 365",
    "body": "You don't often get email from microsoft365@info.microsoftemail.com. \nLearn why this is important\nGet apps, tools, and tips to make your day easier | Make your day easier with Microsoft 365 | Transform the way you collaborate and get work done no matter where you are with the power of Microsoft 365 apps, intelligent cloud services, and world-class security. See the tools that can make your day easier. \nGet apps, tools, and tips to make your day easier | \nView in browser\n \nMake your day easier with \nMicrosoft 365\nTransform the way you collaborate and get work done no matter where you are with the power of Microsoft 365 apps, intelligent cloud services, and world-class security. See the tools that can make your day easier. \n \nVisit Microsoft 365 on the web\n \nStay connected to get things done together\nDo more with the only solution that combines meetings, chat, and collaboration, all in one place—securely and compliantly. \nLaunch Microsoft Teams\n \nOrganize your email and calendars\nGet easy access and tips for managing email, calendars, and contacts across all your accounts. \nExplore Outlook\n \nShare documents with your team\nAccess and easily share documents wherever you are. With OneDrive, your files are stored online, so they’re always in sync and up to date. \nUse OneDrive\n \nMake work more flexible\nThe new Microsoft 365 mobile app combines Word, Excel, and PowerPoint with exclusive features to make it your go-to productivity app. \nDownload Microsoft 365 mobile app\n \n‌\nReady to learn more?\nDive deeper and grow your skills with free Microsoft 365 training online. \nVisit training center\n \n \nThis email was sent from an unmonitored mailbox. \nPrivacy Statement\n \nMicrosoft Corporation, One Microsoft Way, Redmond, WA 98052 USA",
    "received_at": "2024-04-20T18:57:11+00:00",
    "sent_at": "2024-04-20T18:57:04+00:00",
    "date_extracted": "2025-04-02T20:00:12.332683"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KfgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAC6eZ8rDfrZAsKKxO0G8wCg=",
    "from": "courses@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "courses@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "7 Ways to Reach Your Career Growth Goals in 2024",
    "body": "You don't often get email from courses@trainingindustry.com. \nLearn why this is important\nNEW course and other upcoming professional development sessions for you.\nView this email in your browser\n.\n \nReach Your Professional Development Goals\nTraining Industry Courses are built on over a decade of research and continuous content curation, providing you with a wealth of knowledge on the characteristics of successful training functions and the essential competencies required to manage them. We have just launched our newest course, the \nTraining Development and Delivery Certificate\n, and it's selling fast! Take a look below and view our other six upcoming course sessions that can help you achieve your 2024 professional development and career goals.\n \n \n \nFEATURED COURSE\nTraining Development & Delivery Certificate\nSession: \nMay 8-9\nSeats Remaining: 5\nThe NEW Training Industry course is here. Learn key processes and frameworks to help organize and optimize your training development and delivery projects. \nLearn More\n \n>>\nUPCOMING CPTM PRACTICUMS\nVirtual Practicums and TICE In-Person Practicum\nTraining Industry’s Certified Professional in Training Management (CPTM™) program is the only credential focused specifically on the training manager job role.\nSessions:\nApril 22-25\n (3 seats left)\nMay 6-9\n (1 seat left)\nMay 13-16\n (3 seats left)\nJune 1-3\n (2 seats left) *In-person, Raleigh, NC\nLearn More\n >>\nOTHER UPCOMING COURSE SESSIONS\nInternal Consulting Workshop\nSession: \nApril 25\nSeats Remaining: 8\nPartnering with business leaders in consultative relationships requires you to navigate relationships and internal processes. In this workshop, you’ll gain best practices for consulting, managing expectations and addressing stakeholder needs.\nLearn More\n >>\nTraining Needs Assessment Certificate\nSession: \nApril 29-30\n *This session is perfectly timed to accommodate work schedules and participants joining form the AEDT time zone.\nSeats Remaining: 7\nTraining Industry research suggests that less than 20% of organizations have optimized their diagnostic processes. In this course, you will gain an in-depth understanding of diagnostic and needs assessment approaches to ensure targeted training.\nLearn More\n >>\nMeasuring the Impact of L&D Certificate\nSession: \nMay 1-2\nSeats Remaining: 8\nDuring this certificate, you’ll gain the tools you need to implement a multifaceted approach to measurement that allows you to craft an impactful evaluation story used to demonstrate the value of your training and development programs.\nLearn More\n >>\nManaging Remote Learning Workshop\nSession: \nMay 3\nSeats Remaining: 8\nThe Managing Remote Learning Workshop provides you with decision tools, job aids and discussion to help you better develop and deliver impactful remote learning programs.\nLearn More\n >>\nAgile Certification for HR and L&D\nSession: \nMay 14-16\nSeats Remaining: 9\nRevolutionize both learning and development (L&D) and human resources (HR) practices, by learning how to create adaptive programs that will set your organization up for success in an uncertain future of work.\nLearn More\n >>\n \n​​​​\n \n​​​​\nConnect With Us\nIf you have questions or need help deciding which course is right for you, schedule a call with one of Training Industry’s professional development consultants, or email our team directly.\nSCHEDULE A CALL\n \nEMAIL US\n​​​​\nView the Catalog\nBrowse the catalog to view all Training Industry Courses.\nTeam Development\nLearn more about the steps you can take to align your L&D team.\nContact Us\nGet in touch with our team if you need help or have any questions.\n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ncourses@trainingindustry.com\n919.653.4990\n \n© 2024 Training Industry, Inc.\nJoin the community of learning leaders facilitating their growth through Training Industry Courses. Browse the \ncourse catalog\n or contact us directly at \ncourses@trainingindustry.com\nUpdate subscription preferences",
    "received_at": "2024-04-20T15:18:45+00:00",
    "sent_at": "2024-04-20T15:18:38+00:00",
    "date_extracted": "2025-04-02T20:00:13.188122"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KfQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAOvhRLvsYGxLqRm0hePooFc=",
    "from": "noreply@notifications.hubspot.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "noreply@notifications.hubspot.com",
    "in_reply_to": "N/A",
    "subject": "Your free HubSpot account will be deactivated in 7 day(s)",
    "body": "You don't often get email from noreply@notifications.hubspot.com. \nLearn why this is important\n \n \n \nYour free HubSpot account will be deactivated in 7 day(s)\n \n \nIt looks like you haven't signed into this HubSpot account for a while: (Hub ID: 43627884; Account: LCW) with sales, marketing, service. Free HubSpot accounts are deactivated after 210 days of inactivity. You'll still be able to sign in and use your active HubSpot accounts: Hub 40820251 (lcwmail.com).\n \nWe'd love for you to stick around.\nTo keep your account open, please sign in by April 27, 2024. \n \nNeed help?\nHere's a handy guide to get you up and running again.\n \n \nDon't want this account anymore?\nHere's how you can delete it.\n \n \nSign in\n \nOr use your browser to go to HubSpot.com and log in from there. \n \nThis message was sent to m.neu@lcwmail.com because you’re a user in the \nhubspot-developers-1g25dvr.com\n (Hub ID: 43627884) account. You can't unsubscribe from important emails about your account like this one. Want to change other notifications? Go to your \npreferences page\n. \nHubSpot, Inc.\n2 Canal Park\nCambridge, MA 02141",
    "received_at": "2024-04-20T10:29:34+00:00",
    "sent_at": "2024-04-20T10:29:28+00:00",
    "date_extracted": "2025-04-02T20:00:13.125896"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KfAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAJ-dV981pIZFiTcLqjjUbr0=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "courses@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "Invest in Yourself: Start Your Learning Journey!",
    "body": "Invest in yourself: start your learning journey!\nView this email in your browser\n.\nSTART YOUR\nLEARNING\nJOURNEY\nLEARN MORE\nSCHEDULE A CONSULTATION\n \nNot all learning leaders have the same professional development needs.\n​​​​​​That's why Training Industry created personalized Learning Journeys.\nTraining Industry's Learning Journeys\n are expertly curated learning experiences that combine certification, certificates and workshops to help you achieve your specific career goals. Each journey pairs Training Industry's flagship certification, the \nCertified Professional in Training Management (CPTM™)\n program with two additional courses specifically selected to align with core learning and development (L&D) job responsibilities.\nWith learning paths that include \nevaluating performance\n, \nidentifying training needs\n and \nmanaging learning technologies\n, there is a Learning Journey that will help you fill your unique skills gaps to become a more confident learning leader. When you choose a Learning Journey, you get exactly what you need, with special benefits such as discounted rates and flexibility to select your session dates after registering.\nClick below to learn more about Learning Journeys or schedule a call with our director of professional development to discuss which Learning Journey is right for you.\nLearn More\n \nSchedule a Consultation\n \nFEATURED LEARNING JOURNEY\nTraining Industry Courses’ \nL&D Starter Kit Learning Journey\n represents a foundational learning path that aligns with two core responsibilities defined in Training Industry’s \nTraining Manager Competency Model™\n: \nidentifying training needs\n and \ndeveloping\n and \ndelivering\n \ntraining solutions\n.\nThis package is made up of three Training Industry courses: \nThe Certified Professional in Training Management (CPTM™) program\nThe Training Development and Delivery Certificate program\nThe Internal Consulting Workshop\nLEARN MORE\n \n​​​​​​\nView the Catalog\nBrowse the catalog to view all Training Industry Courses.\nTeam Development\nLearn more about the steps you can take to align your L&D team.\nContact Us\nGet in touch with our team if you need help or have any questions.\n \nAbout Training Industry Courses\nWe understand the challenges that learning and development (L&D) professionals face in managing training programs that align with organizational goals and drive business impact. To help address those challenges, we created a comprehensive suite of courses that will empower you to deliver creative training solutions.\nAligned With The Training Manager Competency Model™\nOur programs are built on over a decade of research and continuous content curation, providing you with a wealth of knowledge on the characteristics of successful training functions and the \nessential competencies\n required to manage them.\nLearn More\n \n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ncourses@trainingindustry.com\n919.653.4990\n \n© 2024 Training Industry, Inc.\nJoin the community of learning leaders facilitating their growth through Training Industry Courses. Browse the \ncourse catalog\n or contact us directly at \ncourses@trainingindustry.com\nUpdate subscription preferences",
    "received_at": "2024-04-19T13:11:05+00:00",
    "sent_at": "2024-04-19T13:10:59+00:00",
    "date_extracted": "2025-04-02T20:00:13.102203"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KewAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAEdKhYQLJ1VErFZ987sDwHs=",
    "from": "noreply@notifications.hubspot.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "noreply@notifications.hubspot.com",
    "in_reply_to": "N/A",
    "subject": "Your free HubSpot account will be deactivated in 7 day(s)",
    "body": "You don't often get email from noreply@notifications.hubspot.com. \nLearn why this is important\n \n \n \nYour free HubSpot account will be deactivated in 7 day(s)\n \n \nIt looks like you haven't signed into this HubSpot account for a while: (Hub ID: 40820251; Account: Lcwmail) with sales, marketing, service. Free HubSpot accounts are deactivated after 210 days of inactivity. You'll still be able to sign in and use your active HubSpot accounts: Hub 43627884 (hubspot-developers-1g25dvr.com).\n \nWe'd love for you to stick around.\nTo keep your account open, please sign in by April 26, 2024. \n \nNeed help?\nHere's a handy guide to get you up and running again.\n \n \nDon't want this account anymore?\nHere's how you can delete it.\n \n \nSign in\n \nOr use your browser to go to HubSpot.com and log in from there. \n \nThis message was sent to m.neu@lcwmail.com because you’re a user in the \nlcwmail.com\n (Hub ID: 40820251) account. You can't unsubscribe from important emails about your account like this one. Want to change other notifications? Go to your \npreferences page\n. \nHubSpot, Inc.\n2 Canal Park\nCambridge, MA 02141",
    "received_at": "2024-04-19T10:19:46+00:00",
    "sent_at": "2024-04-19T10:19:41+00:00",
    "date_extracted": "2025-04-02T20:00:13.654551"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KegAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAAlHsGLNhJpFi3zvXtCgIFA=",
    "from": "gmccarthy@ksiadvantage.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "gmccarthy@ksiadvantage.com",
    "in_reply_to": "N/A",
    "subject": "Teamwork Makes the Dream Work! How to Harness Proposal Roles Effectively",
    "body": "You don't often get email from gmccarthy@ksiadvantage.com. \nLearn why this is important\nTeamwork Makes the Dream Work!\n \nYou are receiving this email because you have previously downloaded or subscribed to KSI's proposal resources.\n \nThe number one ingredient to getting a proposal over the finish line without conflict?\n \nTeamwork!\n \nThis means understanding your role AND respecting your teammates' roles. \n \nCHECK IT OUT:  \nTeamwork Makes the Dream Work! How to Harness Proposal Roles Effectively\n \nSincerely,\n \nGreg McCarthy\nCEO\nKey Solutions, Inc. (KSI)\nFollow\n \n \nKey Solutions, Inc. (KSI), 14420 Albemarle Point Place, Suite 200, Chantilly, Virginia 20151, United States, (703) 953-3838 \nUnsubscribe\n \nManage preferences",
    "received_at": "2024-04-18T14:02:45+00:00",
    "sent_at": "2024-04-18T14:02:30+00:00",
    "date_extracted": "2025-04-02T20:00:13.737248"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KeQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQANY1eqGpXydEmR562gmJMlE=",
    "from": "admin@worldtrademarkreview.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "admin@worldtrademarkreview.com",
    "in_reply_to": "N/A",
    "subject": "Brand-new social media report; monumental Pandabuy raids; WTR Industry Awards shortlist",
    "body": "18 April 2024 \n \nEditor's Round-Up\nOut today, WTR’s \nbrand-new Special Report\n “\nThe future of brand protection on social media\n” aims to guide brand owners through the emerging risks and future opportunities for growth in an evolving digital world. With \ninsight from\n a range of industry stakeholders, including legal counsel at Christian Louboutin, Tencent/Weixin and World Wrestling Entertainment, leveraging the new techniques and partnerships identified in this report can help brand professionals to streamline enforcement efforts and swiftly respond to potential threats. This will help them to safeguard their brand assets and preserve consumer trust now and in the future.\n \nElsewhere, at the weekend WTR broke the news that multiple premises run by Chinese shopping agent \nPandabuy had been raided\n as part of a monumental enforcement action initiated by 16 major brand owners. \nReactions to the raids\n and subsequent takedowns of online rep forums continue to flood in, with one community member claiming “nothing has hit the rep scene like this before”.\n \nFinally, WTR is pleased to reveal the \nshortlist for this year’s WTR Industry Awards\n, showcasing those going above and beyond in the corporate trademark world. The winners will be announced at an exclusive ceremony in Atlanta next month.\n \nOther trending content:\n \nUSPTO publishes guidance on use of AI in office searches and submissions\n \nMeta battle highlights importance of being first to file in Brazil\n \nCrowdsourcing enforcement leads: Weixin report outlines enhancements to brand protection progamme\n \n“Trademark scams are on the rise” – USPTO webinar reveals anatomy of filing fraud\n \nGenerative AI developers would have to disclose use of copyright material under proposed US act\n \nGreek KALAMATA olive decision sets precedent for future EU GI disputes\n \nApplication of China examination guide puts brand owners with historically “tainted” marks in a vulnerable position\n \nGroundbreaking software seeks to protect artists in era of generative AI\n \nVictoria Arnold-Rees\nDeputy editor\nLong Read\n \nRevealed: agent networks of the world’s most valuable brands\n \nWe reveal the law firms filing the most trademarks on behalf of the likes of Amazon, Apple, Google and Facebook.\nRead more\n \nMarket Insight \nUSA \nMcDermott Will & Emery \nUSPTO proposes new filing rules for 2025\n \nThe USPTO has requested written opinion from the public in response to its proposed changes to trademark filing procedures and fees. The new rules aim to support the office’s strategic objectives and improve prosecution.\nAuthors:\nPeter Brunovskis\n \nIndia \nRemfry & Sagar \nDelhi High Court restricts tech company from selling refurbished hard-drive disks in reverse passing off case\n \nIn a dispute between several tech companies, the Delhi High Court has intervened to restrain the defendant from reselling hard-drive disks. The decision highlights the interplay between proprietary rights and consumer interest, as well as the process of determining a product’s true origin.\nAuthors:\nAarti Aggarwal\n \nChina \nKangxin Partners PC \nHow to curb the risk of non-use and invalidation challenges when it comes to trademark assignment in China\n \nFor rights holders following the CNIPA’s Guidelines on Trademark Assignment Procedures, there are some crucial factors that should be considered – especially regarding likelihood of confusion, trademark squatting and invalidation or cancellation challenges.\nAuthors:\nCynthia Wang\n \nInsight \nKNPZ Rechtsanwälte\n \nMathias Zintler\n \nFlorian Stoll\n \nNikolaus Schmidt-Hamkens\n \nGermany: Audi Finds Success and Tech Applications on the Rise amid Case Law Updates on the Scope of Preliminary Injunctions\n \nFeatured in \nThe Trademark Litigation Review 2024\n \nNew case law concerning trademarks in the automotive sector, the latest developments on preliminary injunctions and coverage of new technologies in German trademark filings are the key issues at the forefront of the German trademark landscape. \nRead more »\n \nPearl Cohen Zedek Latzer Baratz\n \nDor Cohen-Zedek\n \nAbishag Levy\n \nIsrael: New Practice Paper Indicates Increasingly Strict Stance Toward Descriptive and Non-Distinctive Marks\n \nFeatured in \nThe Trademark Prosecution Review 2024\n \nWhile any person or legal entity in Israel may obtain protection for its mark, there is an exhaustive list of marks that are not eligible for registration. The new Practice Paper aims to determine the distinctiveness of word marks and design marks. \nRead more »\n \nEvents \n \n  10 – 12 June 2024 | Palace Hotel, San Francisco \nIPBC Global 2024\n \nIPBC Global is the world’s foremost gathering of senior thought leaders and decision makers operating in the global IP market.\n \nCorporate executives, deal makers, investors, policy experts and legal professionals will come together to share insights, discuss new trends, and build their networks.\n \nStay ahead of the game and discover new opportunities at IPBC Global 2024.\nLearn more\n \n  8 – 9 October 2024 | New York, USA \nWTR Live: Brand Strategy Summit USA 2024\n \nWTR Live: Brand Strategy Summit USA is returning to New York on 8 and 9 October to unite senior brand leaders, in-house trademark professionals, policy makers and their trusted legal advisers.  \n \nOver the course of two days, our future-facing, expert-level conference will empower you with the commercial and strategic insight necessary to overcome any brand protection challenges you might face. \nLearn more\nSubscribe\nFollow on\n \n \nFollow on\n \n \nLaw Business Research \n- Registered office: Holborn Gate, 330 High Holborn, WC1V 7QT, London, United Kingdom. \nRegistered in England and Wales number 03281866\nManage your email preferences, unsubscribe or opt out.\nTo receive our emails without interruption, please add us to your safe senders list.",
    "received_at": "2024-04-18T13:10:27+00:00",
    "sent_at": "2024-04-18T13:10:17+00:00",
    "date_extracted": "2025-04-02T20:00:13.774434"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KeAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAKbVR1xD3MlNi1yurDfCXcU=",
    "from": "info@make.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "helpdesk@make.com",
    "in_reply_to": "N/A",
    "subject": "🟣 Enhanced app search, What's New section and productivity tips",
    "body": "You don't often get email from info@make.com. \nLearn why this is important\nFind Apps Fast: All-New App Search\n \nOur all-new App Search works at lightning speed - and looks for keywords (and not just app names). You'll also see handy new shortcuts to common tools, and recently-used apps float to the top.\n \n \n \nFeel the speed ➜\nFind Apps Fast: All-New App Search\n \nOur all-new App Search works at lightning speed - and looks for keywords (and not just app names). You'll also see handy new shortcuts to common tools, and recently-used apps float to the top.\n \nFeel the speed ➜\n \nNew in Make: The Latest Releases\nFrom new ways to collaborate in Confluence, to grabbing leads from TikTok, and powerful new Mailchimp templates, there's a host of new features for marketers in particular on Make this month. Explore what's new to level up your growth.\n \nSee what's new ➜\nNew in Make: The Latest Releases \n \nFrom new ways to collaborate in Confluence, to grabbing leads from TikTok, and powerful new Mailchimp templates, there's a host of new features for marketers in particular on Make this month. Explore what's new to level up your growth.\n \nSee what's new ➜\n \nOne Place to See What's New\nMake gets more powerful all the time - and as a Make user, that means you become more powerful too. With our new What's New page, you'll never miss a trick. Check it regularly to keep your scenarios updated with the latest new magic.\n \nSign in and check it out ➜\nOne Place to See What's New\n \nMake gets more powerful all the time - and as a Make user, that means you become more powerful too. With our new What's New page, you'll never miss a trick. Check it regularly to keep your scenarios updated with the latest new magic.\n \nSign in and check it out ➜\n \nCustomer Stories: Making Commerce Flow\nAt ecommerce agency Flowmondo, CEO Alistair Wilson understands the challenge of running operations smoothly. Discover how Flowmondo used Make to help a leading UK deodorant brand transform how they manage their influencer marketing.\n \nWatch the video ➜\nCustomer Stories: Making Commerce Flow\n \nAt ecommerce agency Flowmondo, CEO Alistair Wilson understands the challenge of running operations smoothly. Discover how Flowmondo used Make to help a leading UK deodorant brand transform how they manage their influencer marketing.\n \nWatch the video ➜\n \nBoost Your Productivity With ChatGPT and Make\nDiscover how screenwriter, author, and AI and automation coach Katri Manninen uses ChatGPT and Make to boost her productivity. Get inspired by her powerful setup, and how it can help you tackle your to-do list too. \n \nSee the guide ➜\nBoost Your Productivity With ChatGPT and Make\n \nDiscover how screenwriter, author, and AI and automation coach Katri Manninen uses ChatGPT and Make to boost her productivity. Get inspired by her powerful setup, and how it can help you tackle your to-do list too. \n \nSee the guide ➜\n \nTop Tip: Test Part of a Scenario\n \nDo you know that you don't have to run a whole scenario to test it? Just right-click and choose \"Run this module only\" to instantly check your data processing. It's a quick way to ensure everything's just right!\n \n \nTry it out ➜\nTop Tip: Test Part of a Scenario\n \nDo you know that you don't have to run a whole scenario to test it? Just right-click and choose \"Run this module only\" to instantly check your data processing. It's a quick way to ensure everything's just right!\n \nTry it out ➜\n \nPsst... Did you also know we're on a quest for some extraordinary folks to join our crew? 🌟\nTake a sneak peek at our current openings:\n \nData Analyst\n | \nFinance Operations Manager\n | \nSoftware Engineer - Full-Stack\n \n \nExplore these opportunities and more on our \nCareer Page\n.\n \n We're glad you're here!\nThe Make Team\n  You're receiving this email because you're subscribed to \nNewsletter & Blog\n. \n \nNeed assistance? Our \ncare team\n is here to help.\nCelonis s.r.o., Menclova 2538/2, 180 00 Prague, Czechia\n \nUnsubscribe\n \n|\n \nPrivacy Policy\n | \nTerms & Conditions",
    "received_at": "2024-04-18T10:49:50+00:00",
    "sent_at": "2024-04-18T10:49:41+00:00",
    "date_extracted": "2025-04-02T20:00:14.266905"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KdwAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAPPZFJW-BCZPqpZ5qjarZ7c=",
    "from": "no-reply@sietareu.org",
    "to": "m.neu@lcwmail.com",
    "reply_to": "no-reply@sietareu.org",
    "in_reply_to": "N/A",
    "subject": "Panel Discussion on Cross-Industry Partnerships and DEIB Innovation",
    "body": "View this email in your browser\n \nDear SIETAR Friends,\n \nWe are delighted to extend a special invitation to an upcoming panel discussion \"\nHow are Cross-Industry Partnerships Enhancing the Effectiveness of DEIB Efforts in the Workplace?\"\nDate: April 25th \nTime: 18:00 - 19:15 CET\nTogether we will delve into the innovative ways partnerships across various sectors are not only enhancing but also revolutionizing Diversity, Equity, Inclusion, and Belonging (DEIB) strategies in today's workplaces.\nOur esteemed panel of experts will explore how these collaborations are driving inclusive cultures and delivering impactful DEIB outcomes.\nMeet our guest speakers:\nDonna-Marie Jørgensen\nIntercultural Trainer & DEIB, Founder of Culture Code\nAmna Ben Amara\nResearcher and Intercultural Trainer\nPatricia Szobonya\nProgram Director of Legal Studies SUNY RCC, Associate Professor, RCC Global Institute\nThe panel will be moderated by \nClair Aghassipour\n, an Award-Winning Speaker and Author of 'Navigating the Culture Maze', who will share her insightful final remarks.\nKey Discussion Questions\n will include:\nHow might multi-disciplinary and cross-cultural collaboration be perceived by a Japanese student studying at a Danish university?\nWhat is cultural humility and how does it impact educators and students? ...and more thought-provoking inquiries.\nThis event promises to shed light on the future of workplace diversity and the transformative power of cross-industry partnerships. We would be honored to have you join us on\n April 25th \nto contribute to this important conversation.\n  \nPlease register via the Link below \nRegister here\n \nWe look forward to your participation and collaboration!\nBest regards,\nSIETAR Europa Member Benefits Committee\n \n \nShare\n \n \nTweet\n \n \nShare\n \n \nForward\n \nCopyright © 2024 SIETAR EUROPA, All rights reserved.\nSIETAR\nPlease do not reply to this email. This email address is not monitored! \nContact us at \ncommunication@sietareu.org\n (to reach the Communication Committee), \nvirtual-events@sietareu.org\n (for questions related to webinars and CCC Breaks), \noffice@sietareu.org\n (for administrative inquiries), \npresident@sietareu.org\n (to reach SIETAR Europa's President), or \ncongress@sietareu.org\n (to get in touch with the Congress Team).\nOur mailing address is:\nSIETAR EUROPA\n637 Boulevard de la Tavernière, F-06210 Mandelieu la Napoule (France),\nMandelieu la Napoule\n \nF-06210\n \nFrance\nAdd us to your address book\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-04-18T08:28:40+00:00",
    "sent_at": "2024-04-18T08:28:02+00:00",
    "date_extracted": "2025-04-02T20:00:14.390902"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACyO0KdgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAKTCNDYR_zVKrnBG4DiIV2s=",
    "from": "connect@email.claconnect.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "connect@email.claconnect.com",
    "in_reply_to": "N/A",
    "subject": "How Businesses Can Cash In on the $5.5 Billion Visa/Mastercard Settlement",
    "body": "Does your business accept Visa or Mastercard? You may be able to cash in on a recent $5.5 billion settlement. Find out how.\nView in browser\n \n \n \nHow Businesses Can Cash In on the $5.5 Billion Visa/Mastercard Settlement\nDoes your business accept Visa or Mastercard? You may be able to cash in on a recent $5.5 billion settlement. Find out how.\nRead More\n \n \nStrategies to Find Top Talent in Today’s Professional Landscape\n \nFlying on a Private Jet? The IRS is Watching\nSeeking clean energy funding and tax credits?\nVisit Resource Center\n \nBROAD-INTEREST WEBINARS\nApril 17, 2024\nHR Unboxed Series — Merger and Acquisition Transactions\nApril 24, 2024\n2024 Economic Outlook — Second Quarter Update\nApril 25, 2024\nUnlock Your Business Potential — Outsourcing for Growth\nApril 30, 2024\nSage Intacct: Bank Rec Leading Practices — Automating Your Reconciliation\nMay 1, 2024\nDesigning and Integrating Your HR and Talent Acquisition Strategic Blueprint\nMay 14, 2024\nInvesting During Times of Turbulence\nINDUSTRY-SPECIFIC INSIGHTS\nGovernment\nWEBINAR: April 25, 2024\nData for Government: Crawl, Walk, Run — Part 1, Crawl\nHealth care\nTop 5 Questions: New ACO Primary Care Flex Model\nWEBINAR: April 25, 2024\nElevating Patient Care Through AI: Practical Use Cases for Health Care Executives\nManufacturing\nThe Bridge, The Boat, The Barge — Economic Update on Baltimore’s Port\nWEBINAR: April 18, 2024\nUnleashing Productivity: How AI and Digital Technology Is Transforming Manufacturing\nNonprofit\nExciting New Uniform Guidance Changes Ahead\nWEBINAR: April 23, 2024 \nIs Your Foundation’s Data Dirty?\nWEBINAR: May 16, 2024 \nConsidering a Capital Campaign? Implications for Fundraising and Finances\nReal estate\nThe 2025 Federal Budget: What Tax Changes Might Impact Real Estate\nTechnology\nSaaS Sales Tax: Part II — Sourcing Sales\nIt takes balance.\nTurn challenges into opportunities. We’ll get you there.\nGet Started\n \n \n  \n  \n  \n  \n \nCPAs\n  |  \nConsultants\n  |  \nWealth Advisors\nClient Login\n \n \n|\n  \nContact\n \n |\n  \nCLAconnect.com\nYou received this email because you are subscribed to Perspectives from CLA. \nUpdate your \nemail preferences\n to choose the types of emails you receive. \nUnsubscribe\nThe information contained in the email does not constitute the rendering of legal, accounting, investment, tax, or other professional services, but rather is intended as a means to inform our clients and friends about current topics of interest. This is a complimentary service from which you can unsubscribe at any time. CLA respects your privacy and will not share your address information with any third party without your expressed consent.\nView disclaimers for \nCliftonLarsonAllen LLP\n, \nCLA Global Limited\n, and \nCliftonLarsonAllen Wealth Advisors, LLC\n.\n \n©2024 CliftonLarsonAllen LLP\nCLA, 220 South 6th St, Suite 300, Minneapolis, MN  55402   \n210233 | Professional Services",
    "received_at": "2024-04-17T10:27:26+00:00",
    "sent_at": "2024-04-17T10:27:15+00:00",
    "date_extracted": "2025-04-02T20:00:14.379747"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACxxbNLwAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAGIUYYSsZKBBtnyAFJJnkUE=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "The Strategy Summit Agenda is LIVE!",
    "body": "Explore the breakout sessions now.\nView this email  in your browser\nExplore the Strategy Summit Agenda Now!\nExplore the speakers, breakout sessions, keynotes and panels happening at the \nTraining Industry Strategy Summit\n! Join us online from Sept. 25 – 26th where you’ll learn the secrets to creating a learning and development (L&D) strategy that wins. Check out the sessions that align with your learning goals to plan your experience.\nBrowse the Agenda\nThis year, sessions were hand-picked to tackle the challenges of building an effective learning strategy. From leveraging the latest in artificial intelligence (AI) to support the development of your strategy to understanding the influence of rapid change on content creation and delivery, our carefully curated sessions promise to provide \ninvaluable perspectives and a renewed sense of direction for your organization’s learning strategy.\n  \nRegister Now\nRegister now\n for just $99 to gain access to over 20 live sessions.\nIf you can't attend the live event, register anyway as the event will remain open and available to watch on-demand for 6 months. \nSponsored By:\nI don't want to receive updates about this event.\n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ninfo@trainingindustry.com\n1.866.298.4203\n \n \n© 2024 Training Industry, Inc.\nEngage with more than 250,000 corporate training leaders.\nGet the \nmedia kit\n or contact us directly at \ninfo@trainingindustry.com\nupdate subscription preferences",
    "received_at": "2024-04-15T20:07:52+00:00",
    "sent_at": "2024-04-15T20:07:45+00:00",
    "date_extracted": "2025-04-02T20:00:15.035843"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACxxbNLgAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAGlpckjt_05DppolyKC-PGs=",
    "from": "info@cultureconusa.org",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@cultureconusa.org",
    "in_reply_to": "N/A",
    "subject": "Tomorrow's Free Webinar: Mental Health - The Missing Piece in Your DEI&B Strategy",
    "body": "Join our free webinar to learn the most prevalent types of mental illness that show up in the workplace and how to implement best practices.\n \n \nTomorrow's Webinar:\n---\n \nFor April's free webinar, you'll learn the most prevalent types of mental illness that show up in the workplace and how to implement best practices to support employees through real life examples, tools, resources and communication tips.\nDuring this webinar, you will:\n- Understand the most common mental illnesses found in the workplace and how to support employees through them.\n- Gain practical tips for empowering managers to handle complex wellbeing and DEI&B conversations.\n- Discover tangible ways to create a work environment that supports employee wellbeing and business success. \nFree Registration\n \nWe believe\n everyone deserves the opportunity to work and thrive within organizational cultures that embrace their full, authentic self. \nWe create\n experiences and curate meaningful connections that empower individuals to become cultural change agents. \nYou can\n join our community of Culture Geeks and support the movement towards more uplifting, fulfilling, and healthier workplace\ns.\n \n \n \n \n \n \nCopyright © 2024 CultureCon, LLC, All rights reserved.\nYou are receiving this email because you opted in via our website.\nOur mailing address is:\nCultureCon, LLC\n111 King Street, Suite 33\nMadison\n, \nWI\n \n53703\nAdd us to your address book\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-04-15T14:01:30+00:00",
    "sent_at": "2024-04-15T14:00:22+00:00",
    "date_extracted": "2025-04-02T20:00:14.982158"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACxxbNLQAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAAjEc9nRyB5HrGmOhFrsCsA=",
    "from": "no-reply@youexec.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "no-reply@youexec.com",
    "in_reply_to": "N/A",
    "subject": "🎒 Financial statements",
    "body": "How to clearly show the performance of your organization with numbers? The three financial...\n \n \nPRESENTATIONS\nFinancial Statements Presentation \nNew!\n \n \nHow to clearly show the performance of your organization with numbers? The three financial statements model ? which includes the balance sheet, the income statement, and the cash flow statement ?...\nDownload template \nShare \nPRESENTATIONS\nNIST Cybersecurity Framework \nNew!\n \n \nWhile growth is always welcomed, businesses also need to focus on reducing disruptions. From systems downtime to loss of critical data, cybersecurity breaches not only interrupt usual operations,...\nDownload template \nShare \nPRESENTATIONS\nPR Strategy \n \nNeed a way to manage brand image and improve public perception? This PR Strategy presentation provides a comprehensive suite of tools to craft the best approach that elevates any business?s PR effort.\nDownload template \nShare \nNOTIFICATIONS\nJoin our YouTube channel \n \nWatch all our business presentations, spreadsheet, book summary, and report videos on YouTube. New videos are added each week.\nLearn more \nNot relevant? \nPersonalize\n future emails. \nYou Exec LLC, 18 Bartol St. #1090 San Francisco, CA 94133. Do not reply to this email. \nTo stop receiving these emails, \nunsubscribe\n. Have questions? \nContact us\n.",
    "received_at": "2024-04-15T12:26:54+00:00",
    "sent_at": "2024-04-15T12:26:49+00:00",
    "date_extracted": "2025-04-02T20:00:15.452274"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACxxbNLAAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAJ-dgxpM42pPm9IVIoT48YU=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "info@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "Training Industry Weekly Recap 📅 April 14, 2024",
    "body": "Spring magazine release, Top 20 leadership companies and more.\nView this email in your browser\nTHE BUSINESS OF LEARNING™\nWhen your job description involves learning and development (L&D), you’re not only tasked with keeping your entire workforce’s skills up to date — no small feat in 2024 — but also a variety of other essential business functions, including change management, onboarding, succession planning and more.\nThis week, we’re excited to bring you a new issue of \nTraining Industry Magazine\n. Our spring issue is packed with insights and best practices on how you can more effectively lead learning at your organization. We’re also featuring our list of \n2024’s top leadership training companies\n and articles on real-world artificial intelligence use cases, facilitating L&D for a multigenerational audience and more.\nAs always, we love hearing from you! Reach out with any questions, topic requests or suggestions to \neditor@trainingindustry.com\n. Have a great week!\nMike Allen, CPTM\nEditor \nComplimentary Conflict Intelligence Workshop\nWorkplace conflicts are a double-edged sword for L&D professionals. Not only do they face conflicts within their teams, but they also have to equip employees throughout the organization with the tools needed to address their own disputes. To help navigate this dual challenge, we’re thrilled to invite you to “\nDeveloping Conflict Intelligence\n,” a free virtual mini-workshop, courtesy of NextArrow. The workshop is a research-based, practical and playful experience designed explicitly for tackling challenges that every L&D professional encounters at work.\nRegister for Free\n \n📰 Hot off the Press! Training Industry Magazine Spring Issue\nThis issue of \nTraining Industry Magazine\n focuses on the role of the learning leader, exploring effective management of training and development in the modern workplace. This issue covers selecting the right learning technologies, measuring training's impact, budgeting, fostering an inclusive learning environment and the exciting possibilities of artificial intelligence (AI) in training. Check it out for insider tips on improving your L&D strategy.\nRead Now \n \n📢 Just Announced: 2024 Top Leadership Training Companies\nTraining Industry announced its 2024 selections for the \ntop training companies\n in the leadership training sector of the L&D market. This list is an excellent resource for learning leaders looking for reliable training partners offering courses, coaching, proprietary frameworks, custom solutions or off-the-shelf content to meet their leadership training needs.\nView the List\n \n🌟 Become a Training Development and Delivery Expert\nLearning leaders like you are expected to work with stakeholders and other contributors on complex projects related to your training initiatives. Training Industry Courses' \nTraining Development and Delivery Certificate\n program was designed to help new and aspiring training managers get up to speed on the basics of managing training programs. Join the next session happening May 8-9, 1-5 p.m. ET and start optimizing your training development and delivery projects.\nSave Your Seat\n \nCOMPLIANCE \nL&D’s Role in Corporate Sustainability\nL&D leaders find themselves tasked with bringing individual employees and corporate culture into compliance with new laws, all while educating themselves on the fly.\nRead Now →\nARTIFICIAL INTELLIGENCE \nCreate Better AI-Generated Content With the 5 Stages of Design Thinking\nWith the principles we gain from design thinking, we can create AI-generated content that hits the mark and meets our learners’ needs.\nRead Now →\nSALES \n3 Tips for Training SaaS Customer Support Teams for Higher Retention\nThis article reviews tips to training SaaS customer support teams to encourage higher employee retention and well-able teams.\nRead Now →\nMEASUREMENT AND ANALYTICS \nAI Use Cases in L&D, Part 2: Supporting Skills Assessments Before, During and After Training\nArtificial intelligence (AI) can help you create pre-, mid- and post-training assessments that determine skills gaps and measure impact.\nRead Now →\nCOMPLIANCE\n2024 Compliance Predictions — Widening the Scope of Harassment Prevention\nThis article reviews updates to sexual harassment prevention for 2024 and compliance predictions for employee prevention training.\nRead Now →\nLEADERSHIP\nHigh-Conscious Leadership: Needed Now More Than Ever\nHigh-conscious leadership is not a nice to have, but an imperative for any organization that hopes to thrive while being a force for good.\nRead Now →\nPROFESSIONAL DEVELOPMENT\nHow Training Professionals Can Increase Their Impact at Work\nAs businesses navigate the complexities of 2024, training professionals face a pivotal moment to enhance their impact within organizations.\nRead Now →\nARTIFICIAL INTELLIGENCE\nFrom Data to Development: AI's Role in Tailored Training Solutions\nDiscover AI's role in turning data chaos into structured, impactful learning opportunities, fostering individual growth and organizational success.\nRead Now →\nDIVERSITY, EQUITY AND INCLUSION\nHow to Be an Effective L&D Facilitator for a Multigenerational Audience\nUnderstanding the characteristics, preferences and communication styles of different generations can build your training facilitation skills.\nRead Now →\nPERFORMANCE MANAGEMENT\nThe Secrets of Unleashing Learning Motivation From a Former Fighter Pilot\nThis article reviews best practices to unlocking employees' learning motivation in training to maximize performance outcomes.\nRead Now →\nTHE BUSINESS OF LEARNING:\nTHE TRAINING INDUSTRY PODCAST\nEpisode 74: Leading and Working Across Generations\n \nEpisode 73: The State of DEI Training in 2024\n \nEpisode 72: What’s Next in Learning Tech? Exploring Learning Technology Trends and Innovations\nEpisode 71: Learning Reinforcement — Delivering Training That “Sticks”\n \nTRAINING INDUSTRY RESEARCH\nNavigating the L&D Tech Stack: Strategies for Modern Organizations\nLearning Measurement for Modern Businesses: Making Sense of ISO 30437\n[State of the Industry Report] The Leadership Training Market\n[State of the Industry Report] The Sales Training Market\n \nExplore Research\nUPCOMING WEBINARS\nApr 23, 2024 | 1:00 p.m. ET \n[Product Demo] How to Create Better Learning Experiences Using Generative AI Images\nRegister Now →\n \n \nApr 24, 2024 | 11:00 a.m. ET\nDrive Learner Engagement With Conversion Rate Optimization\nRegister Now →\n \n \nTRAINING INDUSTRY COURSES\n \nCPTM PRACTICUMS\nApril 8-11, 2024\nApril 15-18, 2024\nApril 22-25, 2024\nMay 6-9, 2024\nMay 13-16, 2024\nJune 1-3, 2024\n \nCERTIFICATES\nNeeds Assessment\nApril 29-30, 2024\nLeadership Development\nMay 1-2, 2024\nMeasuring Impact\nMay 1-2, 2024\nCompetency Modeling\nMay 6-7, 2024\nDevelopment and Delivery\nMay 8-9, 2024\nLearning Technologies\nMay 21-22, 2024\n \nAGILE CERTIFICATION\nMay 14-16, 2024\nAug. 6-8, 2024\nOct. 15-17, 2024\nDec. 10-12, 2024\n \nWORKSHOPS\nInternal Consulting\nApril 25, 2024\nStrategic Planning\nApril 29, 2024\nRemote Learning\nMay 3, 2024\nLearning Analytics\nMay 20, 2024\nDesign Thinking\nJune 20, 2024\nThe \ntiming of our courses\n is meant to be convenient for you and work for all time zones and work schedules. \nPlease let us know\n if you are struggling to find a course for you.\nDive Into L&D’s Most Relevant Content!\nCompliance\n \nContent Development\n \nDiversity, Equity and Inclusion\n \nIT and Technical Training\nLeadership\n \nLearning Services and Outsourcing\nLearning Technologies\n \nMeasurement and Analytics\n \nOnboarding\n \nPerformance Management\n \nPersonalization and Learning Pathways\nProfessional Development\n \nRemote Learning\nSales\n \nStrategy, Alignment and Planning\n \nWorkforce Development\n \nArticles\nWebinars\nThe Business of Learning Podcast\nResearch\nMagazine\nStore\nAnti-racism Resources\nWhat did you think of this newsletter?\nExcellent! \nNot My Favorite..\n.\n \nDid a friend forward this newsletter to you? \nYou can subscribe here\n.\nConnect With Us\nFacebook\n | \nTwitter\n | \nLinkedIn\n | \nInstagram\nEditorial\nContact an editor\nAdvertising\nContact our team\n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ninfo@trainingindustry.com\n1.866.298.4203\n \n \n© 2024 Training Industry, Inc.\nEngage with more than 250,000 corporate training leaders.\nGet the \nmedia kit\n or contact us directly at \ninfo@trainingindustry.com\nupdate subscription preferences",
    "received_at": "2024-04-14T22:17:05+00:00",
    "sent_at": "2024-04-14T22:16:59+00:00",
    "date_extracted": "2025-04-02T20:00:15.818187"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACvjP75wAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAFJAKceDbAtBgubzgP8KCOM=",
    "from": "info@trainingindustry.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "courses@trainingindustry.com",
    "in_reply_to": "N/A",
    "subject": "Professional Development Resources for You: Learning Journeys",
    "body": "Trending career and professional development resources in April.\nView this email in your browser\n.\n \nRESOURCES FOR\nL&D LEADERS\nWHAT'S HAPPENING THIS MONTH\nUPCOMING COURSES\nCurated Resources for Your Professional Development\nAt Training Industry Courses, we're dedicated to empowering learning professionals like you with cutting-edge resources and insights — and that's why we're determined to deliver the most relevant resources and career development opportunities from industry experts.\nHere's what you can expect from this month's newsletter:\nInformation about Training Industry Courses' \npersonalized Learning Journeys\n.\nWhat's happening this month at Training Industry.\n \n \nEmbark on a Learning Journey\nTraining Industry Courses’ \nLearning Journeys\n are professional development packages that were expertly curated to\n fit your unique development needs\n. Each Learning Journey is based on a selection of \ncore responsibilities\n defined in the \nTraining Manager Competency Model™\n, the foundation of each of our \ncourses for training managers\n.\nLearn more about the packages below and discover which is most \naligned with your career goals\n to take the first step on your professional development journey.\nPlus, get \n$200 off \nthe purchase of your next Learning Journey when you use discount code \nJOURNEY200\n at checkout before April 30!\nL&D Starter Kit Journey \nThis Learning Journey was created for learning leaders who are newer to the profession, or those who feel they need to get up-to-speed with their skills around \nidentifying training needs\n and \ndeveloping and delivering training solutions\n. \nClick here to learn more.\nNeeds Assessment Journey \nThis Learning Journey equips learning leaders with the skills they need to become a \nstrategic business partner\n by learning effective \nneeds assessment processes\n and how to\n leverage data\n to select the\n right training solutions\n. \nClick here to learn more.\n \nMeasuring Impact Journey   \nThis Learning Journey was designed for learning leaders who need help with \nevaluating the performance\n of training programs, \nreporting\n on those programs and \nleveraging data\n to create better training solutions. \nClick here to learn more.\nLeadership Journey \nThis Learning Journey is perfect for those tasked with leadership training who need help with creating \neffective leadership development programs\n, utilizing tools such as \ncompetency models\n to assess leadership skills and be able to \nevaluate those programs\n to ensure they align with the goals of the organization. \nClick here to learn more.\nLearning Technologies Journey \nThis Learning Journey focuses on L&D professionals who need help \nmanaging learning technologies\n at their organization including \nselecting the technologies\n that are \naligned with business goals\n. \nClick here to learn more.\nDo you need some help selecting the Learning Journey that’s right for you? Click here to \ncontact us\n or \nschedule a free professional development consultation\n. \nWhat's Happening This Month\nRegister for the Training Industry Strategy Summit\nUp your training game by attending the \nTraining Industry Strategy Summit\n, happening Sept. 25-26 to empower L&D leaders to craft impactful learning strategies with confidence. Expect insights on core strategy principles, navigating change and measuring success. You’ll hear about the L&D strategies of successful companies, engage in dynamic sessions and connect with peers.\nRegister Now\nLeader Talk – Training a Global Workforce\nDuring this \nTraining Industry Leader Talk\n, gain the skills and knowledge needed to navigate the complexities of developing and engaging a dispersed workforce.\nReserve Your Spot\nPodcast — Leading and Working Across Generations\nToday’s workforce consists of a diverse blend of generations whose distinct values, experiences and skills bring both challenges and opportunities to organizations. Hear insights on navigating a multigenerational workplace, including how to leverage each generation's strengths and how to lead multigenerational teams.\nListen Now\n \n \n \nView the Catalog\nBrowse the catalog to view all Training Industry Courses.\nTeam Development\nLearn more about the steps you can take to align your L&D team.\nContact Us\nGet in touch with our team if you need help or have any questions.\n \nAbout Training Industry Courses\nWe understand the challenges that learning and development (L&D) professionals face in managing training programs that align with organizational goals and drive business impact. To help address those challenges, we created a comprehensive suite of courses that will empower you to deliver creative training solutions.\nAligned With The Training Manager Competency Model™\nOur programs are built on over a decade of research and continuous content curation, providing you with a wealth of knowledge on the characteristics of successful training functions and the \nessential competencies\n required to manage them.\nLearn More\n \n \nTraining Industry, Inc. \n110 Horizon Drive, Suite 110\nRaleigh, NC 27615-6520 \ncourses@trainingindustry.com\n919.653.4990\n \n© 2024 Training Industry, Inc.\nJoin the community of learning leaders facilitating their growth through Training Industry Courses. Browse the \ncourse catalog\n or contact us directly at \ncourses@trainingindustry.com\nUpdate subscription preferences",
    "received_at": "2024-04-13T15:13:52+00:00",
    "sent_at": "2024-04-13T15:13:47+00:00",
    "date_extracted": "2025-04-02T20:00:16.128261"
  },
  {
    "email_id": "AQMkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZABGAAADpWn7CXiauEGyI-3oylpOlQcA8FetuCVE0EW3Au-5rczxwAAAAgEMAAAA8FetuCVE0EW3Au-5rczxwAACvjP75gAAAA==",
    "conversation_id": "AAQkADVkYWZlZjQ4LTEwODctNDJmMS1hYjhiLTQ5MjljZTRjMDM5ZAAQAOslARs6DzBDrdfA4sP9GBU=",
    "from": "admin@worldtrademarkreview.com",
    "to": "m.neu@lcwmail.com",
    "reply_to": "admin@worldtrademarkreview.com",
    "in_reply_to": "N/A",
    "subject": "INTA video debate; advice for moving to private practice; landmark US decision",
    "body": "11 April 2024 \n \nEditor's Round-Up\nAn INTA video posted on social media calling out professionals perceived to be \nriding on the coattails\n of the Annual Meeting sparked debate across the trademark community last week. We reflected on CEO Etienne Sanz de Acedo’s message and why the video had to be issued, despite it likely upsetting some people. Elsewhere, we sat down with two former in-house leaders – ex-AB InBev global director of legal and corporate affairs Fabio Riva and ex-FIFA head of intellectual property Daniel Zohny – to discuss their recent \nmoves to private practice\n, including what spurred such significant career changes and their advice for anyone considering a similar shift.\n \nOther trending content:\n \nUS district courts can void trademark applications, landmark decision rules\n \nNew OECD-EUIPO report asks what we can learn from shift in counterfeiting during the pandemic\n \nAI class action defendants Nvidia and Databricks face good odds in Northern California\n \nCom Laude announces new investment and exit of founders; ICANN updates on registration request success levels; TMCH adjusts fees: Domain Watch (April 2024)\n \nVictoria Arnold-Rees\nDeputy editor\nLong Read\n \nIP office® – how trademark registries protect their own brands to help combat scams\n \nWTR delves into the trademark portfolios of offices around the world to uncover those most active in protecting their own intellectual property.\nRead more\nMarket Insight \nUSA \nMcDermott Will & Emery \nBreitling prevails with good-faith defence in Second Circuit infringement dispute ruling\n \nAn infringement suit brought against luxury watch retailer Breitling has shed light on the implications of using trademarks as descriptive terms. The court’s decision to grant summary judgment highlights how the good-faith prong in the fair-use defence can help when it comes to likelihood of confusion.\nAuthors:\nKaren Gover\n \nIndia \nRemfry & Sagar \nDelhi High Court addresses implications of legislation governing trade name changes following a finding of infringement\n \nIn \nSanofi v Zanofi\n, the Delhi High Court has ruled on the phonetic similarity of trademarks and trade names. In its assessment of the requirements involved in changing such names, the court clarified the interplay between the Trade Marks Act 1999 and Companies Act 2013 for the first time.\nAuthors:\nV Mohini\n and \nPragati Agrawal\n \nChina \nKangxin Partners PC \nCNIPA highlights critical aspects of trademark assignment in published guidelines\n \nThe published Guidelines on Trademark Assignment Procedures aim to help assignees follow the process of trademark registration. It is crucial for rights holders to understand these guidelines to facilitate smooth and cost-effective assignment.\nAuthors:\nCynthia Wang\n \nInsight \nArcher & Angel\n \nBidyut Bikash Tamuly\n \nRonil Goger\n \nSandhya Parimala\n \nTop Tips and Advice for Brand Owners to Get the Best Out of Their Relationship With Customs\n \nFeatured in \nInside India’s IP Market: a Guide 2024\n \nIndia has seen an influx of counterfeit goods in the wake of advancing technology. Customs and regulations are taking decisive action to tackle this, and brand owners should strategise according to the current policies to give themselves the best protection. \nRead more »\n \nMarkedly\n \nPeter van der Wees\n \nMarloes Smilde\n \nSpecialist Chapter: Benelux Sees Surge in Post-Pandemic Trademark Filings\n \nFeatured in \nThe Trademark Prosecution Review 2024\n \nTrademark and design filings in the Benelux remained strong throughout the pandemic years, making it more crucial than ever to have a robust understanding of the unified trademark law and how to enforce rights. \nRead more »\n \nEvents \n \n  10 – 12 June 2024 | Palace Hotel, San Francisco \nIPBC Global 2024\n \nIPBC Global is the world’s foremost gathering of senior thought leaders and decision makers operating in the global IP market.\n \nCorporate executives, deal makers, investors, policy experts and legal professionals will come together to share insights, discuss new trends, and build their networks.\n \nStay ahead of the game and discover new opportunities at IPBC Global 2024.\nLearn more here\n \n  8 – 9 October 2024 | New York, USA \nWTR Live: Brand Strategy Summit USA 2024\n \nWTR Live: Brand Strategy Summit USA is returning to New York on 8 and 9 October to unite senior brand leaders, in-house trademark professionals, policy makers and their trusted legal advisers.  \n \nOver the course of two days, our future-facing, expert-level conference will empower you with the commercial and strategic insight necessary to overcome any brand protection challenges you might face.\nLearn more here\nSubscribe\nFollow on\n \n \nFollow on\n \n \nLaw Business Research \n- Registered office: Holborn Gate, 330 High Holborn, WC1V 7QT, London, United Kingdom. \nRegistered in England and Wales number 03281866\nManage your email preferences, unsubscribe or opt out.\nTo receive our emails without interruption, please add us to your safe senders list.",
    "received_at": "2024-04-11T14:33:11+00:00",
    "sent_at": "2024-04-11T14:32:51+00:00",
    "date_extracted": "2025-04-02T20:00:16.088749"
  }
]