[
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACOZFMLQAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQADpuJLlNRO5BjzIs0EgdYhQ=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "Are You Looking to Gain a Competitive Edge in the Industry? ",
    "body": "OFFER ENDS TODAY! | Save 20% on Trados Studio 2024 Professional\nView in browser\n \n \nContact us\nAre You Looking to Gain a Competitive Edge in the Industry?\nHey Localization Luminary,\n \nIndustry leaders are already optimizing their workflows—will you join them?\n \n❓ \nAre your current translation tools holding you back from working efficiently?\n \n❓ \nDo you struggle with handling multiple file types and complex projects?\n \n❓ \nWould you like to speed up your workflow with AI-powered translation tools?\n \nWe’ve got the perfect answer!\n \n✔️ \nSpeed Up Translations with AI\n – Leverage Generative AI, Smart Review, and MT integrations to reduce manual effort.\n✔️ \nOptimize Project Management\n – Automate tasks, simplify tracking, and increase efficiency.\n✔️ \nHandle 50+ file types effortlessly\n – Work seamlessly with multilingual Excel, complex XML files, and more.\n✔️ \nFuture-Proof Your Workflow\n – Stay competitive in an industry that’s evolving faster than ever.\n \n🚀 \nUpgrade now and take control of your translation workflow!\n \nUpgrade today and save 20% on Trados Studio 2024 Professional! \n \nOr take advantage of our \n3 for 2\n offer on multiple licenses—delivering unbeatable value for growing teams.\nContact us today to learn more\n \nOffer valid until March 31.\n Find out more \nabout the world's leading computer-assisted translation software. Pricing excludes local taxes. For more information on this offer, please \ncontact us\n.\n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-31T12:02:56+00:00",
    "sent_at": "2025-03-31T12:02:44+00:00",
    "date_extracted": "2025-04-02T19:36:31.037932"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACOZFMLAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAJqXuDIjCZpOtV1emG7c_fY=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "Project(s) will soon be archived",
    "body": "Multiple projects will soon be archived. \nDear \nMaya Benoit \n, \nThere are \n3\n projects that are due to be archived in account \nLanguage and Culture Worldwide, LLC\n. The actions that can be performed for projects will be restricted after they have been archived. \nCustomer \nProject Short ID \nProject Name \nLanguages \nDue Date \nArchive Date \nCompliance Wave \n480 \n2024344 + 2024343 Diligent WO_DELMONTE_COC_080624 \nen-US -> el-GR \n8 Nov 2024, UTC\n \n07 April 2025 2 AM, UTC\n \nCompliance Wave \n492 \n2024353 Diligent WO_CORDIS_T_111424 \nen-US -> it-IT, ja-JP \n26 Nov 2024, UTC\n \n07 April 2025 2 AM, UTC\n \nCompliance Wave \n504 \n2024248 - 2024322 - Diligent - WO_PRYS_COC_092624 - Prysmian CoC Update \nen-US -> ar-EG, zh-CN, fr-FR, de-DE, it-IT, pt-BR, ru-RU, es-AR \n7 Dec 2024, UTC\n \n07 April 2025 2 AM, UTC\n \n  \nClick \nhere\n to view more details about the projects. \n \nJoin our Community \nFind answers to your questions, or contribute your own on the RWS Community! \n \nNeed more help? \nGet in touch with the human side of RWS! \n \n \nAll contents copyright © 2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-03-31T02:07:41+00:00",
    "sent_at": "2025-03-31T02:07:30+00:00",
    "date_extracted": "2025-04-02T19:36:31.198184"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACOZFMKwAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAMGht09mjjpNoYgDxTyXBho=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio Weekly Digest - 30 Mar 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 30 Mar 2025\nTrados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio\n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nNew Questions\nI'm tired of having to log into the Trados Cloud dashboard multiple times a day\nMatching language pairs between project/TM and TB\nBatch edit/delete and merging entries in Trados Terminology\nNew Replies\nHELP! I just bought Trados Studio and I am trying to import a TM (.tmx) file created in Wordfast Anywhere, into the online platform and it is not working.\n \n \nI'm tired of having to log into the Trados Cloud dashboard multiple times a day\nby \nJérôme Pott\n on 28 Mar 2025 8:26 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nCould you please extend the duration of the auth token or make use of a refresh token, like any other websites out there? It seems that you're using the third-party Auth0 for authentication, so it shouldn't be so hard to implement: \nhttps://auth0.com/docs/secure/tokens/refresh-tokens\nEven when I leave the dashboard open, I need to enter my credentials again after about 1 hour! I check my browser settings and it accepts cookies, and I stayed logged in to other websites when closing the browser.\nThanks!\n \nMatching language pairs between project/TM and TB\nby \nAnita Byrnes\n on 27 Mar 2025 12:18 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nIN Trados Team (university use) my student's project language pair is English -> Chinese (Traditional) and this was used for the TM. However the TB language pair is English - Chinese, as this seemed to be the only selection. She can't see (lookup) the TB when editing in Online Editor. Does the language pair of the TB have to match exactly the project/TM pair? The same would apply to varieties of Spanish and Arabic for example.\nThank you\nRWS Community AI on 27 Mar 2025 12:19 PM\n\"Probability score\": 0.9\n\"Question improvement suggestion\": The question is quite clear, but it would be helpful to know the version of Trados Team being used.\nIn the meantime, based on the information you have provided, here is a suggested answer to your question:\nHello,\nYes, the language pair of the Termbase (TB) needs to match exactly with the project/Translation Memory (TM) pair in Trados Team. This is because Trados Team uses the language pair to determine which TBs and TMs to use during translation. If the language pair of the TB doesn't match the project/TM pair, the TB won't be visible during translation.\nFor example, if your student's project language pair is English -> Chinese (Traditional), the TB should also be set to English -> Chinese (Traditional). If the TB is set to English -> Chinese, it won't be visible because \"Chinese\" and \"Chinese (Traditional)\" are considered different languages in Trados Team.\nThe same applies to varieties of Spanish and Arabic. Each variety is considered a different language, so the TB and project/TM pairs need to match exactly.\nTo resolve this issue, your student should create a new TB with the exact language pair as the project/TM. Once the new TB is created and populated with terms, it should be visible during translation in the Online Editor.\nI hope this answer addressed your question. If not, please reject the answer, add the question improvement suggestion information, and click the RWS Community AI checkbox on the right to try again.\nRWS Community AI\n \nBatch edit/delete and merging entries in Trados Terminology\nby \nJo Chapman\n on 26 Mar 2025 1:14 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nI am managing an enterprise term base in Trados Terminology. All entries have specific attributes to denote domain and class as well as standard term metadata such as status, term type, etc. I would like to be able to batch edit, batch delete or merge entries in the term base but I cannot find a way to do this.\nUse cases:\nMerge: I want to merge 2 or more existing duplicate entries, not merge a new entry into an existing entry.\nBatch edit: I want to batch edit to apply a filter and then change an attribute for all entries at the same time\nBatch delete: I want to apply a filter and remove several entries that meet the filter criteria.\nI have checked the technical documentation, knowledge base and community for an existing answer but only found information relating to MultiTerm.\nCan anyone advise if there is a function that I'm missing?\nJo Chapman on 27 Mar 2025 8:58 AM\nThanks for the clarification, Daniel. I'll bear the roadmap in mind.\nDaniel Brockmann on 27 Mar 2025 7:59 AM\nHi Jo,\nMerging is on the more short-term (CY 2025) while batch-edit and batch-delete on the longer term roadmap. To trigger a kind of 'force merge' in the meantime as a potential workaround, you can start editing the existing entry that you want to merge, and enter the same source term as a synonym (or edit an existing term to make it the same term as in the entry you want to merge). This will trigger the merge duplicate flow where you can then decide which fields to merge. If multiple duplicates exist, you can decide which one to merge with. We will look at decoupling this 'forced' merge flow into a separate merge flow that would not require this kind of artificial merge. It works quite well though, this helped me merge a few entries in a fairly complex termbase the other day.\nAlso tagging \nAna-Maria Totea\n  and \nAdrian Manea\n  as an FYI.\nThanks, Daniel\nJo Chapman on 26 Mar 2025 1:16 PM\nThe answer relates to a different product.\nRWS Community AI on 26 Mar 2025 1:15 PM\n\"Probability score\": 0.7\n\"Question improvement suggestion\": Please provide the exact version of Trados Terminology you are using and any error messages you might have encountered while trying to perform these actions. Also, it would be helpful to know if there have been any recent changes to your system or software.\nIn the meantime, based on the information you have provided, here is a suggested answer to your question:\nHello,\nFrom your description, it seems like you're trying to perform batch operations in Trados Terminology. While Trados Terminology does not directly support batch operations, you can use MultiTerm, which is part of the Trados Studio suite, to perform these tasks.\nHere are the steps you can follow:\nStep 1: Open MultiTerm and select the termbase you want to edit.\nStep 2: For batch editing, you can use the 'Termbase > Edit > Edit Entry' option. You can apply a filter and then change an attribute for all entries at the same time.\nStep 3: For batch deletion, you can use the 'Termbase > Delete Entry' option. Again, you can apply a filter and remove several entries that meet the filter criteria.\nStep 4: For merging entries, you can use the 'Synchronize on Entry Number' option during import to merge terms correctly. \nPlease note that these operations should be performed with caution as they can significantly alter your termbase. Always make sure to back up your termbase before making any changes.\nI hope this answer addressed your question. If not, please reject the answer, add the question improvement suggestion information, and click the RWS Community AI checkbox on the right to try again.\nRWS Community AI\n \nNew replies to\nHELP! I just bought Trados Studio and I am trying to import a TM (.tmx) file created in Wordfast Any...\n by \nVincent Yerna\n on 20 Mar 2025 10:47 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nI just bought Trados Studio and I am trying to import a TM (.tmx) file from Wordfast into the online platform (I don’t have access to the Desktop version for the moment, as I am traveling, worki...\nVincent Yerna on 23 Mar 2025 11:41 PM\nHello Paul\nYour file worked great! But I can't seem to download the tool you recommended. I will work on it a little more tomorrow and get back to you if we don't find a solution.\nPaul on 23 Mar 2025 10:47 PM\nVincent Yerna\n \nok - I didn't have a problem with your file.  I made sure it was well formed, and removed the blank lines, but otherwise made no changes at all.  I put my file here... give it a try:\ncommunity.rws.com/.../en_2D00_fr.zip\nI wonder if you messed up your file in a text editor somehow?  Anyway, try the one I attached in a zip and see if you fare better.  If it works you will need to look deeper ate your actual file and try to find the problematic parts.  Might be worth checking with this tool as a start:\nhttps://www.maxprograms.com/products/tmxvalidator.html\nIf it still fails after that I'd be happy to take a look at your actual TMX if you can share it with me?  Send it to pfilkin at sdl dotcom\nVincent Yerna on 23 Mar 2025 9:37 PM\nHello Paul, I cannot attach the file as requested, (won't let me insert file?) so I will just add it this reply. Let me know if you see anything different in the header. Appreciate any help you can provide.\n<?xml version=\"1.0\" encoding=\"UTF-8\" ?>\r\n\r\n<!DOCTYPE tmx SYSTEM \"tmx14.dtd\" >\r\n\r\n<tmx version=\"1.4\">\r\n\r\n<header creationtool=\"Wordfast Anywhere\" creationtoolversion=\"9.0.00\"\r\n\r\nsegtype=\"sentence\" o-tmf=\"Wordfast TM\" adminlang=\"EN-US\" srclang=\"EN\"\r\n\r\ndatatype=\"unknown\" creationdate=\"20250314T003651Z\">\r\n\r\n<prop type=\"x-header-attribute1\">TM attribute 1,,</prop>\r\n\r\n<prop type=\"x-header-attribute2\">TM attribute 2,,</prop>\r\n\r\n<prop type=\"x-header-attribute3\">TM attribute 3,,</prop>\r\n\r\n<prop type=\"x-header-attribute4\">TM attribute 4,,Score: 99 Score:\r\n\r\n99,Score: 33 Score: 33,Score: 94 Score: 94,Score: 97 Score: 97,Score:\r\n\r\n95 Score: 95,Score: 96 Score: 96</prop>\r\n\r\n</header>\r\n\r\n<body>\r\n\r\n<tu creationdate=\"20220422T203554Z\" creationid=\"KJCSkw\"\r\n\r\nusagecount=\"0\">\r\n\r\n<tuv xml:lang=\"EN\">\r\n\r\n<seg><ph x=\"1\" type=\"x-unknown\" />Jen McMillen Bio - ENGLISH<ph x=\"2\"\r\n\r\ntype=\"x-unknown\" /></seg>\r\n\r\n</tuv>\r\n\r\n<tuv xml:lang=\"FR-CA\">\r\n\r\n<seg><ph x=\"1\" type=\"x-unknown\" />Bio de Jen McMillen - FRANÇAIS<ph\r\n\r\nx=\"2\" type=\"x-unknown\" /></seg>\r\n\r\n</tuv>\r\n\r\n</tu>\r\n\r\n<tu creationdate=\"20220422T204238Z\" creationid=\"KJCSkw\"\r\n\r\nusagecount=\"0\">\r\n\r\n<tuv xml:lang=\"EN\">\r\n\r\n<seg><ph x=\"1\" type=\"x-unknown\" />Vice-Provost for Students, Ryerson\r\n\r\nUniversity<ph x=\"2\" type=\"x-unknown\" /></seg>\r\n\r\n</tuv>\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-03-30T09:02:42+00:00",
    "sent_at": "2025-03-30T09:02:07+00:00",
    "date_extracted": "2025-04-02T19:36:31.125766"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACOZFMKgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAJ1H30jKEitIufffbwnOSiE=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Portfolio Ideas Weekly Digest - 30 Mar 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 30 Mar 2025\nTrados Portfolio Ideas\nTrados Studio Ideas\nNew Posts\nExport the translation of a Indesign File from Trados Studio in Word format\nAutosuggest without having to type first letter\nファイルを開いたとき、直前に閉じたファイルのフィルタ設定が残ったままになっているので困る\nTrados Studio 2024 で「バイリンガルレビューからの更新」で、レビュー済ファイルを指定するときの操作がTrados Studio2022に比べて面倒になった。\nTime spent on segment\nAdd tone detector, suggester and corrector to SDL Trados\nNew Comments\nOption for adding a flag to sdlxliff file not to add a space after segment when reverting to source file format\n \nTrados Enterprise & Accelerate Ideas\nNew Posts\nTQA models: allow users with roles other than Admin, Lead Project Managers, Project Managers to create projects with TQA model added to the project templates\nWorkflow in dashboard\nPreview for Source Files\nNew Comments\nDisplay an updated timestamp for files in Projects view/Files\n \n \nExport the translation of a Indesign File from Trados Studio in Word format\nby \nMariña Tatter Schacht\n on 28 Mar 2025 2:49 PM in \nTrados Studio Ideas\nI receive Indesign files, in idml format, I upload them to SDL Trados Studio, and once translated I need to export them in Word format so that I can make the final editing, and then send it to the client. I do not have the Indesign software, therefore I can't open the export file if it is in idml-format.  \nDaniel Brockmann on 28 Mar 2025 2:58 PM\nHi Mariña - in how far may the Microsoft Word-compatible bilingual review file format help you? See \nExporting files for bilingual review in Word\n \nAutosuggest without having to type first letter\nby \nLeni VERBOGEN\n on 27 Mar 2025 12:17 PM in \nTrados Studio Ideas\nHi, I'd like to see Autosuggest suggest a word after a space, and thus not after typing a letter. In this way, one can work much faster and be sure to see the suggestions. Because now, if I type another letter than the one the word autosuggest wants to propose starts with, I won't see the suggestion in the drop-down menu in the segment itself.\nAn example: if I write 'Please give me a p', with the intention of writing 'proposal', Autosuggest won't prompt me with 'suggestion' instead.\nHowever, if Autosuggest were active right after a space, I would see the word 'suggestion' suggested when I type\n 'Please give me a '.\n \nファイルを開いたとき、直前に閉じたファイルのフィルタ設定が残ったままになっているので困る\nby \nNoriko Hirose\n on 26 Mar 2025 4:19 AM in \nTrados Studio Ideas\n使用バージョン：Trados Studio 2024 (CU2：18.0.2.3255)\nエディタでファイルを開いたとき、直前に閉じたファイルのフィルタ設定が有効のままになっている。\n別プロジェクトのファイルでも同じ。\nCU1までは、閉じたファイルのフィルタ設定が残らない仕様だった。\nファイルを開いたとき、フィルタがかかった状態で表示されるので困る。\n----------------------\nFilter settings persist between files in Trados Studio 2024 CU2\nIn Trados Studio 2024 (CU2: 18.0.2.3255), when opening a file in the Editor, the filter settings from the previously closed file remain active — even if the file belongs to a different project.\nThis is a change from previous behaviour (up to CU1), where filter settings were reset upon closing a file.\nThe result is that newly opened files can appear with filters already applied, which is confusing and inconvenient, especially when working across multiple projects.\nSuggestion:\n Please revert to the previous behaviour where filter settings are cleared when a file is closed.\nDaniel Brockmann on 26 Mar 2025 8:13 AM\nMachine Translation: Title - \nWhen I open a file, the filter settings from the file I just closed remain, which is annoying. Description - v\nersion used: Trados Studio 2024 (CU2: 18.0.2.3255) When I open a file in the editor, the filter settings of the file I just closed remain active.\n The same applies to files in other projects.\n Until CU1, the filter settings of closed files were not retained.\n When I open a file, it is displayed with a filter applied, which is inconvenient.\n \nTrados Studio 2024 で「バイリンガルレビューからの更新」で、レビュー済ファイルを指定するときの操作がTrados Studio2022に比べて面倒になった。\nby \nNoriko Hirose\n on 26 Mar 2025 4:18 AM in \nTrados Studio Ideas\n使用バージョン：Trados Studio 2024 (CU2：18.0.2.3255)\n「バイリンガルレビューからの更新」で、レビュー済ファイルを指定するときの操作がTrados Studio2022に比べて面倒になった。\n・プロジェクト内のsdlxliffファイルを選択状態にするまで、「特定のレビュー文書」ボタンがグレーアウトされている。\n・\n2022\nまでは右クリックでインポートするファイルを選択するダイアログが開いていたが、2024では右クリックでの操作が出来なくなった。\n2022の操作仕様に戻してほしい。\n---------------------------\nIn Trados Studio 2024, the process for specifying the reviewed file when using “Update from Bilingual Review” has become more cumbersome compared to Trados Studio 2022.\nVersion used: Trados Studio 2024 (CU2: 18.0.2.3255)\nWhen using “Update from Bilingual Review”, the steps to specify the reviewed file have become more cumbersome compared to Trados Studio 2022:\nThe “Specific Review Document” button remains greyed out until an SDLXLIFF file within the project is selected.\nIn 2022, right-clicking would bring up a dialogue to select the file for import, but in 2024, right-click functionality is no longer available.\nI would like the behaviour to be reverted to how it was in 2022.\nDaniel Brockmann on 26 Mar 2025 8:16 AM\nMachine Translation: Title: \nIn Trados Studio 2024, the operation for specifying reviewed files in \"Update from Bilingual Review\" has become more complicated than in Trados Studio 2022.\nVersion used: Trados Studio 2024 CU2 (18.0.2.3255). When specifying a reviewed file in \"Update from Bilingual Review,\" the operation has become more troublesome than in Trados Studio 2022. - The \"Specific Review Document\" button is grayed out until an sdlxliff file in the project is selected.\n - Up until 2022, a dialog box for selecting the file to import would open by right-clicking, but in 2024, this is no longer possible by right-clicking.\n I would like the operation specifications to be reverted to those of 2022.\n \nTime spent on segment\nby \nOlav\n on 25 Mar 2025 2:37 PM in \nTrados Studio Ideas\nI would like Trados to track the time I have spent editing a segment. A report as a part of \"Analyze Files\" of Batch tasks would also benefit for sending to project managers as a proof. \nPaul on 25 Mar 2025 2:42 PM\nOlav\n \nYou can do this already with several different plugins:\nhttps://appstore.rws.com/Plugin/76\nhttps://appstore.rws.com/Plugin/16\n \nAdd tone detector, suggester and corrector to SDL Trados\nby \nOlav\n on 25 Mar 2025 2:32 PM in \nTrados Studio Ideas\nI would like Trados to detect, suggest and change the tone of whole file being translated during translation phase. A tone reviewer in the review mode or as one of the QA step could also be useful feature as it would check if all target segments follow the same tone.\nI recall seeing this feature implemented as a Sous-Chef in \nBureau Works Among Innovation Finalists at LocWorld52\n. \n \nNew comments on\nOption for adding a flag to sdlxliff file not to add a space after segment when reverting to source ...\n by \nPascal Zotto\n on 19 Mar 2025 2:19 PM in \nTrados Studio Ideas\nHi, sometimes it would be nice if we could tell Trados not to add a space after certain segments when reverting to source file format. Quite often you get poorly prepared/segmented files from a client...\nSeraina Hartmann on 24 Mar 2025 7:33 AM\n Hi \nPascal Zotto\n \nIs it not better to merge the segments in the editor in this case?\nI imagine you wouldn't want units like \"240-Volt\" and \"Leitung\" to be stored in your TM seperately?\nIf you merge the segments in the editor, you'll have the units properly stored in your TM (\"240-Volt-Leitung\") as well as no problem with spaces at the end of the segments.\nTo merge the segments, select the segments e.g. with click+ctrl > right click > select \"Merge Segments\" -> the content of the selected segments is merged into one single segment.\nExample:\n-> Segment 2 is merged with segment 1:\nI hope this helps.\nHave a great week ahead.\nBest regards\nSeraina\n \nTQA models: allow users with roles other than Admin, Lead Project Managers, Project Managers to crea...\nby \nCarla Galvao\n on 27 Mar 2025 9:20 AM in \nTrados Enterprise & Accelerate Ideas\nCurrently, TE doesn't allow users with role different than Admin, Lead Project Managers or Project Manager (\"Customer Requester\" role for example) can't create any project using a project template that contains a TQA model. This is a big limitation of the system. All users, no matter their role in our system, should be able to create a project with TQA added to the corresponding project template. Could you please fix this asap?\nIan Parnell on 27 Mar 2025 3:55 PM\nHi Carla,\nThis sounds like more of a bug to me, so I suggest we handle this via a support ticket rather than the Ideas area. Can you please raise a Support request to cover this issue?\nCheers,\nIan \n \nWorkflow in dashboard\nby \nHannah Lambie\n on 26 Mar 2025 5:25 PM in \nTrados Enterprise & Accelerate Ideas\nIt would be helpful to see in the dashboard of the project what workflow the project is on, rather than having to click through.\n \nPreview for Source Files\nby \nHannah Lambie\n on 26 Mar 2025 5:22 PM in \nTrados Enterprise & Accelerate Ideas\nWe have a client that uses an Excel template for all projects. The workflow is customised (multilingual file delivery), so it's important that all templates are correct.\nWith 200 + job requestor users, it's really hard to police that the source files are correct, and so the project managers need to download each and every file to check it's correct.\nIt would be super helpful if there was a preview function (like in the review pane) where the PJM could see at a glance whether the template is correct.\nJosje ter Maat on 27 Mar 2025 9:35 AM\nVery good idea that would bring efficiency and time savings for our PJM team. By standard our PJM's are checking the source if it's not XML/HTML to see what is inside. \n \nNew comments on\nDisplay an updated timestamp for files in Projects view/Files\n by \nCAMELIA GHEORGHIES\n on 19 Feb 2025 4:11 PM in \nTrados Enterprise & Accelerate Ideas\nTime stamps in the Files tab in a project in Projects view seem to refer to the task creation rather than the last file update (completion), and this can be misleading. Because the file is actually co...\nCAMELIA GHEORGHIES on 25 Mar 2025 1:35 PM\nWe know that in the Task History view we can see an updated timestamp (task completion date), but we see no reason not to see this information in the Files tab. Or for users to have to change tabs to cross-check information.\nAnyway, it turns out that other colleagues of mine raised the case with Support directly (case 00801572) and there is already a CRQ-34255.\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-03-30T09:02:38+00:00",
    "sent_at": "2025-03-30T09:02:07+00:00",
    "date_extracted": "2025-04-02T19:36:31.898654"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACN9_RmQAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAISnvMADqLpCiltehgTbiWo=",
    "from": "marleen@creolesolutions.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "marleen@creolesolutions.com",
    "in_reply_to": "N/A",
    "subject": "Be Part of Creole’s Digital Future  Maya!",
    "body": "Celebrating 10 Years With Us!\nHaitian Creole In Digital Age: From Spoken Word \nTo Global Platforms.\n \nBonjou Maya!\n \nWhat is possible?\n When it comes to Haitian Creole in the digital age, the answer is more exciting than ever.\n \nFor generations, Creole thrived in conversations, music, and storytelling. But now, it’s making waves in spaces once thought unreachable—on social media, in digital platforms, and across global networks. The demand for Creole is growing and  transforming the way people connect, communicate, and claim their linguistic identity.\n \nIn 2022, Creole Solutions played a pivotal role in this movement, helping one of the world’s biggest tech companies localize their platform entirely in Creole. The result? A moment of pure joy and validation for countless Creole speakers who finally saw their language fully represented in the digital world.\n \nWhat is possible?\n \nHaitian Creole In The Digital Age!\nThe rapid rise in demand for\n Haitian Creole\n was an indication of major shifts in language use. Soon after their arrival, Haitian immigrants in the U.S. no longer relied on the stilted French they had learned in school and instead turned to Creole as their main language of communication. \n \nWith Creole already spoken and used in print, for example for tax forms, it was hardly a surprise that\n social media came next.\n \nThousands of people began to exchange messages in Creole on social platforms. In 2022, \nCreole Solutions\n was selected by one of the giants in the social media business to help translate the entire user interface of their platform.\n \nCreole was entering the digital age, and \nMarleen and her team\n were right in the middle of the effort. Many people had the same response when they first saw the fully localized interface in their own language: Tears of joy.\n \n \nLocWorld\n is the leading conference for global business, translation, and localization—bringing together experts shaping the future of language access. At LocWorld, Marleen Julien shared how\n Haitian Creole\n is making its mark in the digital world, including the launch of a social media platform fully accessible in Creole.\nCelebrate with Us!\n \nWhat’s Next?\nHaitian Creole is making strides in digital spaces. From social media platforms to online learning and business tools, the language is reaching more people than ever before. Creole is no longer just spoken—it’s written, shared, and embedded in the digital world.\n \nEach month, we will highlight a new way Haitian Creole is expanding. Let’s continue the conversation. Share your thoughts and experiences—because every step forward for Creole is a step toward greater access and visibility.\nLearn more about us\n \nStay in the loop!\nFor more updates and exciting news, make sure to follow our page and stay connected with us on social media. \n \n \n \n \nCreole Solutions, 4957 Oakton Street, Suite 203, Skokie, IL 60076, United States \nManage preferences",
    "received_at": "2025-03-27T20:01:05+00:00",
    "sent_at": "2025-03-27T20:00:47+00:00",
    "date_extracted": "2025-04-02T19:36:31.930358"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACNtcrhQAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAHfBMId3pcFPpXlrUIoQywo=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "[Webinar invite] Is there anything AI can’t do?",
    "body": "Don't miss out—reserve your spot now and get ahead of the curve!\nView in browser\n \n \nWEBINAR INVITATION | AI: BEYOND THE HYPE\n \nIs there anything AI can’t do? \nTuesday 8 April 2025 | 15:00 BST, 16:00 CEST, 10:00 EDT | 60-minute webinar\nRegister today\n \nExploring AI’s Real-World Limits in Localization\n \nAI’s strengths are everywhere—but what about its limitations?\n \nJoin Matthias Heyn, Technology Product Manager, as he uncovers the practical boundaries of AI, clarifying both its potential and pitfalls. You'll gain essential insights to confidently navigate the evolving AI landscape and leverage it effectively in the localization industry.\n \nDon't miss out—reserve your spot now and get ahead of the curve!\nSecure your free seat today!\n \nCan't make the date? Don't worry – register anyway and we'll send you the recording. This webinar will be presented in English.\n \nMissed a Session? Watch On-Demand Now!\nCatch up on our groundbreaking \nAI: Beyond the Hype\n webinar series—now available on-demand. Explore essential insights into AI’s lasting impact on the future of translation and localization. Find out what comes next once the AI buzz fades.\nWatch now\n \n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-27T12:00:22+00:00",
    "sent_at": "2025-03-27T12:00:08+00:00",
    "date_extracted": "2025-04-02T19:36:31.920988"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACNtcrhAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQANYoP31svyhFlpQWNgBo_Ag=",
    "from": "postmaster@lcwmail.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "postmaster@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "You have new held messages",
    "body": "You have new held messages\nYou can release all of your held messages and permit or block future emails from the senders, or manage messages individually.\nRelease all\n   \nPermit all\n   \nBlock all\n   \n \nYou can also manage held messages in your \nPersonal Portal\n.\n \nSpam Policy\nahmedaelsayeed@gmail.com\nRe: Arabic language solutions provider\n2025-03-26 07:55\nRelease\n   \nPermit\n   \nBlock\n   \n \n \nRelease all\n   \nPermit all\n   \nBlock all\n   \n \n \n \n \n© 2025 Mimecast Services Limited and affiliates.",
    "received_at": "2025-03-26T16:02:19+00:00",
    "sent_at": "2025-03-26T16:02:12+00:00",
    "date_extracted": "2025-04-02T19:36:32.542801"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACNMwxhgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAEpGoXaLnu5Fp4Ca_7cxOBo=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "Struggling with File Compatibility? We have an Answer!",
    "body": "Discover how Trados Studio 2024's expanded file type support can streamline your translation projects and boost productivity.​\nView in browser\n \n \nContact us\nStruggling with File Compatibility? Trados Studio 2024 Has the Answer!\nHey Multilingual Maverick,\n \nWe have a few questions for you:\n \n❓ Are you encountering challenges when working with diverse file formats in your translation projects?\n \n❓ Do you wish for a more streamlined process to handle multilingual Excel files efficiently?\n \n❓ Would you like to enhance your translation capabilities with broader file type support?\n \nWe have the perfect solution!\n \nIntroducing Trados Studio 2024's Enhanced File Compatibility!\n \n✔️ \nSupport for Over 50 File Types\nHandle a vast array of file formats, from Microsoft Word and Excel to complex XML files, ensuring you can work on any project without compatibility concerns.\n \n✔️ \nMultilingual Excel File Type\nEffortlessly manage and translate multilingual Excel files using the dedicated file type, streamlining your workflow and reducing manual processing.\n \n✔️ \nLegacy File Type Compatibility\nEasily work with legacy Trados file types, including ITD, TTX, and Bilingual Workbench, by installing the Trados Compatibility and Migration Power Pack app, ensuring seamless integration with older projects.\n \n✔️ \nAdvanced File Type Configuration\nCustomize settings for various file types to suit your specific project needs, providing flexibility and control over your translation process.\n \nElevate your translation experience with Trados Studio 2024's comprehensive file type support.\n \nAre you ready to transform your translation workflow?\n \nUpgrade today and save 20% on Trados Studio 2024 Professional! \n \nOr take advantage of our \n3 for 2\n offer on multiple licenses—delivering unbeatable value for growing teams.\nContact us today to learn more\n \nOffer valid until March 31.\n Find out more \nabout the world's leading computer-assisted translation software. Pricing excludes local taxes. For more information on this offer, please \ncontact us\n.\n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-25T20:03:25+00:00",
    "sent_at": "2025-03-25T20:03:08+00:00",
    "date_extracted": "2025-04-02T19:36:32.740216"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACLenTXgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAK5C38NAGExEu2BN5BKTlWg=",
    "from": "hello@creolesolutions.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "marleen@creolesolutions.com",
    "in_reply_to": "N/A",
    "subject": "🎉 March Newsletter: 10 Years & Beyond | Featured in Multilingual, Women’s Empowerment & More!",
    "body": "Join us for Women’s Month workshops & more!\nCelebrating a Decade\n with us!\nAs of 2025, our newsletter is now bilingual! To access the Haitian Creole version, \nsign up here\n.\n \nAs we kick off 2025, we are thrilled to celebrate \n10 years of Creole Solutions!\n This milestone is a testament to our commitment to bridging language barriers and empowering communities through translation, interpretation, and cultural expertise. We have an exciting year ahead, and we look forward to sharing our journey with you.\n \nWhat’s Possible with Haitian Creole Series\nAs part of our 10th-anniversary celebration, we are launching a new series: \nWhat’s Possible with Haitian Creole.\n Each month, we will explore different ways Haitian Creole is making an impact across industries and communities. So far, we have covered:\nJanuary Spotlight: Job Growth\n – How Haitian Creole can open doors for careers in translation, interpretation, customer service, healthcare, and more.\nFebruary Spotlight: Learning \n– The role of Haitian Creole in education, and its use in science, technology, and academic research to make knowledge more accessible.\nThis series is our way of reflecting on the journey so far and envisioning the future of Haitian Creole in various sectors. \nStay tuned \nfor more topics, including success stories, insights, and the evolving role of Haitian Creole in today’s world!\nOur Contribution\nto the Language Industry\nMarleen Julien Featured in MultiLingual Magazine:\nWe are proud to announce that \nMarleen Julien \nhas been featured in \nMultiLingual Magazine’s 2025 Language Industry Influencers list! \nThe February 2025 issue highlights individuals shaping the language industry, showcasing voices too impactful to ignore.\n \nThis recognition underscores Marleen's contributions to language accessibility and the promotion of Haitian Creole on a global scale.\nRead the feature\n \nCommunity Engagement for Women’s Month:\nIn honor of Women’s Month, we are excited to present a workshop at the Community Fair, hosted by the Haitian Grassroots Coalition of the Midwest. This session will cover essential resources, including:\n \n✅ \nBusiness registration\n – How to navigate the process of starting a business.\n✅ \nSocial media marketing\n – Strategies for building an online presence.\n✅ \nDigital tools\n – Leveraging Canva, Amazon’s Digital Doors, and other platforms for business growth.\n📆 Date: \nMarch\n 22, 2025\n📍Location: \nInternational District Community Center - \n3540 Commercial Dr, Indianapolis, IN 46222\n \nHelp us spread the word! If you know someone who could benefit from this workshop, please share this with them.\nPremium Interpreting Services\n Creole Line\nWe offer premium interpreting services for businesses, organizations, and individuals seeking professional Haitian Creole interpreters. Whether for medical, legal, business, or community needs, our on-demand and remote interpreting services ensure clear and effective communication.\n \n📞 \nDon't miss out on our Creole Line.\n \nRequest an interpreter today!\nCall \n312-598-2173\n or visit our website.\nLearn more\n \n🇭🇹 \nCreole Corner 🇭🇹\nBannann Peze\nHave you tried \nBannann Peze\n?\nIf not, you’re missing out on a simple yet flavorful treat! Here’s why it’s a staple in Haitian cuisine:\n🍌 Made from \ngreen plantains\n, which are sliced, fried, smashed, and fried again for the perfect crispy texture.\n🔥 Best enjoyed fresh, often with a sprinkle of salt or served alongside \nfried meats, seafood, or sauces\n.\n🌶️ Pairs perfectly with \npikliz\n, adding a tangy and spicy contrast.\n \n📸 \nCraving this dish?\n Click below for the recipe! If you give it a try, don’t forget to tag us in your photos—we’d love to see your creations!\nGet the recipe\n \nStay in the loop!\nFor more updates and exciting news, make sure to follow our page and stay connected with us on social media. \nVisit our website\n \n \n \n \n \nCreole Solutions, 4957 Oakton Street, Suite 203, Skokie, IL 60076, United States \nUnsubscribe\n \nManage preferences",
    "received_at": "2025-03-14T18:11:09+00:00",
    "sent_at": "2025-03-14T18:10:57+00:00",
    "date_extracted": "2025-04-02T19:36:32.650786"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACLenTXQAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAJsyW-H3KOdCq_FwrUcCA5k=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "Do you want to know the secret to effortless project management?",
    "body": "Introducing the Manager View in Trados Studio 2024!\nView in browser\n \n \nContact us\nDo you want to know the secret to effortless project management?\nDear Translation Trailblazer,\n \n❓ Are you juggling \nmultiple translation projects \nand seeking a more efficient way to manage them?\n \n❓ Do you find switching between different views and tools \nslows down your workflow\n?\n \n❓ Would you like a centralized hub to access all your projects, files, and reports seamlessly?\nIntroducing the Manager view in Trados Studio 2024!\n \n✔️ \nUnified Workspace\nAccess all your projects, files, and reports in one centralized location, eliminating the need to switch between different views.\n \n✔️ \nEnhanced Search and Sorting\nQuickly locate projects or files using advanced search filters and sorting options, saving you valuable time.\n \n✔️ \nGantt Chart Visualization\nGet a clear visual representation of your project timelines with the integrated Gantt chart, helping you manage deadlines more effectively.\n \n✔️ \nMulti-Project Handling\nEasily open and manage multiple projects simultaneously, allowing for greater flexibility and efficiency in your workflow.\n \n✔️ \nSeamless Mid-Project Updates\nEffortlessly add new files or make changes to ongoing projects without disrupting your workflow.\n \nAre you ready to transform your project management experience?\nUpgrade to Trados Studio 2024 today and take advantage of our exclusive offers!\n🔥 \nUpgrade Today and Save 20% on Trados Studio 2024 Professional! 🔥\n \nOr take advantage of our \n3 for 2\n offer on multiple licenses—delivering unbeatable value for growing teams.\nContact us today to learn more\n \nOffer valid until March 31.\n Find out more \nabout the world's leading computer-assisted translation software. Pricing excludes local taxes. For more information on this offer, please \ncontact us\n.\n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-13T16:03:05+00:00",
    "sent_at": "2025-03-13T16:02:48+00:00",
    "date_extracted": "2025-04-02T19:36:33.160131"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACLenTXAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAC1DKE9OscdHpzybgb8sNgk=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "Initial agenda released for ELEVATE 2025! 🎉",
    "body": "With five tracks over three days, there really is something for everyone at ELEVATE 2025, the industry's biggest online translation event.\nView in browser\n \n \nContact us\nELEVATE 2025\nMay 6-8, 2025\n \nView agenda and register\n \nThe initial lineup of the ELEVATE 2025 agenda is here! \nGet a first look at some of the exciting sessions, expert speakers, and key topics shaping \nELEVATE 2025\n, the biggest FREE online localization event of the year. With\n five tracks over three days\n, there’s something for everyone.\nDay 1:\n \nInnovate\n \n- Explore emerging technologies, new ways of working with existing tools, and how the industry is driving innovation.\nDay 2: Motivate\n - Stay ahead of the curve and be inspired with in-depth discussions on industry trends and the future of translation.\nDay 3: Educate\n \n- Learn from product demos and practical how-to sessions to sharpen your skills and unlock new possibilities.\nStay tuned as we unveil more sessions\n in the coming weeks. Can't make it live? No problem. Register and you’ll get on-demand access after the event. \nView agenda\n \nRegister now\n \nPlease note: All sessions will be delivered in English, with selected sessions available in multiple languages through AI-powered speech translation and captions, courtesy\n of \nKUDO\n \nand \nLanguage Weaver\n.\n \n \n \n \n \n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-12T15:21:51+00:00",
    "sent_at": "2025-03-12T15:21:42+00:00",
    "date_extracted": "2025-04-02T19:36:33.373249"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACK68UbAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAM_TGvJDyglFpG8pWZT4oJY=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio Weekly Digest - 9 Mar 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 9 Mar 2025\nTrados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio\nProduct Updates\nNew Posts\nTrados 25.03.1 Release\n \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nNew Questions\nTermbase on Trados live Team\nHi, We need to know how to activate the leverage analysis of internal fuzzy matches.\nQA checker restrictions visible for customer reviewers\nNew Replies\nTranslation Engine Search Logic\n \n \nTrados 25.03.1 Release\nby \nIan Parnell\n on 3 Mar 2025 4:36 PM in \nProduct Updates\nThe latest Trados release is now available and we are excited to share the new functionality that has been delivered.\n \nNew features and updates are automatically added to your account so just log in to Trados and they will be available immediately.\n \nWorkflow views\n(Applies to\n \nTrados Team, Accelerate and Enterprise)\nPrior to this release, it was possible to view workflows and interact with them in two different ways: either as a vertical list of tasks and phases (the Vertical view) or as a horizontal representation (the Phases view) that was introduced in late-2024. We announced at that time the Vertical view will be removed in an upcoming release.\nBased on customer feedback, we are introducing a new List view. The List view works similarly to the Phases view but presents tasks and phases as a vertical list for users that prefer this layout design.\nThe legacy Vertical view will be removed before the end of March 2025. We therefore encourage users to familiarize themselves with the Phases or List views prior to the Vertical view before removed.\nBatch replace files in Inbox\n(Applies to\n \nTrados Team, Accelerate and Enterprise)\nWhen uploading files for accepted tasks from the Inbox, we have extended the automated file matching to check the Task ID from previous tasks.\nAs a practical example, a linguist downloads a file at the Translation task prior to completing the task. This linguist is then also assigned to the subsequent Linguistic Review task, and they upload the same file they downloaded at the earlier Translation task, as it may be more efficient to implement changes in the previous file.\nIf the linguist now uploads the previous file, it will now be automatically matched, despite the Task ID in the file coming from the earlier Translation task.\nIn this scenario, users will be presented with a warning message to explain how the match was identified and to only proceed if this is their intended action, to help prevent human error.\nAnalysis statistics in Inbox\n(Applies to\n \nTrados Team, Accelerate and Enterprise)\nWe now include a breakdown of the analysis statistics in the Inbox, so users with tasks assigned to them can easily access this information to help manage and prioritize their workload. Each category from the analysis statistics is displayed as a separate column from a user’s Inbox, with the exception of fuzzy matches which are aggregated into a single column. \nNote: the analysis statistics are only displayed for tasks that are based at target file level and for tasks created following this release. The columns will appear empty for tasks that were created prior to this release.\nAd-hoc cost type for Pricing Models\n(Applies to\n \nTrados Accelerate and Enterprise)\nWe have introduced a new Ad-hoc cost type for Pricing Models that can be used when you want to include a flat cost that isn’t dependent on any other variable in a project, such as the word or page count. Where configured, an Ad-hoc cost can be set implicitly in the original Pricing Model or added during the Customer Quote Review or Vendor Quote Review tasks.\nVendor Pricing Models\n(Applies to\n \nTrados Accelerate and Enterprise)\nWe have introduced greater flexibility in vendor pricing models to support costs based on a service type.\nPrior to this release, it was already possible to create additional language costs in vendor pricing models based on a service type. With the release, you can also now create additional project costs based on a service type.\nIn addition, you can also define service type costs at language level by entering a cost for each of the bands contained in the pricing model.\nQuote templates for Vendors\n(Applies to\n \nTrados Accelerate and Enterprise)\nIt is now possible to apply quote templates to vendor quotes. \n \nQuote templates allow you to adapt the format and layout of a quote, by including your own logo and controlling which information and content should be included. For more information on quote templates, please consult the original release \nannouncement\n or product \ndocumentation\n. In addition, sample quote templates can be found under the Files section in the Trados \nCommunity\n.\n \nTo apply quote templates for vendors, you should first create the quote template in the usual manner from the Resources section under the Pricing menu. Once available, you can then associate a quote template with a vendor from the \nVendor > Settings\n page, so this is applied to quotes from that vendor.\n \nCustom Reporting updates\n(Applies to\n \nTrados Accelerate and Enterprise)\nImage component in Custom Reporting\nReport authors can now upload images directly from their local desktop to QuickSight for a variety of use cases, such as adding company logos and branding, including background images with free-form layout, and creating captivating story covers. This feature also supports tooltip and alt text, providing additional context and accessibility for consumers. Furthermore, it offers navigation and URL actions, enabling authors to make their images interactive, such as triggering specific dashboard actions when the image is clicked.\nFont Customization for Visuals\nThe Custom Reporting module in Trados now supports the ability to customize fonts across specific visuals. Authors can completely customize fonts for Table and Pivot table visuals, while for remaining visuals, they can customize fonts for specific properties including the title, subtitle, legends title and legends values. \nAuthors can set the font size (in pixels), font family, color, and styling options like bold, italics, and underline. With this update, you can align the dashboard's fonts with your organization's branding guidelines, creating a cohesive and visually appealing experience. Additionally, the font customization options can help improve the readability and meet accessibility standards, especially when viewing visuals on a large screen.\nCustom Reporting Workshop\nLater this year, we will be hosting a Custom Reporting workshop as part of our ELEVATE conference, the localization industry's largest online event. This will be of particular interest to report authors working in Trados and help customers unlock the full potential of our custom reporting module. ELEVATE is taking place between the 6-8th May 2025, and you can secure your place at the event by registering \nhere\n.\nAPI updates\nAlthough there are no \nchanges to the \nAPI this time, we would like to \ninform \nusers that \nthe \nAPI Keys\n mechanism is being deprecated\n. It will no longer be possible to create new \nAPI Keys\n and users should employ the \nApplication\n \nmethodology\n going forward.\n To keep \nup to date\n with \nAPI changes, \nwe recommend checking with the \nWhat’s New\n page \nregularly to get \nmore details.\nPublic API: UI Extensibility beta\nAs announced previously, we have introduced support for User Interface (UI) Extensions which offer the possibility to add custom user interface elements and functionality. Custom buttons and panels can be added to specific places within the user interface.\n \nUI Extensibility is initially being offered in BETA. Customers interested in evaluating this functionality should keep in mind that significant changes are planned prior to the full release. For more details, please refer to the \ndocumentation\n page.\n \nAdditional changes\nWhen choosing to include termbases when downloading a package, we now only include termbases that contain language pairs corresponding to the selected tasks\n \nUsers can download a report including a full audit trail of changes made to the project due date.\n \nUsers can change task due dates during project creation in Trados. This feature is supported when using the Phases or List workflow views and is only available to users with the \nProjects > Planning\n permission.\n \nThe Service Status page is now directly accessible from the Help & Documentation menu in the Trados user interface.\n \nVarious bug fixes and UX enhancements\n \nFinally, I would like to draw your attention to a recent webinar summarizing the new features delivered in Trados during 2024. If you missed the live webinar or would like to watch a recap of the features that were delivered over the last 12 months, you can access the recording \nhere\n. \nBy registering for access to this recording, you will also receive invitations to future Trados webinars. \n \nTrados Product Management\n \n \nTermbase on Trados live Team\nby \nMarianna Leporini\n on 6 Mar 2025 8:55 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nI can't see the Termbase on Trados live team\nI was assigned a project using Trados live team. When I open Trados live team I get this notification: There are resources you don’t have access to and you can’t edit this translation engine. As a consequence, I can’t see the project’s Termbase neither on Trados live team nor on Trados Studio 2024. A collegue is working on the same project, the PM followed the same steps when assigned us our respective files, but they can see translation engine resources. How can I solve this problem?\nPaul on 8 Mar 2025 7:43 AM\nMarianna Leporini\n \nI suggest you speak to the admin for your Trados Team instance and make sure that you have been given the appropriate permissions to access it.  Trados Team is a permissions based solution... you can read about how this works here and it might help you understand where the problem may be:\nhttps://docs.rws.com/en-US/trados-team-791595/user-roles-and-their-permissions-729430\n \nHi, We need to know how to activate the leverage analysis of internal fuzzy matches.\nby \nMuzammil Irshad\n on 5 Mar 2025 9:45 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nIn Trados Studio, we’re able to make this additional analysis through the batch activities, but we want to reach the same report we get in Studio on Trados Team (attaching an example from Studio):\nCan you please advise on how to activate this analysis report?\nThank you in advance\nPaul on 5 Mar 2025 10:40 AM\nMuzammil Irshad\n \nYou don't have to activate anything.  You just create a project in Trados Team that has a TM available, and then the report is automatically there in your Dashboard for the project:\nAlso under Reports:\nIf you mean you want to be able to see the exact same report in Trados Team when you push the project to Trados Team from Studio then is also occurs the same way.  I pushed a Trados Studio project to the cloud, that looked like this:\nAnd when it got there it looks like this:\nThere is a slight discrepancy in the total segments (I have no idea why - \nPhillip Maieski\n ) but the analysis report was pushed with the project.\n \nQA checker restrictions visible for customer reviewers\nby \nLucile Barbieri\n on 4 Mar 2025 10:40 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello, in the QA checker settings, when applying % restrictions in the number of characters of the target file, the translator is being informed about this limitation. However, the customer reviewer is not. I need to set up an error message for the customer reviewer so he is able to see this limitation when reviewing the files. Otherwise it does not make sense. Thanks.\n \nNew replies to\nTranslation Engine Search Logic\n by \nCaroline Hétu\n on 20 Feb 2025 4:49 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello! I have a question regarding translation engine search logic. If we have a translation engine containing several translation memories. how does Trados process when bringing back translation segm...\nCaroline Hétu on 5 Mar 2025 1:20 PM\nIt's indeed bad news. It would be really great it priority could be given to the TMs order. \nNeeltje Stuurman on 3 Mar 2025 10:57 AM\nOK< thanks for confirming. \nIt's bad news but still good to know\nPatrik Mazanek on 3 Mar 2025 10:51 AM\nI reviewed this once more and I was not correct, currently for matches with the same match value ordering is as follow:\n- change date\n- use count\n- TM order\nThis should be consistent behavior between Studio and Trados Cloud.\nNeeltje Stuurman on 3 Mar 2025 9:45 AM\nPatrik Mazanek\n \nAh, so that would mean that in the example above the \"Grondstoffen\" translation would be returned, even thoigh it is 'older', as the TM is higher up in the order?\nThat would be a massive relief!\nPatrik Mazanek on 3 Mar 2025 9:40 AM\nFirst we look across all TMs, on all hits, a TM specific penalty is applied. Then the results are returned based on the match value. For results with the same value, we sort them by the TM order, then by the dates.\nNeeltje Stuurman on 3 Mar 2025 9:26 AM\nHi Christian, \nDoes it always work like this in TE? Surely this makes no sense whatsoever, at least not for cases where matches from different TMs have the same percentage.\nThe whole reason people save content in different TMs and out them in a sequence is because they want to be able to ensure that the translation from TM AA is prioritized over the translation in TM BB when matches from the 2 TMs have the same match percentage. Applying the translation with the highest match percentage out of all the available TMs is fine, but when there are 2 matches with the same percentage from different TMs the translations from the first TM in the sequence, i.e. in TM AA, would need to be prioritized, even if it has an older creation/modification date.\nFor example one of our cllients has split their content into multiple \"modules\". There is often a lot of overlap in the source content for these modules, but the translations for the same sopurce will have to be different in different modules. So the client decided to have separate TMs for each module, and then to apply the TM for that specific module first in the sequence without a penalty while the TMs for the other modules get applied later on in the sequence.\nThe expectation is that this will ensure that if there is a translation in the first, module specific TM in the sequence, this will get reused as is while any translation from the TMs for the other modules will only get applied if there is no module-specific translation in the main TM.\nFor example, \nlet’s say we have a TU with the source text “Resources” in both the 'Maintenance' module TM and the ;Finance' module TM.\nIn the Maintenance TM the translation is “Grondstoffen”, and this translation has been created/modified on the 1\nst\n of Jan 2025.\nAnd in Finance the translation is “Middelen”, and this translation has been created/modified on the 2\nnd\n oyf Jan 2025 .\nThe expectations is that when we are applying the TMs to the Maintenance module, the translation from the Maintenance TM, namely “Grondstoffen”, would be applied, eventhoigh this has an older creation/modification date, as this is the translation specific to this module.\nBut what you are saying is that due to the way TMs in TE work, that’s not what will happen as TE would apply the most recent translation, which is “Middelen” from the Finance TM. Which would be wrong for the client.\nSo the TM apply logic should be:\n1. Apply highest match percentage\n2. If there are multiple matches from diffferent TMs, apply the match from the TM that is highest up in the sequences\nCreated/modified date should have no relevance whatsoever\nIs there any chance this can be amended?\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-03-09T09:35:34+00:00",
    "sent_at": "2025-03-09T09:34:56+00:00",
    "date_extracted": "2025-04-02T19:36:33.405195"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACK68UawAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQACNIapRs0W5Il4g6VRn7ooE=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Portfolio Ideas Weekly Digest - 9 Mar 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 9 Mar 2025\nTrados Portfolio Ideas\nTrados Studio Ideas\nNew Posts\nDefault behaviour in translation status - can it be changed?\nFile preview in Editor view\nSupport for QA checker files (.jason) exported from Trados Team in Trados Studio\nNew Comments\nUse Trados Studio to mark sources against reference materials\n \nTrados Team Ideas\nNew Posts\nSupport for QA checker files (.jason) exported from Trados Team in Trados Studio\n \nTrados Enterprise & Accelerate Ideas\nNew Comments\nAdd ability to filter and download reports from the vendor orders and quotes views\n \n \nDefault behaviour in translation status - can it be changed?\nby \nÖzge Ünlü\n on 7 Mar 2025 1:24 PM in \nTrados Studio Ideas\nHello,\nWhen finishing translation in Trados Studio, the default behavior is that the project status changes to \"In review\", the progress bar of the translation is reset to 0. We would like to know if we can change this default behaviour and avoid that Studio automatically switches the projects to \"In review\" status.\nThanks in advance.\nKR\nÖzge\nJerzy Czopik on 7 Mar 2025 1:36 PM\nOf course you need to do a QA on your own translation. But again: it is YOU who changes the status of the segment. A modified segment has the status draft (or translation rejected or sign-off rejected) and that is a sign, something was wrong with it. This is work in progress. Before delivery you will usually accept all segments in either translation, review or sign-off process. Then your file will also have the right status. But during work in progress the status must be kept as it is.\nPlease don't take me wrong, but this is what makes TS so unique. You can follow all steps done and if you are being audited, this is also a way to show the auditor, if the file has really been revised.\nPhilippe Riondel on 7 Mar 2025 1:30 PM\nI support that suggestion. This is annoying, since after completing a translation, we usually have to self revise it or to do some QA, and the project is not yet \"In review\", from the translator's stand point.\nJerzy Czopik on 7 Mar 2025 1:29 PM\nThis is not Trados Studio, it is the user. If you change the status of just one segment to translation rejected or translation approved, Trados will treat the file then as being revised. This is a feature and should NOT be changed at all. You have trhee processes in TS: translation, revision and sign-off. Properly used these are great for keeping track of what has happened with file(s) in project. In your case simply make sure all segments have the same status, i.e. translated, translation approved or signed off. But there are a lot of situations, where you need to keep some segments in not translated status—and in such cases the status of the file will of course show this.\n \nFile preview in Editor view\nby \nAna Benita Sanchez\n on 5 Mar 2025 9:28 AM in \nTrados Studio Ideas\nIt would be very useful if the Editor view from Trados Studio could have a preview pane which displays when hovering over each of the files, for example to see if they have been pre-translated without having to open them. Something similar to the Windows explorer preview pane.\nAna Benita Sanchez on 5 Mar 2025 9:33 AM\nSorry corrected: \nIt would be very useful if the Files view from Trados Studio could have a preview pane which displays when hovering over each of the files, for example to see if they have been pre-translated without having to open them. Something similar to the Windows explorer preview pane.\n \nSupport for QA checker files (.jason) exported from Trados Team in Trados Studio\nby \nChie Matoba\n on 5 Mar 2025 4:32 AM in \nTrados Studio Ideas\nHello. It would be great if a QA checker file (.jason) exported from Trados Team could be imported to Trados Studio or converted to the format supported by Trados Studio.\n \nNew comments on\nUse Trados Studio to mark sources against reference materials\n by \nDiana Palenzuela\n on 12 Feb 2025 1:25 PM in \nTrados Studio Ideas\nHi, Community! We are looking for a way to mark files (currently these are Word files that are highlighted) to identify text coming from various reference materials. Studio already identifies terms or...\nJesús Prieto on 7 Mar 2025 10:12 AM\nMybe you need something like this?\n \nTo tagFy all the TB items in OneGo\n \n \nSupport for QA checker files (.jason) exported from Trados Team in Trados Studio\nby \nChie Matoba\n on 5 Mar 2025 4:35 AM in \nTrados Team Ideas\nHello. It would be great if a QA checker file (.jason) exported from Trados Team could be imported to Trados Studio or converted to the format supported by Trados Studio.\n \nNew comments on\nAdd ability to filter and download reports from the vendor orders and quotes views\n by \nRussell Banton\n on 17 Nov 2023 9:27 PM in \nTrados Enterprise & Accelerate Ideas\nAdding the ability to filter by start date, customer, etc. and then download a report with the data will enable a vendor to easily get a report for their work they supported.\nIan Parnell on 7 Mar 2025 1:12 PM\nHi Russell,\nthe first version of the report won't include the details of the owner/assignee but we plan to include this in a subsequent version of the report.\nCheers,\nIan\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-03-09T09:35:24+00:00",
    "sent_at": "2025-03-09T09:34:56+00:00",
    "date_extracted": "2025-04-02T19:36:33.864531"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACK68UagAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQADXFuAuaYJ5PisTKO433dac=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio Weekly Digest - 9 Mar 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 9 Mar 2025\nTrados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio\nProduct Updates\nNew Posts\nTrados 25.03.1 Release\n \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nNew Questions\nTermbase on Trados live Team\nHi, We need to know how to activate the leverage analysis of internal fuzzy matches.\nQA checker restrictions visible for customer reviewers\nNew Replies\nTranslation Engine Search Logic\n \n \nTrados 25.03.1 Release\nby \nIan Parnell\n on 3 Mar 2025 4:36 PM in \nProduct Updates\nThe latest Trados release is now available and we are excited to share the new functionality that has been delivered.\n \nNew features and updates are automatically added to your account so just log in to Trados and they will be available immediately.\n \nWorkflow views\n(Applies to\n \nTrados Team, Accelerate and Enterprise)\nPrior to this release, it was possible to view workflows and interact with them in two different ways: either as a vertical list of tasks and phases (the Vertical view) or as a horizontal representation (the Phases view) that was introduced in late-2024. We announced at that time the Vertical view will be removed in an upcoming release.\nBased on customer feedback, we are introducing a new List view. The List view works similarly to the Phases view but presents tasks and phases as a vertical list for users that prefer this layout design.\nThe legacy Vertical view will be removed before the end of March 2025. We therefore encourage users to familiarize themselves with the Phases or List views prior to the Vertical view before removed.\nBatch replace files in Inbox\n(Applies to\n \nTrados Team, Accelerate and Enterprise)\nWhen uploading files for accepted tasks from the Inbox, we have extended the automated file matching to check the Task ID from previous tasks.\nAs a practical example, a linguist downloads a file at the Translation task prior to completing the task. This linguist is then also assigned to the subsequent Linguistic Review task, and they upload the same file they downloaded at the earlier Translation task, as it may be more efficient to implement changes in the previous file.\nIf the linguist now uploads the previous file, it will now be automatically matched, despite the Task ID in the file coming from the earlier Translation task.\nIn this scenario, users will be presented with a warning message to explain how the match was identified and to only proceed if this is their intended action, to help prevent human error.\nAnalysis statistics in Inbox\n(Applies to\n \nTrados Team, Accelerate and Enterprise)\nWe now include a breakdown of the analysis statistics in the Inbox, so users with tasks assigned to them can easily access this information to help manage and prioritize their workload. Each category from the analysis statistics is displayed as a separate column from a user’s Inbox, with the exception of fuzzy matches which are aggregated into a single column. \nNote: the analysis statistics are only displayed for tasks that are based at target file level and for tasks created following this release. The columns will appear empty for tasks that were created prior to this release.\nAd-hoc cost type for Pricing Models\n(Applies to\n \nTrados Accelerate and Enterprise)\nWe have introduced a new Ad-hoc cost type for Pricing Models that can be used when you want to include a flat cost that isn’t dependent on any other variable in a project, such as the word or page count. Where configured, an Ad-hoc cost can be set implicitly in the original Pricing Model or added during the Customer Quote Review or Vendor Quote Review tasks.\nVendor Pricing Models\n(Applies to\n \nTrados Accelerate and Enterprise)\nWe have introduced greater flexibility in vendor pricing models to support costs based on a service type.\nPrior to this release, it was already possible to create additional language costs in vendor pricing models based on a service type. With the release, you can also now create additional project costs based on a service type.\nIn addition, you can also define service type costs at language level by entering a cost for each of the bands contained in the pricing model.\nQuote templates for Vendors\n(Applies to\n \nTrados Accelerate and Enterprise)\nIt is now possible to apply quote templates to vendor quotes. \n \nQuote templates allow you to adapt the format and layout of a quote, by including your own logo and controlling which information and content should be included. For more information on quote templates, please consult the original release \nannouncement\n or product \ndocumentation\n. In addition, sample quote templates can be found under the Files section in the Trados \nCommunity\n.\n \nTo apply quote templates for vendors, you should first create the quote template in the usual manner from the Resources section under the Pricing menu. Once available, you can then associate a quote template with a vendor from the \nVendor > Settings\n page, so this is applied to quotes from that vendor.\n \nCustom Reporting updates\n(Applies to\n \nTrados Accelerate and Enterprise)\nImage component in Custom Reporting\nReport authors can now upload images directly from their local desktop to QuickSight for a variety of use cases, such as adding company logos and branding, including background images with free-form layout, and creating captivating story covers. This feature also supports tooltip and alt text, providing additional context and accessibility for consumers. Furthermore, it offers navigation and URL actions, enabling authors to make their images interactive, such as triggering specific dashboard actions when the image is clicked.\nFont Customization for Visuals\nThe Custom Reporting module in Trados now supports the ability to customize fonts across specific visuals. Authors can completely customize fonts for Table and Pivot table visuals, while for remaining visuals, they can customize fonts for specific properties including the title, subtitle, legends title and legends values. \nAuthors can set the font size (in pixels), font family, color, and styling options like bold, italics, and underline. With this update, you can align the dashboard's fonts with your organization's branding guidelines, creating a cohesive and visually appealing experience. Additionally, the font customization options can help improve the readability and meet accessibility standards, especially when viewing visuals on a large screen.\nCustom Reporting Workshop\nLater this year, we will be hosting a Custom Reporting workshop as part of our ELEVATE conference, the localization industry's largest online event. This will be of particular interest to report authors working in Trados and help customers unlock the full potential of our custom reporting module. ELEVATE is taking place between the 6-8th May 2025, and you can secure your place at the event by registering \nhere\n.\nAPI updates\nAlthough there are no \nchanges to the \nAPI this time, we would like to \ninform \nusers that \nthe \nAPI Keys\n mechanism is being deprecated\n. It will no longer be possible to create new \nAPI Keys\n and users should employ the \nApplication\n \nmethodology\n going forward.\n To keep \nup to date\n with \nAPI changes, \nwe recommend checking with the \nWhat’s New\n page \nregularly to get \nmore details.\nPublic API: UI Extensibility beta\nAs announced previously, we have introduced support for User Interface (UI) Extensions which offer the possibility to add custom user interface elements and functionality. Custom buttons and panels can be added to specific places within the user interface.\n \nUI Extensibility is initially being offered in BETA. Customers interested in evaluating this functionality should keep in mind that significant changes are planned prior to the full release. For more details, please refer to the \ndocumentation\n page.\n \nAdditional changes\nWhen choosing to include termbases when downloading a package, we now only include termbases that contain language pairs corresponding to the selected tasks\n \nUsers can download a report including a full audit trail of changes made to the project due date.\n \nUsers can change task due dates during project creation in Trados. This feature is supported when using the Phases or List workflow views and is only available to users with the \nProjects > Planning\n permission.\n \nThe Service Status page is now directly accessible from the Help & Documentation menu in the Trados user interface.\n \nVarious bug fixes and UX enhancements\n \nFinally, I would like to draw your attention to a recent webinar summarizing the new features delivered in Trados during 2024. If you missed the live webinar or would like to watch a recap of the features that were delivered over the last 12 months, you can access the recording \nhere\n. \nBy registering for access to this recording, you will also receive invitations to future Trados webinars. \n \nTrados Product Management\n \n \nTermbase on Trados live Team\nby \nMarianna Leporini\n on 6 Mar 2025 8:55 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nI can't see the Termbase on Trados live team\nI was assigned a project using Trados live team. When I open Trados live team I get this notification: There are resources you don’t have access to and you can’t edit this translation engine. As a consequence, I can’t see the project’s Termbase neither on Trados live team nor on Trados Studio 2024. A collegue is working on the same project, the PM followed the same steps when assigned us our respective files, but they can see translation engine resources. How can I solve this problem?\nPaul on 8 Mar 2025 7:43 AM\nMarianna Leporini\n \nI suggest you speak to the admin for your Trados Team instance and make sure that you have been given the appropriate permissions to access it.  Trados Team is a permissions based solution... you can read about how this works here and it might help you understand where the problem may be:\nhttps://docs.rws.com/en-US/trados-team-791595/user-roles-and-their-permissions-729430\n \nHi, We need to know how to activate the leverage analysis of internal fuzzy matches.\nby \nMuzammil Irshad\n on 5 Mar 2025 9:45 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nIn Trados Studio, we’re able to make this additional analysis through the batch activities, but we want to reach the same report we get in Studio on Trados Team (attaching an example from Studio):\nCan you please advise on how to activate this analysis report?\nThank you in advance\nPaul on 5 Mar 2025 10:40 AM\nMuzammil Irshad\n \nYou don't have to activate anything.  You just create a project in Trados Team that has a TM available, and then the report is automatically there in your Dashboard for the project:\nAlso under Reports:\nIf you mean you want to be able to see the exact same report in Trados Team when you push the project to Trados Team from Studio then is also occurs the same way.  I pushed a Trados Studio project to the cloud, that looked like this:\nAnd when it got there it looks like this:\nThere is a slight discrepancy in the total segments (I have no idea why - \nPhillip Maieski\n ) but the analysis report was pushed with the project.\n \nQA checker restrictions visible for customer reviewers\nby \nLucile Barbieri\n on 4 Mar 2025 10:40 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello, in the QA checker settings, when applying % restrictions in the number of characters of the target file, the translator is being informed about this limitation. However, the customer reviewer is not. I need to set up an error message for the customer reviewer so he is able to see this limitation when reviewing the files. Otherwise it does not make sense. Thanks.\n \nNew replies to\nTranslation Engine Search Logic\n by \nCaroline Hétu\n on 20 Feb 2025 4:49 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello! I have a question regarding translation engine search logic. If we have a translation engine containing several translation memories. how does Trados process when bringing back translation segm...\nCaroline Hétu on 5 Mar 2025 1:20 PM\nIt's indeed bad news. It would be really great it priority could be given to the TMs order. \nNeeltje Stuurman on 3 Mar 2025 10:57 AM\nOK< thanks for confirming. \nIt's bad news but still good to know\nPatrik Mazanek on 3 Mar 2025 10:51 AM\nI reviewed this once more and I was not correct, currently for matches with the same match value ordering is as follow:\n- change date\n- use count\n- TM order\nThis should be consistent behavior between Studio and Trados Cloud.\nNeeltje Stuurman on 3 Mar 2025 9:45 AM\nPatrik Mazanek\n \nAh, so that would mean that in the example above the \"Grondstoffen\" translation would be returned, even thoigh it is 'older', as the TM is higher up in the order?\nThat would be a massive relief!\nPatrik Mazanek on 3 Mar 2025 9:40 AM\nFirst we look across all TMs, on all hits, a TM specific penalty is applied. Then the results are returned based on the match value. For results with the same value, we sort them by the TM order, then by the dates.\nNeeltje Stuurman on 3 Mar 2025 9:26 AM\nHi Christian, \nDoes it always work like this in TE? Surely this makes no sense whatsoever, at least not for cases where matches from different TMs have the same percentage.\nThe whole reason people save content in different TMs and out them in a sequence is because they want to be able to ensure that the translation from TM AA is prioritized over the translation in TM BB when matches from the 2 TMs have the same match percentage. Applying the translation with the highest match percentage out of all the available TMs is fine, but when there are 2 matches with the same percentage from different TMs the translations from the first TM in the sequence, i.e. in TM AA, would need to be prioritized, even if it has an older creation/modification date.\nFor example one of our cllients has split their content into multiple \"modules\". There is often a lot of overlap in the source content for these modules, but the translations for the same sopurce will have to be different in different modules. So the client decided to have separate TMs for each module, and then to apply the TM for that specific module first in the sequence without a penalty while the TMs for the other modules get applied later on in the sequence.\nThe expectation is that this will ensure that if there is a translation in the first, module specific TM in the sequence, this will get reused as is while any translation from the TMs for the other modules will only get applied if there is no module-specific translation in the main TM.\nFor example, \nlet’s say we have a TU with the source text “Resources” in both the 'Maintenance' module TM and the ;Finance' module TM.\nIn the Maintenance TM the translation is “Grondstoffen”, and this translation has been created/modified on the 1\nst\n of Jan 2025.\nAnd in Finance the translation is “Middelen”, and this translation has been created/modified on the 2\nnd\n oyf Jan 2025 .\nThe expectations is that when we are applying the TMs to the Maintenance module, the translation from the Maintenance TM, namely “Grondstoffen”, would be applied, eventhoigh this has an older creation/modification date, as this is the translation specific to this module.\nBut what you are saying is that due to the way TMs in TE work, that’s not what will happen as TE would apply the most recent translation, which is “Middelen” from the Finance TM. Which would be wrong for the client.\nSo the TM apply logic should be:\n1. Apply highest match percentage\n2. If there are multiple matches from diffferent TMs, apply the match from the TM that is highest up in the sequences\nCreated/modified date should have no relevance whatsoever\nIs there any chance this can be amended?\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-03-09T09:18:49+00:00",
    "sent_at": "2025-03-09T09:17:53+00:00",
    "date_extracted": "2025-04-02T19:36:34.065367"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACK68UaQAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAHE_QZ3B0kFDtNp5s-u3esM=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Portfolio Ideas Weekly Digest - 9 Mar 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 9 Mar 2025\nTrados Portfolio Ideas\nTrados Studio Ideas\nNew Posts\nDefault behaviour in translation status - can it be changed?\nFile preview in Editor view\nSupport for QA checker files (.jason) exported from Trados Team in Trados Studio\nNew Comments\nUse Trados Studio to mark sources against reference materials\n \nTrados Team Ideas\nNew Posts\nSupport for QA checker files (.jason) exported from Trados Team in Trados Studio\n \nTrados Enterprise & Accelerate Ideas\nNew Comments\nAdd ability to filter and download reports from the vendor orders and quotes views\n \n \nDefault behaviour in translation status - can it be changed?\nby \nÖzge Ünlü\n on 7 Mar 2025 1:24 PM in \nTrados Studio Ideas\nHello,\nWhen finishing translation in Trados Studio, the default behavior is that the project status changes to \"In review\", the progress bar of the translation is reset to 0. We would like to know if we can change this default behaviour and avoid that Studio automatically switches the projects to \"In review\" status.\nThanks in advance.\nKR\nÖzge\nJerzy Czopik on 7 Mar 2025 1:36 PM\nOf course you need to do a QA on your own translation. But again: it is YOU who changes the status of the segment. A modified segment has the status draft (or translation rejected or sign-off rejected) and that is a sign, something was wrong with it. This is work in progress. Before delivery you will usually accept all segments in either translation, review or sign-off process. Then your file will also have the right status. But during work in progress the status must be kept as it is.\nPlease don't take me wrong, but this is what makes TS so unique. You can follow all steps done and if you are being audited, this is also a way to show the auditor, if the file has really been revised.\nPhilippe Riondel on 7 Mar 2025 1:30 PM\nI support that suggestion. This is annoying, since after completing a translation, we usually have to self revise it or to do some QA, and the project is not yet \"In review\", from the translator's stand point.\nJerzy Czopik on 7 Mar 2025 1:29 PM\nThis is not Trados Studio, it is the user. If you change the status of just one segment to translation rejected or translation approved, Trados will treat the file then as being revised. This is a feature and should NOT be changed at all. You have trhee processes in TS: translation, revision and sign-off. Properly used these are great for keeping track of what has happened with file(s) in project. In your case simply make sure all segments have the same status, i.e. translated, translation approved or signed off. But there are a lot of situations, where you need to keep some segments in not translated status—and in such cases the status of the file will of course show this.\n \nFile preview in Editor view\nby \nAna Benita Sanchez\n on 5 Mar 2025 9:28 AM in \nTrados Studio Ideas\nIt would be very useful if the Editor view from Trados Studio could have a preview pane which displays when hovering over each of the files, for example to see if they have been pre-translated without having to open them. Something similar to the Windows explorer preview pane.\nAna Benita Sanchez on 5 Mar 2025 9:33 AM\nSorry corrected: \nIt would be very useful if the Files view from Trados Studio could have a preview pane which displays when hovering over each of the files, for example to see if they have been pre-translated without having to open them. Something similar to the Windows explorer preview pane.\n \nSupport for QA checker files (.jason) exported from Trados Team in Trados Studio\nby \nChie Matoba\n on 5 Mar 2025 4:32 AM in \nTrados Studio Ideas\nHello. It would be great if a QA checker file (.jason) exported from Trados Team could be imported to Trados Studio or converted to the format supported by Trados Studio.\n \nNew comments on\nUse Trados Studio to mark sources against reference materials\n by \nDiana Palenzuela\n on 12 Feb 2025 1:25 PM in \nTrados Studio Ideas\nHi, Community! We are looking for a way to mark files (currently these are Word files that are highlighted) to identify text coming from various reference materials. Studio already identifies terms or...\nJesús Prieto on 7 Mar 2025 10:12 AM\nMybe you need something like this?\n \nTo tagFy all the TB items in OneGo\n \n \nSupport for QA checker files (.jason) exported from Trados Team in Trados Studio\nby \nChie Matoba\n on 5 Mar 2025 4:35 AM in \nTrados Team Ideas\nHello. It would be great if a QA checker file (.jason) exported from Trados Team could be imported to Trados Studio or converted to the format supported by Trados Studio.\n \nNew comments on\nAdd ability to filter and download reports from the vendor orders and quotes views\n by \nRussell Banton\n on 17 Nov 2023 9:27 PM in \nTrados Enterprise & Accelerate Ideas\nAdding the ability to filter by start date, customer, etc. and then download a report with the data will enable a vendor to easily get a report for their work they supported.\nIan Parnell on 7 Mar 2025 1:12 PM\nHi Russell,\nthe first version of the report won't include the details of the owner/assignee but we plan to include this in a subsequent version of the report.\nCheers,\nIan\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-03-09T09:18:35+00:00",
    "sent_at": "2025-03-09T09:17:52+00:00",
    "date_extracted": "2025-04-02T19:36:34.076553"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACKcynRgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAA0CFrY8gZ5LgH5niQoe0aY=",
    "from": "noreply@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@rws.com",
    "in_reply_to": "N/A",
    "subject": "New RWS Support Portal",
    "body": "New RWS Support Portal\nView in browser\n \n \nSupport Portal Link Correction\n \nWe’ve identified that some IT systems with additional link-checking features may be experiencing issues with the link provided in our previous email.\n \nTo access the portal, please type: \ngateway.rws.com\n directly into your browser address bar.\n \nThank you for your patience!\nThe RWS Support Team\nYou are receiving this communication as it contains important information that could impact your usage of our products. Whilst these operational communications are necessary based on your status as a customer, if you \ndo not \nwish to receive these emails you can let us know by emailing \nengage@rws.com\n or by clicking this link \nhere\n.\n \nYou may receive separate marketing emails in future depending on your selections recorded in our \npreference center\n, which you can visit to change your preferences for marketing emails. \n \n \n \n \n \n \n \nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \n© 2024 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-06T09:13:29+00:00",
    "sent_at": "2025-03-06T09:13:21+00:00",
    "date_extracted": "2025-04-02T19:36:34.766579"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACJ5lh1gAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAGwK7VdKtW1CseHlEVUB2t0=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "Save the date for ELEVATE! | March 2025 Newsletter",
    "body": "Start getting excited for ELEVATE...\nView in browser\n \n \nContact us\nMarch 2025 Newsletter\n \nELEVATE\n6-\n8 May 2025\nSave the date!\n \n📅 Mark your calendars! ELEVATE returns for a bigger and bolder edition spanning across three exciting days filled with learning, inspiration, and connection.\n \nThis year's edition will include our annual \nRWS Campus\n event, making it our biggest conference yet! Over three days, ELEVATE will provide valuable insights and connections for everyone in the translation industry – from students starting their localization journey to seasoned experts.\n \nHere’s a rundown of what you can expect:\nDay 1: \nInnovate\n - Dive into hands-on product training, live demos, and practical how-to sessions designed to sharpen your skills and unlock new possibilities.\nDay 2: \nMotivate\n \n- Stay ahead of the curve with in-depth discussions on industry trends and transformative innovations shaping the future of translation.\nDay 3: \nEducate\n - Focused sessions tailored for students and lecturers, offering specialized content to inspire and prepare the next generation of translation professionals.\nWe're busy finalizing the agenda, however you can secure your \nFREE\n place now by registering below. What's more, when you sign up you'll have the opportunity to watch our bonus sessions, which will be available to view in the days before ELEVATE.\nSave the date\n \nWebinars\nView all recorded webinars\n \nHow to translate in Trados Studio |\n Webinar\n19 March | \n10:00 EST | 07:00 PST\n \nWith Trados Studio, you can choose to work with file-based or cloud-based projects either in the desktop application or in a browser. So, with so much flexibility, how do you get started?\nJoin our webinar to learn the basics as we will demo several features and explain how to combine the sophistication of the desktop environment with the power of the cloud to increase your productivity.\nWatch\n \nBoost LSP's efficiency with AI in Trados cloud solutions | \nWebinar \n20 March | \n09:00 EST | 06:00 PST\n \nDiscover how Language Service Providers (LSPs) can unlock new levels of efficiency with the powerful AI capabilities available in Trados cloud offerings. Join us to learn how to leverage cutting-edge features like Generative Translation and Smart Review that can empower you to work smarter, deliver more value to your clients and stay ahead in an increasingly competitive industry.\nWatch\n \nCan't make the date? Don't worry – register anyway and we'll send you the recording.\nThese webinars will be presented in English.\nBlogs\nRead all our blogs\n \nWhy upgrading from Trados Studio 2021 to 2024 is a smart move \nIf you're still using Trados Studio 2021, you might be wondering whether upgrading to the 2024 version is worth it. \nWell, absolutely! \nUpgrading isn’t just about staying current; it’s about working smarter and faster. In this blog, we explore how Studio 2024 can take your translation workflow to the next level. \nRead blog\n \nWhat's new in Trados Q4 2024\nLooking back at the past months, we're excited to share a host of advancements in Trados. Notably, we've continued to significantly refine our workflow and vendor capabilities, enhanced user collaboration, and introduced a brand-new Neural Fragment Recall feature. Read this blog to discover all the improvements made to Trados. \nRead blog\n \nUpcoming events \nwe're looking forward to...\n \nVamos Juntos CDMX 2025\nMarch 12-15 2025, Mexico City\n \nThis March, we’re excited to support VAMOS JUNTOS 2025 as a Silver Sponsor! Come and visit us on our booth to discover the latest in Trados technology, discuss industry trends and hear how we’re using AI technology effectively.\nRegister\n \n \nLegalweek 2025\nMarch 24-27 2025, Ottawa\n \nDescribed as the “leading conference for the legal technology industry,\" and one that “hits all the marks for information, education, and networking”, Legalweek transcends the traditional conference model to deliver unparalleled expertise, networking, and technological innovation.\nRegister\n \nDiscover how Trados connects everyone to translate everything\nDownload our brochure to learn how Trados solutions help LSPs of any size or maturity:\nMonitor project progress to meet tight deadlines\nHandle a larger volume of smaller translation projects\nSecurely manage the translation of all content types, across all repositories, for any customer\nLearn more\n \n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-05T16:16:47+00:00",
    "sent_at": "2025-03-05T16:16:37+00:00",
    "date_extracted": "2025-04-02T19:36:34.740400"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACJ5lh1QAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAItKjmcdEcJCntkmygHlWHg=",
    "from": "engage@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "engage@rws.com",
    "in_reply_to": "N/A",
    "subject": "Riding the AI Shockwave",
    "body": "Download our global research report today\nView in browser\n \n \n \nAround 70% of global consumers are seeing an increase in AI generated content\nWhat does this mean for businesses and consumers? How do we navigate the opportunities for experimentation and enthusiasm? Is the role of humans in tool development a significant consideration for consumers and does it impact their trust?\n \nWe're excited to share with you the launch of our research report: \nUnlocked 2025: Riding the AI Shockwave\n.\n Based on research across 14 global markets across North America, Europe, Africa and Asia, the report explores answers to the questions above and delves into the ways in which businesses are actively using AI across their global communications and consumer sentiments on the rapid evolution of the AI landscape.\n \nOur report delves into five critical themes:\nPerspective is everything\nThree pillars of AI trust\nFrom deficit to dividend\nBeyond words\nNative is the new normal\nGet ready to explore these themes and more in our new report.\nClick here to download\n \n \n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-04T15:14:35+00:00",
    "sent_at": "2025-03-04T15:14:23+00:00",
    "date_extracted": "2025-04-02T19:36:34.859563"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACJ5lh1AAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQANEybsiV4YBPuYnLc9Mh-Ic=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "Project(s) will soon be archived",
    "body": "Project 2024266 Diligent Teck Resources- Charitable Donations will soon be archived. \nDear \nMaya Benoit \n, \nProject \n2024266 Diligent Teck Resources- Charitable Donations\n is due to be archived on \n10 March 2025 5 PM, UTC\n; at which point, the actions that can be performed for the project will be restricted. \nDETAILS \nAccount\n \nLanguage and Culture Worldwide, LLC\nCustomer\n \nCompliance Wave\nProject Short ID\n \n403\nProject Name\n \n2024266 Diligent Teck Resources- Charitable Donations\nDescription\n \nLanguages\n \nen-US -> es-AR, tr-TR \nDue Date\n \n18 Sep 2024, UTC\n  \nClick \nhere\n to view more details about this project. \n \nJoin our Community \nFind answers to your questions, or contribute your own on the RWS Community! \n \nNeed more help? \nGet in touch with the human side of RWS! \n \n \nAll contents copyright © 2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-03-03T17:13:50+00:00",
    "sent_at": "2025-03-03T17:13:36+00:00",
    "date_extracted": "2025-04-02T19:36:35.622835"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACJmdTiAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAHq-2hNqPbFMup57s1BY7wo=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio Weekly Digest - 2 Mar 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 2 Mar 2025\nTrados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio\n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nNew Replies\nWorking with WorldServer packages in Trados Team\nTranslation Engine Search Logic\nIs there a webhooks delivery log available in Trados Team?\nDelete a wrong project in Trados Cloud\nHow to generate and download an analysis report in Teams using the API?\nAllow multiple source languages per project\n \n1. General\nNew Replies\nI want to create new role for my students to translate, but I dont have the section ROLES&PERMISSION so that I can create the new role for my students\n \n \nNew replies to\nWorking with WorldServer packages in Trados Team\n by \nJean-François Pelletier\n on 21 Feb 2025 12:57 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello all, I would like to know if there are general guidelines or tips about working with WS packages in Team, or experience to share. I can extract the .sdlxliff documents from the .wsxz packages, j...\nSébastien Desautel on 25 Feb 2025 10:30 PM\nHello Jean-François,\nyes, this is correct. and yes: 1. import the sdlxliff in a new project, 2. import the TMX in TMs (that are already set up in the translation engine to make this easy) and 3. start the project/workflow to get the analysis from TE.\nThe analysis algorithms are not exactly the same in TE and WS so you must expect some differences between the respective reports when only the TMX are leveraged.\nKind regards\nSébastien\nJean-François Pelletier on 24 Feb 2025 7:17 PM\nThanks again, Sébastien!\nIt's all clear and it makes sense. Can I ask for one more clarification if you don't mind? From what I understand, the .SDLXLIF files won't contain any fuzzy matches. So it means that if we reanalyze the files with the TMX included, we could (and should) leverage more fuzzy matches for the translators, correct? So the process would be to import the .SDLXIFF and the TMX, reanalyze the files and generate new reports?\nKind regards,\nJF\nSébastien Desautel on 24 Feb 2025 6:27 PM\nHello Jean-François,\nTT will recognize the 100% matches (or better) as translated. For the untranslated segments, you can do whatever you want, like for a standard file: use your own settings (TM and/or MT) to pretranslate them, and yes this can be done with other fuzzy match categories. \nOne thing you won't be able to change is the segmentation.\nIf you would like to leverage the segments exported as tmx, you will have to import them in the TM used for the analysis.\nUse \"Always overwrite existing translation\" or \"Overwrite existing translation if better match found.\" if the sdlxliff files are pretranslated with fuzzy matches and you want to prioritize your assets over WS pretranslation. \nWS pretranslation below 100% won't be taken into account in the analysis at all. The segments will be simply pretranslated and without any match in your TT TM, these segments will be counted as \"new match\" in the analysis.\nKind regards\nSébastien\nJean-François Pelletier on 24 Feb 2025 4:49 PM\nThanks, \nDaniel Brockmann\n !\nI'm working with the API and SnapLogic to automate the tasks as much as possible, so no manual steps such as opening the packages in Studio. I know that the API has limitations, so my questions are really more about finding those limitations before they block me.\nKind regards,\nJF\nJean-François Pelletier on 24 Feb 2025 4:45 PM\nHello \nSebastien Desautel\n ,\nThanks a lot for your input! I also found out that the files seem to be processed very straight forward, and that the delivery packages are nothing else than the zipped .sdlxliff files.\nI have another question if you don't mind (and if \nDaniel Brockmann\n  doesn't delete your reply... \n😉\n ) : The source files are already pre-translated and populated, however the source file packages also contain .tmx files and some reporting data. How flexible is TT in case we need to re-apply MT, TM, and re-analyze using a different fuzzy matches breakdown category?\nKind regards,\nJF\nDaniel Brockmann on 24 Feb 2025 10:08 AM\nSorry \nSebastien Desautel\n  - I inadvertently deleted your answer, apologies! Here it is again:\n\"Hello Jean-François,\nI worked on a similar project: the flow of the sdlxliff files in Trados Team is comparable to any other files. You can upload them in a new project and let them go through a standard workflow. TT detects the language direction of each file and will only prepare the file for the dedicated direction. You just have to take care that all language directions are available in the project template you are using, otherwise some sdlxliff files will be set as reference.\nFor the delivery, the translated files can be zipped and uploaded to WorldServer (I believe .zip extension is fine). That's at least what worked on the WS server we worked on. WS can find the internal path to upload the files through their metadata. So you don't have to create a specific return package. \nAs far as I can remember, you can also zip files from different projects together and upload them at once.\nKind regards\nSébastien\"\nSébastien Desautel on 24 Feb 2025 10:04 AM\nHello Jean-François,\nI worked on a similar project: the flow of the sdlxliff files in Trados Team is comparable to any other files. You can upload them in a new project and let them go through a standard workflow. TT detects the language direction of each file and will only prepare the file for the dedicated direction. You just have to take care that all language directions are available in the project template you are using, otherwise some sdlxliff files will be set as reference.\nFor the delivery, the translated files can be zipped and uploaded to WorldServer (I believe .zip extension is fine). That's at least what worked on the WS server we worked on. WS can find the internal path to upload the files through their metadata. So you don't have to create a specific return package. \nAs far as I can remember, you can also zip files from different projects together and upload them at once.\nKind regards\nSébastien\nDaniel Brockmann on 24 Feb 2025 9:57 AM\nHi JF - you might be able to use the save to cloud flow here, that is. open the WorldServer package in Studio and save it to cloud there (right click on project name and use Save to Cloud). You can also continue the SDLXLIFF extraction route, in that case you would need to manually replace the translated SDLXLIFF files in your local project target language folders after delivery. Thanks, Daniel\n \nNew replies to\nTranslation Engine Search Logic\n by \nCaroline Hétu\n on 20 Feb 2025 4:49 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello! I have a question regarding translation engine search logic. If we have a translation engine containing several translation memories. how does Trados process when bringing back translation segm...\nCaroline Hétu on 25 Feb 2025 1:23 PM\nThanks for your answer!\nIf we work entirely locally in Trados Studio using the same TMs, will the same logic apply?\nCristian Cozma on 25 Feb 2025 10:19 AM\nHi Caroline,\nThe results will be prioritized based on the higher percentage match principle. You may have a 95% match in your Memory AA but if you have a higher match in Memory BB or Memory CC, that will be suggested. If you have 2 matches with the same percentage in different TMs, the most recent one (Created on or Modified on) will be suggested.\nI hope this helps! If you need more details however or you have any concerns this not working as expected in your case, please raise a support ticket from your RWS accounts and our technical suport team will gladly investigate this: \nhttps://gateway.sdl.com/apex/communityknowledge?articleName=000001889\nBest regards,\n \nNew replies to\nIs there a webhooks delivery log available in Trados Team?\n by \nJean-François Pelletier\n on 19 Feb 2025 7:53 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello, I stopped receiving webhooks from my instance of Team almost 24 hours ago, and I wanted to know if there is a delivery log somewhere in Team where I can check the status? Thanks all in advance!...\nJean-François Pelletier on 24 Feb 2025 3:52 PM\nHello \nMaria Miron\n,\nThanks a lot for your reply and offer to assist. I do not need this log for any current particular case, and I wouldn't want to request it every time, however I often use the webhooks delivery logs to troubleshoot solutions with other TMSs that I work with, and I find them very useful.\nFor now I have my answer, there is no tracker/log that I can access directly, and I'll request a copy if I'm really stuck.\nThanks again for your help and have a nice day!\nKind regards,\nJF\nMaria Miron on 24 Feb 2025 12:55 PM\nHi \nJean-François Pelletier\n ,\nThere is no status or log for tracking webhook delivery. However, we can assist you if you provide the tenant ID and webhook URL.\nMaria Miron\nDaniel Brockmann on 24 Feb 2025 10:42 AM\nHi JF - tagging \nMaria Miron\n  for potential advice on this one. Thanks, Daniel\n \nNew replies to\nDelete a wrong project in Trados Cloud\n by \nAdalgisa Mendes Hammerschmid\n on 18 Feb 2025 11:09 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello i have a licence for Trados Studio 2024. I started a project in the wrong way in cloud. I want to delete the project and start again in Studio. After searching and getting instructions of the co...\nElisa Maxim on 24 Feb 2025 9:03 PM\nIt is easier to just delete the project than accessing the Files section and deleting from there. For how to delete the project, please see the steps I mentioned above.\nKind regards,\nAdalgisa Mendes Hammerschmid on 24 Feb 2025 1:01 PM\nHi Elisa Maxim,\nthan you for answering, i did already tried to follow the instructions in the link. But the bottom \"delete\" is not selectable.\nPlease find attached a screen shot. I want to delete all data in the project. \n \nNew replies to\nHow to generate and download an analysis report in Teams using the API?\n by \nJean-François Pelletier\n on 12 Feb 2025 9:35 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello all, I'm new to Team and I'm trying to generate and download the analysis reports by language and file for a project using the API. I can't seem to see any endpoint for that, all tha...\nDaniel Brockmann on 25 Feb 2025 2:29 PM\nThank you JF, credit where credit's due - thanks \nDavid Pooley\n !\nJean-François Pelletier on 25 Feb 2025 2:14 PM\nHello \nDaniel Brockmann\n ,\nThis is exactly what I was looking for, thanks a lot! I will be able to make the detailed reports as by the requirements, this will make a lot of people happy. :-)\nKind regards,\nJF\nDaniel Brockmann on 25 Feb 2025 8:59 AM\nHi again JF,\nI also got this from an internal thread which was similar and this kind of question was asked:\n\"You can call:\n/projects/{projectId}?fields=id,shortId,name,description - get some basic information about the project\n/projects/{projectId}/target-files - get a list of target files\n/projects/{projectId}/target-files/{fileId}?fields=name,languageDirection,analysisStatistics - get the target file analysis statistics\nThis can give you an Excel like this:\nJust as additional info/insight.\nThanks, Daniel\n \nNew replies to\nAllow multiple source languages per project\n by \nLucas Graf\n on 11 Feb 2025 9:21 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nTrados does not allow multiple source languages per project so for any project that has bidirectional translations, such as English<->Spanish, multiple projects need to be created and then group...\nElisa Maxim on 28 Feb 2025 4:02 PM\nHi \nLucas Graf\n \nTrados has the AnyTM function, please see \nhttps://gateway.sdl.com/apex/communityknowledge?articleName=000003696\nPlease also take a look at the following resources: \nhttps://www.youtube.com/watch?v=8doQlofpthE\nhttps://www.facebook.com/watch/?v=10153996232997376\nKind regards,\n \nNew replies to\nI want to create new role for my students to translate, but I dont have the section ROLES&PERMIS...\n by \nAlbino Chavale\n on 16 Feb 2025 2:47 PM in \n1. General\nI’m setting a new group of students that will be using RWS to translate. I’ve managed to create customer and as it is explained in the video teaching with RWS I have to create a new role s...\nRadu Boloveschi on 24 Feb 2025 3:20 PM\nAlbino Chavale\n We will be pleased to help you with this problem so have logged a support case on your behalf. We do prioritise customers who have a support contract so please keep in mind it could take up to 48 hours, especially over a weekend, but rest assured we will contact you as soon as we can. You will be contacted at the email address used for this Community. Support Case Id : 00889574 . \n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-03-02T09:44:32+00:00",
    "sent_at": "2025-03-02T09:44:06+00:00",
    "date_extracted": "2025-04-02T19:36:35.476344"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACJmdThwAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAC37N7OO10xJvkscy6m0m8k=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Portfolio Ideas Weekly Digest - 2 Mar 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 2 Mar 2025\nTrados Portfolio Ideas\nTrados Enterprise & Accelerate Ideas\nNew Posts\nInclude timestamp and username in the list of uploaded files in Engineering tasks\nMake the customization of the list/table view we see in a project in Projects view stick across the board\nSorting by \"project due date\" in the Inbox\nAbility to filter or search in Neural Machine Translation Models\nAccess for Selective Termbase Editing\nImprove overall Vendor profiling\nShow Profile languages in Groups\nNew Comments\nMachine Translation step: Choose \"MT for pretranslation\" or \"MT for lookup\"\nAdd segment number to verification messages\nKick user to login page with Trados Enterprise times out\nMore easily show word count broken down by file\nExpand QA checking for translation consistency to entire projects\nAllow copy and paste of tags in Online Editor from source to target segment\nAdd ability to filter and download reports from the vendor orders and quotes views\nVendor needs ability to download report including volume and costs for a certain time period for ease of invoicing\n \nTrados Studio Ideas\nNew Posts\nSupport for Preview of XML2: OASIS DITA 1.3 Compliant-based XML and DITA Files using XSLT\nNew Comments\nOnly include target language-specific entries from a termbase when creating project packages\nEmbedded Content Processing for JSON should line-breaks without segment break\n \nTrados Terminology Ideas\nNew Posts\nBe able to connect Multiterm to cloud termbase\n \nTrados Team Ideas\nNew Comments\nMore sortable columns in Projects area\n \n \nInclude timestamp and username in the list of uploaded files in Engineering tasks\nby \nCAMELIA GHEORGHIES\n on 27 Feb 2025 4:40 PM in \nTrados Enterprise & Accelerate Ideas\nOur pre-processing and post-processing engineers have complained that the list of files successively uploaded to replace source files or target files does not contain sufficient information to help them distinguish information. They can only see information such as V1, V2 etc., but they find that other details such as timestamp or username of the person uploading would be very useful in this respect.\n \nMake the customization of the list/table view we see in a project in Projects view stick across the ...\nby \nCAMELIA GHEORGHIES\n on 27 Feb 2025 3:36 PM in \nTrados Enterprise & Accelerate Ideas\nCurrently, when we customize the view in tabs such as Files and Task History in a project in Projects view (tabs where we see a list/table), we can customize the list so as not to see certain columns or we can move columns around. However, this customization does not stick: once we go out of that project and come back to it, the customization is gone. In addition, this customization has to be carried out each time for each project, whereas users might have always the same needs regardless of the project. So it would be useful is Trados Enterprise UI could remember the customization per user (so across the board, for all projects).\n \nSorting by \"project due date\" in the Inbox\nby \nCAMELIA GHEORGHIES\n on 27 Feb 2025 12:54 PM in \nTrados Enterprise & Accelerate Ideas\nWould it be possible to activate the sort by \"project due date\" in the Inbox? It works in the projects view, but not from the Inbox, where it is greyed out. Our project managers can see in their Inbox the project due date for the Planning type of tasks and they need to be able to sort by project due date, to prioritise projects with a tight deadline.\n \nAbility to filter or search in Neural Machine Translation Models\nby \nPeter Johnston\n on 27 Feb 2025 11:48 AM in \nTrados Enterprise & Accelerate Ideas\nIt would be great to be able to have some sort of filter or search capability in the Neural Machine Translation Models page. \nIt's hopeless trying to find a specific model when there's 2000+ in the page and no filter or search capabilities\n \nAccess for Selective Termbase Editing\nby \nTerence Tsang\n on 25 Feb 2025 11:12 PM in \nTrados Enterprise & Accelerate Ideas\nCurrently, granting a user editing permissions allows them to edit all termbases within a location.\nWe need the ability to grant editing access to specific termbases rather than all, allowing terminologists and subject matter experts to update only the relevant ones. There is strong internal demand for more granular access control to enable efficient termbase maintenance while preventing unintended modifications to restricted termbases.\n \nImprove overall Vendor profiling\nby \nThomas Alwood\n on 25 Feb 2025 3:47 PM in \nTrados Enterprise & Accelerate Ideas\nThe information you can record in Enterprise regarding vendors is currently limited basically to name, email and pricing. In the past 20 years there has been a revolution in the translation industry in regards to vendor management include information such as quality metrics, registration steps, availability and other metadata which help Project Managers assign the best vendor to a task. Currently we have to manage this information outside of Enterprise which is very inconvenient. These are now pretty standard features in most Translation Business Management Systems.\n \nShow Profile languages in Groups\nby \nBernhard Hoell\n on 24 Feb 2025 12:36 PM in \nTrados Enterprise & Accelerate Ideas\nCurrently the assigned languages for service types are only visible if you edit the user account - this is a problem:\nDue to SSO integration, all our users are created at ROOT level and then added to different groups, after they have been given respective service types and language pair configurations to allow assigning the group and use the flexible workflow assignment.\nI have full access to the users profiles, translation lead project managers on subsequent customer folders however may not even see which languages the users are able to handle.\nIt would be really useful to allow the Groups view that shows all users in a certain group to contain not only the name and email, but to contain the assigned languages and service types for those users likewise.\nThis would make it easier for the Lead PJMs to check if they have users for all relevant languages before they use the group based workflow assignment that takes into account the service type and language configuration.\n \nNew comments on\nMachine Translation step: Choose \"MT for pretranslation\" or \"MT for lookup\"\n by \nVera Malysheva\n on 23 Jan 2025 3:49 PM in \nTrados Enterprise & Accelerate Ideas\nCurrently, if you create a new project and add an MT provider to your Translation Engine, the MT will be automatically pre-filled into the segments. This is useful for some cases, however, in other ca...\nTerence Tsang on 27 Feb 2025 7:40 PM\nHi Vera and other users who may be following this: I was informed that a feature was developed to control this behaviour in the online editor. You can find it View > Options (Settings).\nThis was a great first step, but I still suggested some changes to this feature. As the feature is currently enabled by default, this would mean that we as the owners of the MT engine would still need to request every single user of the Online Editor to disable this automatic application of MT. While disabling the setting might be a one-time requirement, the problem remains that we cannot guarantee that the linguist does not re-enable it on their own and our team would have no way to restrict that.\nI suggested that they make this feature toggle to be part of the project settings. That way, project creators or managers can decide to enable or disable such a feature right from the very start, rather than letting it propagate to users of all target languages. This level of control would be much more helpful.\nI can update this thread once I see any new updates.\n \nNew comments on\nAdd segment number to verification messages\n by \nRussell Banton\n on 30 Dec 2024 5:26 PM in \nTrados Enterprise & Accelerate Ideas\n When clicking through the verification messages, the OE doesn't always go to the correct segment. It would be helpful to have the segment number a message is for clearly listed in the verifi...\nRussell Banton on 26 Feb 2025 2:37 PM\nFollowing up on this as this is an idea to added segment number to the view. The bug is separate from this request.\n \nNew comments on\nKick user to login page with Trados Enterprise times out\n by \nRussell Banton\n on 24 Jun 2024 8:04 PM in \nTrados Enterprise & Accelerate Ideas\nCurrently, when your login times out, you are still able to perform some tasks, but depending on what you click, you may be kicked out to the login window. Our hope is that when your Trados Enterprise...\nTerence Tsang on 25 Feb 2025 10:59 PM\nI can also confirm this behaviour. I am able to do most things until I open the OE or refresh the page on the browser. Ideally, we can configure our own timeout period too because the default is very short.\n \nNew comments on\nMore easily show word count broken down by file\n by \nRussell Banton\n on 12 Apr 2024 12:58 PM in \nTrados Enterprise & Accelerate Ideas\nIn TE it is cumbersome and difficult to find the word count per file to compare with all other files in a project. In the UI it is not feasible to try to do this at all. WorldServer provided an easy v...\nRussell Banton on 24 Feb 2025 5:28 PM\nThis is still greatly needed as the user experience for projects with many tasks is not great for seeing this type of view online. Additionally, our vendors are also asking for the ability to see word count reporting in this format to better understand scope.\n \nNew comments on\nExpand QA checking for translation consistency to entire projects\n by \nRussell Banton\n on 9 Apr 2024 12:52 PM in \nTrados Enterprise & Accelerate Ideas\nSometimes large projects can lead to inconsistent translations between files. It would be good to be able to run a QA check for translation consistency over all files in a project. We'd like to ch...\nRussell Banton on 25 Feb 2025 1:21 PM\nPatrik Mazanek\n  - Can you please share details for how TE checks for consistency across projects and how the inconsistency errors are flagged when only one task can be opened at a time?\n \nNew comments on\nAllow copy and paste of tags in Online Editor from source to target segment\n by \nIris Düwel\n on 1 Feb 2024 10:24 AM in \nTrados Enterprise & Accelerate Ideas\nSo far, it is not possible to copy and paste text with tags from source to target segments in Online Editor as it is possible in Trados Studio. It would improve a translators work a lot if that featur...\nRussell Banton on 25 Feb 2025 1:23 PM\nI think this idea is not delivered. While there are some ways to have tags created in the target side of the Online Editor, it is still lacking a copy and paste action for the tagging. This also impacts when we have to validate a translation externally from TE. When we try to copy a segment that includes tags, the tags are lost upon copy and paste which makes us have to manually type them. This can be cumbersome for some segments that have a lot of tags.\nPatrik Mazanek on 25 Feb 2025 8:12 AM\nAnother way to copy tags from source is simply CTRL+click on the tag you want to copy.\n \nNew comments on\nAdd ability to filter and download reports from the vendor orders and quotes views\n by \nRussell Banton\n on 17 Nov 2023 9:27 PM in \nTrados Enterprise & Accelerate Ideas\nAdding the ability to filter by start date, customer, etc. and then download a report with the data will enable a vendor to easily get a report for their work they supported.\nRussell Banton on 25 Feb 2025 1:17 PM\nThank you for the update Ian! Will this report include details for who performed what task for a vendor?\nRussell Banton on 24 Feb 2025 5:25 PM\nAdditional needs are to know at the task level, what linguist did what for a vendor. Reporting needs are severely lacking for vendors right now and are greatly needed.\n \nNew comments on\nVendor needs ability to download report including volume and costs for a certain time period for eas...\n by \nRussell Banton\n on 9 Aug 2023 2:35 PM in \nTrados Enterprise & Accelerate Ideas\nOur vendor needs a easy way to gather volume and costs for projects they completed in a certain time period so they can invoice us correctly.\nRussell Banton on 24 Feb 2025 5:27 PM\nOur vendors would also like to be able to see details at the project level for which linguists completed which tasks in a project.\n \nSupport for Preview of XML2: OASIS DITA 1.3 Compliant-based XML and DITA Files using XSLT\nby \nJay Chen\n on 26 Feb 2025 6:40 AM in \nTrados Studio Ideas\nI am aware that some other XML-related file types support Stylesheet Transformation using XSLT, but not for the preview of XML2: OASIS DITA 1.3 Compliant-based XML and DITA Files in Trados Studio. I'm also aware that Trados TEAM offers support for preview of \nXML2: OASIS DITA 1.3 Compliant-based XML and DITA files using XSLT. \nI wonder if this support of using XSLT template for preview would be applicable to Trados Studio.  \n \nNew comments on\nOnly include target language-specific entries from a termbase when creating project packages\n by \nJulian Hamm\n on 18 Nov 2024 4:33 PM in \nTrados Studio Ideas\nFor some clients we work with large file-based termbases and a lot of target languages on a regular basis. When creating project packages, Trados Studio includes the entire termbase with all target la...\nAchim Herrmann on 24 Feb 2025 7:41 AM\n \nDaniel Brockmann\n  already mentioned that this is working in the cloud and I can remember the customer for which I logged the case. But I also agree with \nBernhard Hoell\n  who found out that the feature doesn't work as expected. I would also have expected a Studio package to contain only bilingual termbases. However, if the project contains more or all target languages, the feature no longer helps the user. We had also observed loading times of approx. 45 minutes and these are probably unavoidable with termbases with a large number of languages. This makes the work very time-consuming, especially if the package does not contain that many words for translation.\n \nNew comments on\nEmbedded Content Processing for JSON should line-breaks without segment break\n by \nFrank Lempp\n on 19 Jan 2024 8:15 AM in \nTrados Studio Ideas\nIf a JSON file contains inline tags to be protected, it should still be possible to create a single segment from a multi-line string resource, just the way it is possible without enabling Embedded Con...\nFrank Lempp on 24 Feb 2025 10:52 AM\nThere is obviously the work-around to replace \"\\n\" by \"\\\\n\" (or something similar) in the JSON file before importing it into Studio or Trados Cloud, but a corresponding enhancement directly in the filter is urgently needed!\n \nBe able to connect Multiterm to cloud termbase\nby \nThomas Alwood\n on 25 Feb 2025 3:26 PM in \nTrados Terminology Ideas\nRight now you can connect Studio to a cloud termbase but not Multiterm, although you can connect to server-based termbases in GroupShare. It would be usefult to connect to cloud termbases as well as Multiterm has feature useful for maintaining termbases (duplicate searchs, batch tasks etc). Also would be useful to allow Multiterm Extract to connect to cloud termbases. Not sure why Trados seems to lag in the area of statistical term extraction when other tools do it better.\n \nNew comments on\nMore sortable columns in Projects area\n by \nKester Newill\n on 31 May 2022 7:22 AM in \nTrados Team Ideas\nIn the Projects area, only Name, Due, Created, and Last Modified are sortable (A-Z; or Z-A). The sorting option in other columns is greyed out, and unavailable. I'd like to be able to sort pr...\nPeter Johnston on 26 Feb 2025 3:42 PM\nCome RWS/Trados, this surely can't be this hard to implement since the majority of columns have the sort feature there but ts disabled so why can't it be enable for every single column in every area???\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-03-02T09:44:30+00:00",
    "sent_at": "2025-03-02T09:44:05+00:00",
    "date_extracted": "2025-04-02T19:36:35.681502"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACJmdThgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAEnDVQMHI_BCoIv3sbfjn-I=",
    "from": "noreply@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@rws.com",
    "in_reply_to": "N/A",
    "subject": "New RWS Support Portal",
    "body": "New RWS Support Portal\nView in browser\n \n \nThe new Support Portal is LIVE!\n \nYou can now go to \nhttps://gateway.rws.com\n to get help with all of our technology products!\n \nIf you're using the old SDL URL, you'll be will be forwarded to the new site but you may want to update your bookmarks. As promised existing open cases have been migrated over so that work on those can continue without interruption.\n \nThe new system should feel very familiar to our users, but if you need any help there are some \nvideos available here\n to give you some guidance.\n \nThank you for your continued support!\nThe RWS Support Team\nYou are receiving this communication as it contains important information that could impact your usage of our products. Whilst these operational communications are necessary based on your status as a customer, if you \ndo not \nwish to receive these emails you can let us know by emailing \nengage@rws.com\n or by clicking this link \nhere\n.\n \nYou may receive separate marketing emails in future depending on your selections recorded in our \npreference center\n, which you can visit to change your preferences for marketing emails. \n \n \n \n \n \n \n \nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \n© 2024 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-03-02T00:02:03+00:00",
    "sent_at": "2025-03-02T00:01:52+00:00",
    "date_extracted": "2025-04-02T19:36:36.294559"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACI-5RFAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQANydVCAS8RJFhx6s_38segU=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "What if there was a smarter way to improve your translation workflow? ",
    "body": "Meet AI Assistant.\nView in browser\n \n \nContact us\nAre you ready to improve your translation workflows with AI Assistant?\nDear Translation Pioneer,\n \nWe’ve got a few questions for you:\n \n❓ Are you looking to \nboost \nyour translation productivity without compromising quality?\n \n❓ Do you want to leverage \ncutting-edge\n AI technology to streamline your workflow?\n \n❓ Are you ready to \nelevate \nyour translations with intelligent assistance?\nWe’ve got the perfect offer for you!\n \n🔥 \nUpgrade Today and Save 20% on Trados Studio 2024 Professional!\n \nOr take advantage of our \n3 for 2\n offer on multiple licenses—delivering unbeatable value for growing teams.\n \nTrados Studio 2024 AI Assistant is here to help\n \n✔️ \nEnhance Translation Workflows with AI Assistant\n Access generative translation capabilities directly within Trados Studio, improving translation output while handling multiple projects seamlessly.\n \n✔️ \nInteractive and Automatic Translation Modes\n Work with AI Assistant interactively in the editor for suggestions or use it as an automatic translation provider to pre-translate files.\n \n✔️ \nCustomizable Prompts and Linguistic Resource Integration\n Combine an LLM with your linguistic resources to adjust tone, apply terminology automatically, or shorten sentences with precision.\n \n✔️ \nEndless Possibilities with Custom Prompts\n The ability to tailor LLM responses using your own resources unlocks creative and precise translation outputs.\n \nReady to transform your translation process and save?\nUpgrade to Trados Studio 2024 today and experience the future of translation technology while taking advantage of our exclusive offers!\nContact us today to learn more\n \nFind out more \nabout the world's leading computer-assisted translation software. Pricing excludes local taxes. For more information on this offer, please \ncontact us\n.\n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-02-27T16:08:37+00:00",
    "sent_at": "2025-02-27T16:08:28+00:00",
    "date_extracted": "2025-04-02T19:36:36.424597"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACI-5REwAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQACa-AFmoWexDqbg1oERhfyw=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "Project Alliant was deleted",
    "body": "Project Alliant was \ndeleted!\n \nDear \nMaya Benoit\n, \nProject Alliant has been deleted. \nDETAILS\nAccount\n \nLanguage and Culture Worldwide, LLC\nCustomer\n \nCompliance Wave\nShort ID\n547\nName\n \nAlliant\nDescription\n \nSource Language\n \nen-US\nTarget Languages\n \nes-AR\nDue Date\n \n03/05/2025 14:00:00, UTC\n \n \nJoin our Community\n \nFind answers to your questions, or contribute your own on the RWS Community!\n \n \nNeed more help?\n \nGet in touch with the human side of RWS! \n \n \nAll contents copyright ©2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-02-26T13:51:10+00:00",
    "sent_at": "2025-02-26T13:51:01+00:00",
    "date_extracted": "2025-04-02T19:36:36.306325"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACI-5REgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQACe5y69SVHhNrHMzfjnlEz8=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "New Translation tasks from project Alliant are assigned to you",
    "body": "A new \nTranslation task\n is assigned to you! \nDear \nMaya Benoit \n, \nA new \ntask\n was assigned to you.\nMultiple people may be assigned to the same task. Before you start work, you must accept the task. \nDETAILS \nAccount\n \nLanguage and Culture Worldwide, LLC\nCustomer\n \nCompliance Wave\nProject Short ID\n \n547\nProject Name\n \nAlliant\nDescription\n \nTask Description\n \nNovolex_2025 HMO Guide_v4.1_20250207.idml\nTask Name\n \nTranslation\nSource Language\n \nen-US\nTarget Languages\n \nes-AR\nTask Due Date\n \n03/05/2025 14:00:00, UTC\n \nWord Count\n \n19102\n \nClick \nhere\n to view this task in your inbox. \n \nJoin our Community \nFind answers to your questions, or contribute your own on the RWS Community! \n \nNeed more help? \nGet in touch with the human side of RWS! \n \n \nAll contents copyright © 2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-02-26T13:13:50+00:00",
    "sent_at": "2025-02-26T13:13:39+00:00",
    "date_extracted": "2025-04-02T19:36:37.113094"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACI-5REQAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQACOWmNoQjoNOoCgI0lCG7bc=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "A new project called Alliant was created in Trados",
    "body": "Alliant\n has been created\nDear \nMaya Benoit \n, \nA new project has been created for an account you manage. \nDETAILS \nAccount\nLanguage and Culture Worldwide, LLC\nCustomer\nCompliance Wave\nShort ID\n547\nName\nAlliant\nDescription\nSource Language\nen-US \nTarget Languages\nes-AR \nDue Date\n03/05/2025 14:00:00, UTC\n \n \nClick \nhere\n to view more details about this project. \nJoin our Community\nFind answers to your questions, or contribute your own on the RWS Community!\nNeed more help?\nGet in touch with the human side of RWS! \n \n \nAll contents copyright © 2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-02-26T13:03:03+00:00",
    "sent_at": "2025-02-26T13:02:53+00:00",
    "date_extracted": "2025-04-02T19:36:36.950057"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACIv3OZgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAAPJjY4GtF1PnDCY1DkiuIE=",
    "from": "marleen@creolesolutions.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "marleen@creolesolutions.com",
    "in_reply_to": "N/A",
    "subject": "📚 Celebrating a Decade of Creole Solutions and Learning!",
    "body": "Celebrating 10 Years of Learning\nwith us!\nBonjou Maya!\n \nAs we continue celebrating Creole Solutions’ 10-year journey, this month’s spotlight is on \nLearning\n, \none of the most powerful ways we’ve seen Haitian Creole break barriers and open doors.\n \nFor too long, higher education and professional research in Haiti were associated almost exclusively with French, leaving Haitian Creole on the sidelines. But that’s changing, and Creole Solutions has played an active role in this shift.\nIn 2022, The United Nations launched its new website for Haiti in Haitian Creole.\nWhat is possible? \nLearning!\nHistorically, higher learning in Haiti has been associated with French, as Haitian Creole was considered a spoken language. That perspective has undergone quite a few changes in the last decade, and \nCreole Solutions\n is proud to have played a role in this shift.\n \n \nWhat learning is and how it is accessed have evolved\n, with Haitian Creole gaining greater recognition. When the New York Times published an article on Haitian history in both English and Haitian Creole on May 23, 2022, it caused a sensation.\nLater in the same year, the \nUnited Nations\n launched its brand-new website for Haiti \nin beautifully crafted Haitian Creole. Marleen and her team have always felt strongly that Haitian Creole can only be elevated by prioritizing proper grammar and spelling. \nThese days, it is not uncommon for research institutes and museums to request translations from us. \n \nWe were honored to collaborate with the Museum of Contemporary Art to include Haitian Creole translations in \nDidier William: Nou Kite Tout Sa Dèyè\n.\n This powerful book, published alongside William’s largest solo museum exhibition, delves into race, immigration, and memory through his monumental paintings, printmaking, and sculpture.\n \nThe title, which translates to \nWe’ve Left That All Behind\n, reflects the Haitian immigrant experience—the journey of displacement, adaptation, and resilience. By incorporating Haitian Creole, we ensure that these narratives reach those who connect most deeply with them, reinforcing the idea that language should never be a barrier to understanding.\nIn Haitian culture, we say\n \nKreyòl pale, kreyòl konprann\n—\nwhen Creole is spoken, it is understood. When people have the opportunity to learn and engage in their own language, knowledge becomes more accessible, voices are amplified, and communities thrive.\n \nCelebrate with Us!\n \nFrom academic research to museum exhibitions, our language is breaking barriers and creating new opportunities. Every translation, publication, and collaboration brings us closer to a future where\n Creole is not just spoken but recognized, studied, and celebrated.\n \nWhat’s Next?\nEach month, we’ll share another story of what’s possible with Haitian Creole, celebrating the growth, creativity, and cultural pride that Creole Solutions has brought to life over the past decade.\n \nJoin us in championing Haitian Creole as a language of learning, knowledge, and innovation. Share your thoughts, stories, and experiences with us—because when \nKreyòl pale, kreyòl konprann\n, anything is possible!\nLearn more about us\n \nStay in the loop!\nFor more updates and exciting news, make sure to follow our page and stay connected with us on social media. \n \n \n \n \nCreole Solutions, 4957 Oakton Street, Suite 203, Skokie, IL 60076, United States \nManage preferences",
    "received_at": "2025-02-24T23:06:26+00:00",
    "sent_at": "2025-02-24T23:06:15+00:00",
    "date_extracted": "2025-04-02T19:36:37.106496"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACIv3OZQAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQACiwJrFb-f1OqoDinQgunMc=",
    "from": "noreply@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@rws.com",
    "in_reply_to": "N/A",
    "subject": "New RWS Support Portal",
    "body": "New RWS Support Portal\nView in browser\n \n \nNew RWS Support Portal\n \nDear Customer,\n \nWe are delighted to announce that the new Customer Support Portal will be launching on \nMonday, March 3rd\n!\n \nThe address for the portal will be the same, and any cases that are open on the current portal at that time will be seamlessly migrated to the new one over the preceding weekend.\n \nThank you for your continued support!\n \nThe RWS Support Team\nYou are receiving this communication as it contains important information that could impact your usage of our products. Whilst these operational communications are necessary based on your status as a customer, if you \ndo not \nwish to receive these emails you can let us know by emailing \nengage@rws.com\n or by clicking this link \nhere\n.\n \nYou may receive separate marketing emails in future depending on your selections recorded in our \npreference center\n, which you can visit to change your preferences for marketing emails. \n \n \n \n \n \n \n \nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \n© 2024 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-02-24T16:03:17+00:00",
    "sent_at": "2025-02-24T16:03:01+00:00",
    "date_extracted": "2025-04-02T19:36:37.643121"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACIJkC3AAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQABWKrEsd9eNPjI9vQPCQkn8=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio Weekly Digest - 23 Feb 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 23 Feb 2025\nTrados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio\n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nNew Questions\nWorking with WorldServer packages in Trados Team\nTranslation Engine Search Logic\nIs there a webhooks delivery log available in Trados Team?\nAI feature to optimize MT engine selection\nDelete a wrong project in Trados Cloud\nNew Replies\nHow to generate and download an analysis report in Teams using the API?\n \n1. General\nNew Questions\nI want to create new role for my students to translate, but I dont have the section ROLES&PERMISSION so that I can create the new role for my students\nNew Replies\nAuto LQA\n \n \nWorking with WorldServer packages in Trados Team\nby \nJean-François Pelletier\n on 21 Feb 2025 12:57 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello all,\nI would like to know if there are general guidelines or tips about working with WS packages in Team, or experience to share.\nI can extract the .sdlxliff documents from the .wsxz packages, just wondering about the flow and delivery once the projects are triggered using the .sdlxliff documents.\nThanks in advance!\nJF\n \nTranslation Engine Search Logic\nby \nCaroline Hétu\n on 20 Feb 2025 4:49 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello!\nI have a question regarding translation engine search logic.\nIf we have a translation engine containing several translation memories. how does Trados process when bringing back translation segments from these memories?\nIf the translation memories appear as follows in the translation engine:\nMemory AA\nMemory BB\nMemory CC\nDoes Trados brings back segments according to the order the translation memories (i.e., looking in Memory AA first, then Memory BB and Memory CC), or does it bring back segments according to the match percentages or the date of the segments?\n \nIs there a webhooks delivery log available in Trados Team?\nby \nJean-François Pelletier\n on 19 Feb 2025 7:53 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello,\nI stopped receiving webhooks from my instance of Team almost 24 hours ago, and I wanted to know if there is a delivery log somewhere in Team where I can check the status?\nThanks all in advance!\nJF\n \nAI feature to optimize MT engine selection\nby \nLucas Graf\n on 18 Feb 2025 12:39 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nDoes Trados/RWS have an automated or AI driven tool to optimize MT engine selection? This may be done by analyzing content domain and language pairs versus available MT tools. For example, the best MT engine for English-French in the medical domain may be different than English-Arabic in advertising.\n \nDelete a wrong project in Trados Cloud\nby \nAdalgisa Mendes Hammerschmid\n on 18 Feb 2025 11:09 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello\ni have a licence for Trados Studio 2024. I started a project in the wrong way in cloud.\nI want to delete the project and start again in Studio.\nAfter searching and getting instructions of the copilot, unfornunately noone of the solutions worked.\nAfter choosing the files to be deleted is it not possible to select the botton \"delete\" = \"löschen\" in german.\nCould you please help me to detele this project.\nThank you!\nElisa Maxim on 20 Feb 2025 9:30 AM\nHi \nAdalgisa Mendes Hammerschmid\n \nPlease go to Projects, select the respective project, then click Delete. See also \nhttps://docs.rws.com/en-US/trados-studio-cloud-capabilities-812699/deleting-projects-755466\nKind regards,\n \nNew replies to\nHow to generate and download an analysis report in Teams using the API?\n by \nJean-François Pelletier\n on 12 Feb 2025 9:35 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello all, I'm new to Team and I'm trying to generate and download the analysis reports by language and file for a project using the API. I can't seem to see any endpoint for that, all tha...\nJean-François Pelletier on 17 Feb 2025 2:24 PM\nHello \nDaniel Brockmann\n ,\nThanks a lot, this is the answer to my question! :-)\nI'm new to this API and how it works, and I didn't see the \nlanguageDirections.analysisStatistics\n option. I just tried it now and it's returning exactly what I was looking for... :-)\nBy the way, the API is well done and well documented, it's just a bit overwhelming to find my way around after just a few days...\nKind regards,\nJF\nDaniel Brockmann on 17 Feb 2025 9:04 AM\nHi,\nWe had this question a number of times, and here's the answer we gave in this context before:\n“The public API can be used to access analysis statistics using the Get Project endpoint, section analysisStatistics \nhttps://languagecloud.sdl.com/lc/api-docs/fd9ee0beb37ca-get-project\n . The model/information exposed under Get Project is described at \nhttps://languagecloud.sdl.com/lc/api-docs/4d1cce730f2af-analysis-statistics\n. Locked segments information is not yet exposed, we have a feature request for this down the road.\nIn addition to this, when executing the call, you could request via query parameter \nfields=analysisStatistics,languageDirections.analysisStatistics\n, either if you want the whole project statistics, or language direction level statistics. On the response then with minimal parsing/navigating logic, the data should be available.”\nWould the second paragraph help with your second question in terms of language level?\nThanks, Daniel\n \nI want to create new role for my students to translate, but I dont have the section ROLES&PERMIS...\nby \nAlbino Chavale\n on 16 Feb 2025 2:47 PM in \n1. General\nI’m setting a new group of students that will be using RWS to translate. I’ve managed to create customer and as it is explained in the video teaching with RWS I have to create a new role so that my student will be able to translate and for that I have to click on ROLES & PERMISSION. The problem is that from my computer I don’t have this window. How can I do:?\n \nNew replies to\nAuto LQA\n by \nJesse Good\n on 31 Jan 2025 1:05 AM in \n1. General\nDoes RWS offer any solution like the following?\nphrase.com/.../\nJesse Good on 21 Feb 2025 2:39 AM\nDaniel Brockmann\n \nThanks. Would be great to use without having a \nTrados Team, Accelerate or Enterprise project...\nDaniel Brockmann on 17 Feb 2025 10:17 AM\nHi Jesse, yes, Smart Review - \nhttps://www.trados.com/product/studio/FAQ/what-is-Trados-Copilot-Smart-Review/\n. This is currently interactive but will soon also work in batch, plus we are also looking at linking it more formally to the TQA models a user might have in place. Thanks, Daniel\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-02-23T09:20:26+00:00",
    "sent_at": "2025-02-23T09:19:53+00:00",
    "date_extracted": "2025-04-02T19:36:37.983134"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACIJkC2wAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAKE8pN1gtYNDr7kebgtYGdI=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Portfolio Ideas Weekly Digest - 23 Feb 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 23 Feb 2025\nTrados Portfolio Ideas\nTrados Enterprise & Accelerate Ideas\nNew Posts\nEdit Name/Description of File Type Configurations\nAbility to 'Move to project group' in bulk \nVendor Project Visibility - allow project overview\nDisplay an updated timestamp for files in Projects view/Files\nAdd ability to display and/or sort member user names by family name\nTQA: Adding a different TQA model per language\nNew Comments\nAdd an upcoming tasks tab in the inbox\n \nTrados Studio Ideas\nNew Posts\nhaving the projects appear with ICONS instead of that same icon for all\nCounting function for the number of filtered results in a translation memory\nCounting function for the number of filtered results in a translation memory\nFont size for comments\nNew Comments\nRefine the measurement checks\n \nTrados Terminology Ideas\nNew Posts\nDisplay entry identifier\n \nTrados Team Ideas\nNew Comments\nMake automated email notifications customizable\n \nTrados GroupShare Ideas\nNew Comments\nGroupshare: User right \"View TM\"\n \n \nEdit Name/Description of File Type Configurations\nby \nLuciana Scocco\n on 21 Feb 2025 10:24 AM in \nTrados Enterprise & Accelerate Ideas\nIn the File Type Configurations tab, I am unable to edit the name and/or description of a file type configuration.\nThe 'Edit' button is there, but it really just opens the configuration for me to add or remove file types. \nPlease enable this feature. Thanks!\nPatrik Mazanek on 21 Feb 2025 10:58 AM\nInside the configuration, go to \"General\" tab.\n \nAbility to 'Move to project group' in bulk \nby \nLuciana Scocco\n on 20 Feb 2025 10:09 AM in \nTrados Enterprise & Accelerate Ideas\nI had to assign a set of projects (around 20) to a different Project Group. See SS below.\nI had to do this one by one. If I select all the projects, the 'Move to project group' button is disabled. The task was repetitive and time-consuming.\nPlease enable the ability to 'Move to project group' in bulk.\nThank you. \n \n \nVendor Project Visibility - allow project overview\nby \nBernhard Hoell\n on 20 Feb 2025 7:17 AM in \nTrados Enterprise & Accelerate Ideas\nOne of our vendors complained about the fact that if one of the users of the vendor project managers group has accepted\n, the other PMs are not able to view the project in their Active tab.\nThis means that Vendor PJM 1 does not see if Vendor PJM 2 already claimed a task that the vendor expects or if the task is not there to retrieve yet.\nPlease enhance this functionality to allow the vendors to see all their projects, regardless which PJM accepted the task.\nRussell Banton on 20 Feb 2025 1:13 PM\nI have a similar idea posted recently as well. Our vendors really wish they could see more about what is going on.\n \nEnable vendors to be able to see what other PMs did\n \n \nDisplay an updated timestamp for files in Projects view/Files\nby \nCAMELIA GHEORGHIES\n on 19 Feb 2025 4:11 PM in \nTrados Enterprise & Accelerate Ideas\nTime stamps in the Files tab in a project in Projects view seem to refer to the task creation rather than the last file update (completion), and this can be misleading. Because the file is actually constantly updated on the cloud, so it would be also logical that the time stamp is also continuously updated. In addition, once a task is completed, users would expect to see the timestamp of the task completion rather than the task creation timestamp. Otherwise, when people are looking for their files, they might have doubts about whether the system recorded the right file.\nWould you please consider displaying an updated timestamp? Or at least update the task creation timestamp with the task completion timestamp, once it has been completed?\n \nAdd ability to display and/or sort member user names by family name\nby \nKester Newill\n on 19 Feb 2025 9:57 AM in \nTrados Enterprise & Accelerate Ideas\nCurrently, the list of member users can only be displayed in first name - family name configuration; and only sorted A-Z (ascending or descending) according to the first name.\nPlease add the ability to display in family name - first name configuration; and the ability to sort names A-Z by family name.\n \nTQA: Adding a different TQA model per language\nby \nCarla Galvao\n on 18 Feb 2025 10:48 AM in \nTrados Enterprise & Accelerate Ideas\nIn TE, we can define different TQA models per language. It would be handy if you could implement a way for us, admin users, to add a different TQA model per language. At the moment, that feature is available only for the QA Checker.\nPatrik Mazanek on 19 Feb 2025 6:04 AM\nTQA model can be only selected per project. I don't think ability to use more than one is practical and I don't really see why would you do that.\n \nNew comments on\nAdd an upcoming tasks tab in the inbox\n by \nKarine Lavoie\n on 19 Oct 2023 3:32 PM in \nTrados Enterprise & Accelerate Ideas\nI suggest to add an upcoming tasks tab next to New, Active, Completed. It would be a game changer from a planning perspective. For example, reviewers could actually see what's coming their way an...\nStephanie Lebrun on 19 Feb 2025 5:54 PM\nOur team would really need that. Not only for project managers but also for highly collaborative teams. Hope it will get approved and soon made available.\n \nhaving the projects appear with ICONS instead of that same icon for all\nby \nSameh Elsharkawy\n on 20 Feb 2025 5:50 PM in \nTrados Studio Ideas\nHi,\nIt would be great to customize the project window with an icon for each project, like for example, an icon for the UN projects, another for the Worldbank, another having the logo of my client or company, etc! That would visibly make it a lot easier and much fun to spot projects immediately, especially if you are dealing with so many clients. This should be easy, I believe. I would assure you, this is not a luxury feature, but would make the Trados interface more fun to work with. \nSee the above image to give you an idea about my suggestion.\nSameh Ragab\n \nCounting function for the number of filtered results in a translation memory\nby \nDonatella Pulitano\n on 17 Feb 2025 12:27 PM in \nTrados Studio Ideas\nTo check the consistency of our many translation memories, we would like to know the number of TUs matching a particular filter when searching in the TM.\n \nCounting function for the number of filtered results in a translation memory\nby \nDonatella Pulitano\n on 17 Feb 2025 12:27 PM in \nTrados Studio Ideas\nTo check the consistency of our many translation memories, we would like to know the number of TUs matching a particular filter when searching in the TM.\n \nFont size for comments\nby \nJose Ignacio Cepero Briz\n on 16 Feb 2025 7:45 AM in \nTrados Studio Ideas\nSome of us have trouble to see very small font sizes, like comments. There should be a way to make it bigger.\nGenerally speaking, anything that could be done to make Trados visually comfortable would be nice.\nPlease note I use Trados 2021 and I have no intention of upgrading. I already did and had to roll back because of issues in the interaction between Trados and Multiterm. I would love a solution for comments that could be applied to all Trados versions.\nPhilippe Riondel on 18 Feb 2025 12:34 PM\nI already suggested that idea 2-3 years ago (\n(+) Comment box font size - Trados Studio Ideas - Trados Portfolio Ideas - RWS Community\n). \nThis really a must for people whose vision is not 20/20. Yet, nobody at RWS seems to be interested in improving that point.\nIt's a non-sense, since Studio developers understand it is necessary for many users to enlarge the fonts in the editor, but they don't il is also necessary in the comment box. How would people who specified a minimum font size of 14 in the editor suddenly be able to decipher mice print in the comment box?\nPaul on 17 Feb 2025 9:01 AM\nJerzy Czopik\n \nJose Ignacio Cepero Briz\n \nWhy don't you try using the online editor?  This is available to every Studio user, it has an accessibility mode, and you can also control the size of the things you look at far easier:\nor bigger... just by scrolling:\nOlivier on 17 Feb 2025 6:48 AM\nHi. I completely agree with you. For example, the left panel in Multiterm has a tiny font size, almost impossible to read. I have good eyesight, so it's OK for me, but accessibility should be a priority in any software.\nJerzy Czopik on 16 Feb 2025 8:17 AM\nIf you have problems with MultiTerm, upgrade to 2024. This version has a much more stable term recognition. As for your font suggestion, I think there have been already some proposals in similar direction. Having the possibility to adapt font sizes in auto suggest or comments and other parts of Studio is indeed a very desirable idea.\n \nNew comments on\nRefine the measurement checks\n by \nDiana Palenzuela\n on 12 Feb 2025 1:16 PM in \nTrados Studio Ideas\nHi, Trados Community! It would be of great help if the measurement checks (Verification > QA checker 3.0 > Numbers > Check measurements and currencies) was refined. Errors in units of me...\nJesús Prieto on 18 Feb 2025 8:47 AM\nBarbara Brawn\n \nI’ve voted up, but while improvements are implemented, you may want to go ahead and add customised regex rules.\nFor example you can add the rule to check that if \ncm\n is in Source and not in target, it must be reported. The regex would be \n\\bcm\\b\n.\nOr you can combine as many symbols as you wish \n\\b(mm|cm|ml|L|l|g|mmHg)\\b\n or even full words (for example, if \nhour\n is in Source, there must be \nhora\n in the Spanish target; similar for seconds, minutes, days, weeks, months, years). \nYou can add rules for checking numbers too.\nAbout the issue with \nL\n and \nl\n symbols, I’m not sure about that, but I think that the measurement \nL\n expects \nL\n in target, while \nl\n symbol expects \nl\n. Again you can add a regex rule that if \\\nb[Ll]\\b\n is matched in Source, \n\\bl\\b\n must be matched in Target (case sensitive).\nI have it in that way, literally hundred of regex rules per target language, and some checks in Verifier turned off. It’s true that I get some unavoidable false positives, but really very few. A couple of manageable false positives is a minor collateral damage while assuring that days are not translated as years, for example.\nI hope it helps. More information in the following link: \nhttps://lalinternadeltraductor.org/n19/rule-based-qa.html\n \nDisplay entry identifier\nby \nFrauke Hellerich\n on 19 Feb 2025 11:05 AM in \nTrados Terminology Ideas\nJust like in MultiTerm, I want to be able to identify amiguous and synonymous termbase entries, For that, the entry identifer needs to be displayed (red circle in attached files) in a similar way than the language identifer is displayed (green circle in attached files).\n \nNew comments on\nMake automated email notifications customizable\n by \nVeronika Fagerer\n on 7 Sep 2021 3:00 PM in \nTrados Team Ideas\nIt would be great if PMs or Admins would be able to customize automated notifications. Which content elements are included, when/how often reminders are sent, linking additional resources, etc. would ...\nAnand Mohan on 19 Feb 2025 2:43 AM\nUser should also be able to customize what alerts they receive. Currently our team members are being bombarded with emails about other people taking tasks, due dates approaching, etc. and as a result, important emails (such as being assigned tasks) are being lost in the soup. Members can manage their own calendars, so they don't need to receive reminders. Ideally, these mails should also have customizable subject lines, since mail after mail titled \"Trados Team\" makes them hard to distinguish at a glance. \n \nNew comments on\nGroupshare: User right \"View TM\"\n by \nJohannes Purer\n on 10 Jan 2025 9:08 AM in \nTrados GroupShare Ideas\nHi, when giving a user the right to view a Groupshare TM, the user cannot only view the TM, but also use this TM in a project created by the user him/herself. I would like to restrict this right or re...\nEbony Bradshaw on 22 Feb 2025 5:30 PM\nCan someone contact me as soon as possible I have questions before getting started\nthanks\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-02-23T09:20:25+00:00",
    "sent_at": "2025-02-23T09:19:59+00:00",
    "date_extracted": "2025-04-02T19:36:37.838258"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACHb_dyAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAF93g6pJRe1PpDElx8W-Ur0=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "[Survey] Your last chance to take our Translation Technology Insights 2025 survey",
    "body": "Join thousands of translators who have already had their say!\nView in browser\n \n \nContact us\nInfluence the future of translation technology\nPlus your chance to win an Ember Travel Mug 2!\n \nTake survey\n \nWe want to hear from you \n- \nthe driving force of the translation industry. Thousands of translators have already had their say - this is your chance to share your insights on:\nThe work challenges you face every day\nYour thoughts on the rise of AI and how it’s reshaping the industry\nHow you work today - and how you envision that evolving tomorrow\nThe tools and technologies you need to do your job better.\nThe survey takes around 15 minutes to complete, and your answers are strictly confidential. \nYou can also win an Ember Travel Mug 2\n! \n \nThank you for taking part in this important industry research.\nTake survey\n \n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-02-18T12:28:56+00:00",
    "sent_at": "2025-02-18T12:28:45+00:00",
    "date_extracted": "2025-04-02T19:36:38.370086"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACHb_dxwAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAAe8-0BLPYBDr0_679b7hXM=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio Weekly Digest - 16 Feb 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 16 Feb 2025\nTrados Enterprise, Accelerate, Team and cloud capabilities in Trados Studio\nProduct Updates\nNew Comments\nSmart Insights Beta Program\n \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nNew Questions\nFile project on Trados Team\nHow to generate and download an analysis report in Teams using the API?\nHighlighting Read-Only access in Trados Enterprise TM Maintenance\nAllow multiple source languages per project\nUnable to create a new workflow template in Cloud\nHow to give permission to a freelancer\nNew Replies\nText cursor jumping?\n \n \nNew comments on\nSmart Insights Beta Program\n by \nIan Parnell\n on 5 Feb 2025 4:58 PM in \nProduct Updates\nWe are introducing a new Co-pilot capability in Trados - Smart Insights - designed to enhance user experience with intelligent data insights. Smart Insights allows you to take control of you...\nBernhard Hoell on 12 Feb 2025 1:36 PM\nIan Parnell\n - FYI: the form refuses to load in Firefox but worked OK in chrome.\n \nFile project on Trados Team\nby \nMario Kapinova\n on 13 Feb 2025 7:46 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello!\nI work at the university where I started working with The Trados Team. \nCan you help me understand if many students can translate the same file into a project without each other's results being completed? \nRWS Community AI on 13 Feb 2025 7:46 PM\n\"Probability score\": 0.8\n\"Question improvement suggestion\": Please provide more details about the version of Trados Team you are using and the operating system. Also, it would be helpful to know if you have tried any troubleshooting steps.\nIn the meantime, based on the information you have provided, here is a suggested answer to your question:\nHello,\nYes, multiple students can work on the same file in a Trados Team project without overwriting each other's work. This is possible through the use of the \"Check Out\" and \"Check In\" features in Trados Team. Here's how it works:\nStep 1: A student (Translator A) checks out the file they want to work on. This locks the file, preventing others from editing it.\nStep 2: Translator A works on the file and then checks it back in when they're done. This updates the file in the project and unlocks it.\nStep 3: Another student (Translator B) can now check out the file and see the changes made by Translator A. They can then make their own edits without overwriting Translator A's work.\nStep 4: Translator B checks the file back in when they're done, updating the project file with their changes.\nThis process can be repeated with as many translators as needed. Each translator's work is preserved and visible to others when they check out the file.\nRemember to always check in the file after you're done working on it to ensure your changes are saved and visible to others.\nI hope this answer addressed your question. If not, please reject the answer, add the question improvement suggestion information, and click the RWS Community AI checkbox on the right to try again.\nRWS Community AI\n \nHow to generate and download an analysis report in Teams using the API?\nby \nJean-François Pelletier\n on 12 Feb 2025 9:35 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello all,\nI'm new to Team and I'm trying to generate and download the analysis reports by language and file for a project using the API. I can't seem to see any endpoint for that, all that I can get is the global analysis report at the project level, and it's quite useless because it gives a consolidated value for the whole project, all files and languages together. There's no detail at all at the file or even language level.\nThanks in advance for any help!\nJF\n \nHighlighting Read-Only access in Trados Enterprise TM Maintenance\nby \nBernhard Hoell\n on 12 Feb 2025 1:45 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nWhy doesn´t Trados Enterprise show read-only access in a more intutitive way?\nCurrently when someone has access to a TM that is visible to them but not available with editing permissions (PJM permissions), it is possible to go into the TM maintenance mode.\nThe maintenance mode will not show clearly that you do not have editing permissions, even more confusing is that you get little popups that showcase the capabities of the maintenance window, however ignore that you may not have all the permissions required:\nThe only visual hint that you cannot edit here is that you cannot write in segments and the confirm changes button (among others) is greyed out.\nSome other visual marker should indicate that you are not allowed to change the content.\nThis is confusing to project managers.\nIs this something that is on the roadmap for getting enhanced?\nRWS Community AI on 12 Feb 2025 1:45 PM\n\"Probability score\": 0.6\n\"Question improvement suggestion\": Please provide the version of Trados Enterprise you are using and any error messages you may have encountered. Also, it would be helpful if you could describe any troubleshooting steps you have already taken.\nIn the meantime, based on the information you have provided, here is a suggested answer to your question:\nHello,\nI understand your concern about the lack of clear visual indicators for read-only access in Trados Enterprise TM Maintenance. This can indeed be confusing for project managers who are trying to manage and maintain their translation memories.\nAs of now, the only visual indicators for read-only access are the inability to write in segments and the greyed out 'Confirm Changes' button. I agree that more intuitive visual markers would be beneficial.\nHowever, I'm unable to confirm whether enhancements to this feature are on the roadmap. The development team at Trados is always working to improve the user experience, and feedback like yours is invaluable in guiding these improvements. I recommend keeping your software up to date to benefit from the latest features and improvements.\nIn the meantime, you can use the current visual indicators (inability to write in segments and the greyed out 'Confirm Changes' button) to identify when you have read-only access.\nI hope this answer addressed your question. If not, please reject the answer, add the question improvement suggestion information, and click the RWS Community AI checkbox on the right to try again.\nRWS Community AI\n \nAllow multiple source languages per project\nby \nLucas Graf\n on 11 Feb 2025 9:21 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nTrados does not allow multiple source languages per project so for any project that has bidirectional translations, such as English<->Spanish, multiple projects need to be created and then grouped. For every language pair you add the number of parallel Trados projects that needs to be created increases. Trados Support has confirmed this. My LSP normally work bidirectionally so managing multiple parallel projects, syncing information, compiling data, etc. is a drain on staff time.\n \nUnable to create a new workflow template in Cloud\nby \nMaciej Kur\n on 11 Feb 2025 7:17 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nHello,\nI am unable to create a new workflow template in Cloud - there's no New Workflow Template button in the UI and there's no sample workflow template on the list. This makes it impossible for me to create a project in Cloud, as that requires to specify a workflow, and I cannot create a workflow without specifying a workflow template. What should I do? Screenshot:\nAny help will be greatly appreciated :).\nMaciej\n \nHow to give permission to a freelancer\nby \nXavier Coutant\n on 10 Feb 2025 1:56 PM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nI use Trados Team.\nI would like to assign a translation to a freelance translator who uses Trados Studio.\nI created the translator in Trados Team. I sent her an invitation, that she accepted. However, she can not open the Trados file due to the following error message : \"You do not have sufficient permissions to access this account\".\nWhat am I doing wrong ? I suppose I have to give the translator permission to access the file but I don't know how to do it. Anyobe who can help me?\nXavier Coutant on 10 Feb 2025 2:04 PM\nI don't want the freelance translator to use my account. I want the freelancer to use her own Traos Studio account. Trados Team would only be used to send her the file she has to translate. The xliff file I would send her, would show her what has already been translated on the basis of our translation memory.\nRWS Community AI on 10 Feb 2025 1:57 PM\n\"Probability score\": 0.9\n\"Question improvement suggestion\": Please provide the exact version of Trados Team and Trados Studio you and your freelancer are using. Also, it would be helpful to know if there have been any recent changes to your system or software.\nIn the meantime, based on the information you have provided, here is a suggested answer to your question:\nHello,\nIt seems like you've done most of the steps correctly. However, the error message your freelancer is receiving indicates that she might not have the necessary permissions to access the project. Here's how you can grant her the necessary permissions:\nStep 1: Log in to your Trados Team account.\nStep 2: Navigate to the 'Users' section.\nStep 3: Find the freelancer's account and click on it.\nStep 4: In the 'Permissions' section, ensure that the freelancer has the 'Project Manager' role. This role allows the user to access and manage all projects.\nStep 5: Save the changes.\nAfter these steps, your freelancer should be able to access the project without any issues. If the problem persists, it might be due to the number of concurrent users exceeding the number of available licenses. In this case, you might need to purchase additional licenses.\nI hope this answer addressed your question. If not, please reject the answer, add the question improvement suggestion information, and click the RWS Community AI checkbox on the right to try again.\nRWS Community AI\n \nNew replies to\nText cursor jumping?\n by \nGuto Dafydd\n on 22 Apr 2024 8:46 AM in \n2. Trados Enterprise, Accelerate, Team & cloud capabilities in Studio\nGood morning, some internal users have found that the text cursor (ie the blinking line rather than the I-pointer) will move unexpectedly while they type (mostly while they edit target segments that a...\nGuto Dafydd on 14 Feb 2025 11:30 AM\nHi Elisabeth, one possible solution is to clear the browser cache. We're currently seeing problems such as this more often \nElisabeth Clech on 10 Feb 2025 9:08 PM\nThis won't help but I'm having a similar problem; I did put my issue here but got no reply. However, it works in Trados Studio (the offline one on the desktop). I'd be interested in a solution.\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-02-16T09:03:02+00:00",
    "sent_at": "2025-02-16T09:02:42+00:00",
    "date_extracted": "2025-04-02T19:36:38.502348"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACHb_dxgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAOhRQCRFEINPq19_hlZvzHk=",
    "from": "noreply@community.rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@community.rws.com",
    "in_reply_to": "N/A",
    "subject": "Trados Portfolio Ideas Weekly Digest - 16 Feb 2025",
    "body": "Update from RWS Community\nYOUR Weekly DIGEST FOR 16 Feb 2025\nTrados Portfolio Ideas\nTrados Enterprise & Accelerate Ideas\nNew Posts\nOnline Editor: add the same \"Accept all Changes in Document\" button as the one of Studio in the TQA view\nWorkflow step that allows XSLT transformations on native source and native target file format\nNew Comments\nPseudo-translation Provider for RWS Language Cloud - make it produce usable pseudo translation\n \nTrados Team Ideas\nNew Posts\nDisplay project due date for individual tasks\n \nTrados Studio Ideas\nNew Posts\nUse Trados Studio to mark sources against reference materials\nRefine the measurement checks\n \n \nOnline Editor: add the same \"Accept all Changes in Document\" button as the one of Studio i...\nby \nCarla Galvao\n on 13 Feb 2025 3:04 PM in \nTrados Enterprise & Accelerate Ideas\nIn Online Editor, the user needs to click on each target segment or QA message (of the QA panel) to be able to either accept or reject the change which is quite time consuming. In Studio, there is a button called \"Accept all Changes in Document\" which enables the user to accept all the changes at once. Could you please add the same button on the OE interface?\n \nWorkflow step that allows XSLT transformations on native source and native target file format\nby \nFrank Lempp\n on 11 Feb 2025 2:52 PM in \nTrados Enterprise & Accelerate Ideas\nIt would be ideal if Trados Cloud supported a configurable workflow step that allows XSLT transformations to run on native source and native target file format, to allow more complex modifications of XML file formats that contain either a localization-unfriendly XML structure or a Studio-unfriendly XML structure.\n \nNew comments on\nPseudo-translation Provider for RWS Language Cloud - make it produce usable pseudo translation\n by \nRussell Banton\n on 5 Feb 2025 9:53 PM in \nTrados Enterprise & Accelerate Ideas\nTypically, pseudo translation performs character substitution so the text is still readable by and English reader. This app produces nonsense translations that cannot be used by a developer to test an...\nRussell Banton on 11 Feb 2025 3:20 PM\nExample of ICU repo that has expected pseudo output style: \ngithub.com/.../pseudo-translate-icu\n \nDisplay project due date for individual tasks\nby \nNoelle L\n on 13 Feb 2025 8:21 AM in \nTrados Team Ideas\nIt would be helpful to be able to see the project due date for individual tasks. The column is there but it's empty by default:\n \nUse Trados Studio to mark sources against reference materials\nby \nDiana Palenzuela\n on 12 Feb 2025 1:25 PM in \nTrados Studio Ideas\nHi, Community!\nWe are looking for a way to mark files (currently these are Word files that are highlighted) to identify text coming from various reference materials. Studio already identifies terms or phrases coming from termbases, and so we would like to use this to mark the source files up, export the file onto .docx and use it for offline projects. This process currently takes up to 3 hours per 70-page file, as one of the reference materials contains 30k+ terms, so we believe we can greatly improve efficiency with a Studio-based process.\nBefore you suggest it: no, our client is not prepared to use Studio for the translations themselves. There are a few operational difficulties as we deal with updates (so, tracked changes) and have had CAPAs in the past. We are only looking at adapting our offline process for now.\nThank you!\n \nRefine the measurement checks\nby \nDiana Palenzuela\n on 12 Feb 2025 1:16 PM in \nTrados Studio Ideas\nHi, Trados Community!\nIt would be of great help if the measurement checks (Verification > QA checker 3.0 > Numbers > Check measurements and currencies) was refined. Errors in units of measurements result in major/critical feedback from RI clients, with good reason - patients getting the wrong dose of the medicine, for instance.\nThe current in-built checker only checks measurements when they appear together with a digit, but that's not how all units of measurement appear in files: you can get, for example, a request to 'report the length of your rash in cm' or tables in which the table header includes the units of measurement so that each cell doesn't include it (this is standard practice in STEM), as well as axes, graphs, and a myriad other scenarios.\nFurthermore, the current feature will warn that \"measurement is missing in target segment or is not properly localised\" where the source contains a number and a UoM but the target only contains a UoM: source: 5 cm/target: cm. In this case, this is a false positive as there is no problem with the units of measurement, only with the numbers. If both the numbers and units of measurement are activated in the Verify, then you get duplicated warnings. The number and unit of measurement checks should be independent, only getting a warning for numbers if there's a number mismatch; and only getting a warning for measurements if there's a UoM mismatch.\nIt also seems that the measurements aren't properly localised - is there a way to customise this? I have an en-es-ES file and it's showing a warning where the source is 5 g/L while the target is 5 g/l - in Spanish for Spain, the symbol for 'litres' is an upper case 'l,' so this is correct.\nDiana Palenzuela on 14 Feb 2025 8:38 AM\nSorry, small correction here as I don't seem to be able to edit: \nIt also seems that the measurements aren't properly localised - is there a way to customise this? I have an en-es-ES file and it's showing a warning where the source is 5 g/L (en-GB) while the target is 5 g/l (es-ES) - in Spanish for Spain, the symbol for 'litres' is a lower case 'l' and in English (UK) it's an upper case L, so this is correct.\n \nYou received this email because you are subscribed to a Weekly Digest for this group. To manage your email subscriptions, \ngo here\n.\n[ref:]",
    "received_at": "2025-02-16T09:03:01+00:00",
    "sent_at": "2025-02-16T09:02:39+00:00",
    "date_extracted": "2025-04-02T19:36:38.663898"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACG_r1EAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAIYEUNhmPDFFpIY3ZEkngaM=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "Watch on-demand | Boost LSP's efficiency with AI in Trados cloud solutions ",
    "body": "Your upgrade to Trados Studio 2024 is now available | Translate everything with next-level productivity\nView in browser\n \n \nContact us\nSave 20% on Trados Studio 2024 or 3 for 2 on multiple purchases\nBoost LSP's efficiency with AI in Trados cloud solutions \nNow available on-demand!\n \nDiscover how you can unlock new levels of efficiency with the powerful AI capabilities available in Trados cloud offerings. \nWatch on-demand\n \nas we show you how to leverage cutting-edge features like Generative Translation and Smart Review to:\nEnhance translation quality and streamline workflows.\nExpand your service offerings to meet the evolving demands of your customers.\nFree up valuable time to focus on tasks that drive business growth and innovation.\nLearn how these AI capabilities, available in \nTrados Team\n and \nTrados Accelerate\n, can empower you to work smarter, deliver more value to your clients, and stay ahead in an increasingly competitive industry.\nWatch on-demand\n \nPlease note: This content is in English.\nYour upgrade to Studio 2024 is now available\nUpgrade today and save 20% on Trados Studio 2024 Professional, or 3 for 2 on multiple licenses\n \nWith enhanced accessibility features and improved cloud capabilities, there's never been a better time to upgrade.\n \nAre you ready for Studio at its most powerful?\nContact us\n \nWhy upgrade?\n \nOffer valid until 31 March 2025. \nFind out more \nabout the world's leading computer-assisted translation software. This offer applies to new, and upgrades to, Studio 2024 Professional perpetual licenses. Pricing excludes local taxes. For more information on this offer, please \ncontact us\n.\n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-02-13T16:08:51+00:00",
    "sent_at": "2025-02-13T16:08:41+00:00",
    "date_extracted": "2025-04-02T19:36:38.996302"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACGYeDnAAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAERpsrkHVD5EsTxrZFhQLv8=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "Save the date for the localization event of the year - ELEVATE 2025!",
    "body": "Mark your calendar on May 6-8, 2025 and register for free now.\nView in browser\n \n \nContact us\nELEVATE 2025\nMay 6-8, 2025\n \nRegister\n \nSave the date! \nGet ready for \nELEVATE\n, the localization industry's biggest online event! Over three days, join translation professionals and academics from around the world to:\nDiscuss key industry trends, including the rise of AI\nExplore technical topics with RWS experts\nDiscover the latest product innovations.\nCan't make it live? No problem. Register and you’ll receive on-demand access to all sessions after the event.\n \nWe're busy finalizing the agenda, but in the meantime, registration is open so secure your FREE spot today! \nRegister\n \n \n \n \n \n \n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-02-11T16:14:09+00:00",
    "sent_at": "2025-02-11T16:13:57+00:00",
    "date_extracted": "2025-04-02T19:36:39.357486"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACF_rd9gAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAIutlgFaHkFGut5fEGZEjQc=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "#TTI: Influence the future of translation technology | February 2025 Newsletter",
    "body": "Take the Translation Technology Insights Survey!\nView in browser\n \n \nContact us\nFebruary 2025 Newsletter\n \nTranslation Technology\nInsights Survey\nInfluence the future of translation technology\nHave your say!\n \nTake part in our \nTranslation Technology Insights 2025 survey\n – a global study exploring our industry's needs, challenges, evolving work patterns, and technological advancements needed to support an ever-changing landscape. \nWe want to hear from you\n \n- the driving force of the translation industry. \nThis is your chance to share your insights on:\nThe work challenges you face every day\nYour thoughts on the rise of AI and how it’s reshaping the industry\nHow you work today - and how you envision that evolving tomorrow\nThe tools and technologies you need to do your job better.\nThe survey is available in several languages, and it takes around 20 minutes to complete. Your answers are strictly confidential.\n \nAs a thank you for agreeing to take part in this research, you can enter our prize draw for the chance to win an \nEmber Travel Mug 2. \n \nThank you for taking part in this important industry research.\n \nTake the TTI survey\n \nWebinars\nView all recorded webinars\n \nWhat's new in Trados Studio 2024\n \n12 February\n \nJoin our webinar us as we explore the latest innovations in Trados Studio. Discover how new subscription-based licensing, advanced cloud integration, and \nAI-powered\n features are transforming translation management. Ideal for LSPs looking to stay competitive, this session offers insights to help elevate your service offerings.\nRegister\n \nHow to translate in Trados Studio \n18 February\n \nRegister for this webinar to learn the basics of \nTrados Studio\n. We'll demo how to create a project in the cloud and translate using key functionality in the online editor and much more. We'll also explain how you can effectively combine the sophistication of the desktop environment with the power of the cloud to increase your productivity!\nRegister\n \nCan't make the date? Don't worry – register anyway and we'll send you the recording.\nThis webinar will be presented in English.\nBoost LSP's efficiency with AI in Trados cloud solutions | \nWebinar recording\nDiscover how Language Service Providers (LSPs) can unlock new levels of efficiency with the powerful AI capabilities available in Trados cloud offerings. In this webinar, we show you how to leverage cutting-edge features like Generative Translation and Smart Review.\nWatch\n \nBlogs\nRead all our blogs\n \nIntroducing Neural Fragment Recall: A Smarter Way to Work\n \nAt Trados, we’re committed to driving innovation that empowers translators and reviewers to work easier, faster and smarter. With that goal in mind, we’re thrilled to introduce Neural Fragment Recall, the new AI-enabled generation of our existing upLIFT Fragment Recall feature. Discover how this new capability elevates translation efficiency by delivering more accurate and consistent fragment suggestions in real-time. \nRead blog\n \nFuture of machine translation in 2025 and beyond | \nLanguage Weaver\n \nDid you know that machine translation has advanced far beyond simple word-for-word translation? It can now be customized to fit your brand, effortlessly translate audio and video content, and speed up your translation processes by integrating with large language models. Discover some of the major technological advancements that are revolutionizing the way you work and leverage machine translation for your business.\nRead blog\n \nUpcoming events \nwe're looking forward to...\n \nELIA Together 2025\nFebruary 20-21 2025, Barcelona\n \nWe are excited to be a Gold Sponsor at ELIA Together, as the event celebrates its ninth edition. This year’s theme, “Shaping the Future of Translation Together”, focuses on how the language industry is adapting to modern challenges through collaboration and technology. \nRegister\n \n \nWe’re delighted to feature \nFLOWSPARKS\n in this partner spotlight. \nFLOW\nSPARKS simplifies workforce training with an eLearning Authoring Tool that makes it effortless to create, translate, and deliver interactive eLearning – saving valuable time and resources in the process. Through the integration between Trados and \nFLOW\nSPARKS, it is now easier and quicker to develop, localise and deliver online learning programs.\nLearn more about FLOWSPARKS\n \n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-02-07T16:00:36+00:00",
    "sent_at": "2025-02-07T16:00:21+00:00",
    "date_extracted": "2025-04-02T19:36:39.996853"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACEiJwAwAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAHAJ9PQBY8hFhO1CwGRG40U=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "[Webinar invite] What's new in Studio 2024",
    "body": "Are you free next week to join our webinar?\nView in browser\n \n \nContact us\nSee what's new in\nTrados Studio 2024\nRegister for our webinar on\n11 Feb 2025, 10am ET / 7am PT\nBook your place\n \nWith access to cutting-edge AI for faster, higher-quality translations,\n Trados Studio 2024 \nempowers you to deliver better translations while promoting inclusivity and innovation.\n \nJoin our webinar on 11 February to see Studio 2024's new features and enhancements in action, including:  \nPowerful AI capabilities such as \nTrados Copilot – AI Assistant\n, enabling you to leverage LLMs to take your translation to the next level \nEnhanced usability features, including\n Manager view\n offering a whole new way to work with projects and files \nIncreased accessibility\n,\n \nincluding the ability to complete a project roundtrip with screen readers.\nSecure your free place\n \nCan't make the date? Don't worry – register anyway and we'll send you the recording.\nThis webinar is a re-run from the broadcast in August 2024. The webinar will be presented in English.\n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-02-05T16:29:50+00:00",
    "sent_at": "2025-02-05T16:29:37+00:00",
    "date_extracted": "2025-04-02T19:36:40.676759"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACEiJwAgAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAOcLkyOlni1CtEFZxDkQhR0=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "Project 2024378 Diligent WO_Altera_COC_121824 was deleted",
    "body": "Project 2024378 Diligent WO_Altera_COC_121824 was \ndeleted!\n \nDear \nMaya Benoit\n, \nProject 2024378 Diligent WO_Altera_COC_121824 has been deleted. \nDETAILS\nAccount\n \nLanguage and Culture Worldwide, LLC\nCustomer\n \nCompliance Wave\nShort ID\n537\nName\n \n2024378 Diligent WO_Altera_COC_121824\nDescription\n \nSource Language\n \nen-US\nTarget Languages\n \npt-BR\nDue Date\n \n02/07/2025 05:00:00, UTC\n \n \nJoin our Community\n \nFind answers to your questions, or contribute your own on the RWS Community!\n \n \nNeed more help?\n \nGet in touch with the human side of RWS! \n \n \nAll contents copyright ©2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-02-04T00:34:45+00:00",
    "sent_at": "2025-02-04T00:34:35+00:00",
    "date_extracted": "2025-04-02T19:36:40.944119"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACEiJwAQAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAKAR9O8y3DdDvGHvHKzdUSY=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "Your project Diligent WO_DELMONTE_COC_080624 is now overdue",
    "body": "Your project Diligent WO_DELMONTE_COC_080624 is now \noverdue\n. \nDear \nMaya Benoit\n, \nThe requested date for this project \nDiligent WO_DELMONTE_COC_080624\n has now passed. \nDETAILS\nAccount\n \nLanguage and Culture Worldwide, LLC\nCustomer\n \nCompliance Wave\nShort ID\n \n536\nName\n \nDiligent WO_DELMONTE_COC_080624\nDescription\n \nSource Language\n \nen-US\nTarget Languages\n \nar-EG, zh-CN, fr-FR, el-GR, it-IT, ja-JP, ko-KR, pt-BR, es-AR\nDue Date\n \n02/03/2025 23:30:00, UTC\n \n  \nClick \nhere\n to view more details about this project. \n \nJoin our Community\n \nFind answers to your questions, or contribute your own on the RWS Community!\n \n \nNeed more help?\n \nGet in touch with the human side of RWS! \n \n \nAll contents copyright ©2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-02-03T23:34:12+00:00",
    "sent_at": "2025-02-03T23:34:00+00:00",
    "date_extracted": "2025-04-02T19:36:41.234097"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACEiJv-gAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAHdGYGEjQDZKoHhGRVEkpWA=",
    "from": "mesposito@alphatrad.net",
    "to": "c.desanctis@lcwmail.com, m.benoit@lcwmail.com, m.fagrelius@lcwmail.com",
    "reply_to": "mesposito@alphatrad.net",
    "in_reply_to": "N/A",
    "subject": "Reconnecting and Inquiring about Future Collaboration for Your Italian Language Requirements",
    "body": "Dear Project Manager,\n \nI trust this message finds you well. As a professional translator, I have had the pleasure of working with valued clients like Language & Culture Worldwide and I am grateful for your past support.\n \nI have enjoyed assisting with your translation, MTPE, editing and review needs over the last years, ensuring accurate communication across languages. I appreciate the trust you have placed in my services.\n \nI am reaching out to remind you that my Italian translation services are still available whenever you need. Whether it's technical content, software localization, legal documents, marketing content or any other linguistic assistance, I am here to help. \n \nIn addition to this, I would like to inform you that I also provide my language services from French, Spanish, and German to Italian. This is to ensure that I can cater to a wider range of your linguistic needs.\n \nAs a token of my gratitude, I am offering a 5% discount on your next translation project. This offer is exclusive to returning customers like you.\n \nI am open to discussing your specific needs and tailoring my services accordingly. \n \nIf you have any upcoming projects or need assistance, please feel free to reach out. I look forward to potentially working with you again and providing high-quality translations.\n \nFor any questions or further information, please contact me at \nmesposito@alphatrad.net\n / +39-335-1777-446.\n \nWishing you continued success!\n \nWarm regards,\n-------------------------------- \nDr. Michele Esposito\nSenior Translator\nAlphatrad Worldwide Ltd\nSpecializations:\n IT, IP, Automotive, Marketing, Law, Finance, Life Sciences\nCertifications:\n \nDIN EN ISO 17100:2016-05 Certified\n \nProZ.com Certified PRO\n \nSDL TRADOS Certified - Level 3\n🌐 \nAlphatrad Ltd\n | ProZ Profile: \nhttps://url.us.m.mimecastprotect.com/s/KIwQC82nyDI6mOwUnfDTyvWTq?domain=proz.com\n✉ \nmesposito@alphatrad.net\n | \nesposm@libero.it\n☏ \nOffice:\n +39 081-009-3145 | +356 27-781-900\n📱 📲 \nMobile - Whatsapp:\n + 39 335-1777-446\n📞 Skype:\n alphatrad-ww",
    "received_at": "2025-02-03T16:39:20+00:00",
    "sent_at": "2025-02-03T16:38:51+00:00",
    "date_extracted": "2025-04-02T19:36:42.332021"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACEiJv-QAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAD_CVZM-O1JPnjd_Ch2cvLk=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "The due date for project Diligent WO_DELMONTE_COC_080624 is approaching",
    "body": "The deadline for project Diligent WO_DELMONTE_COC_080624 is approaching.\nDear \nMaya Benoit\n, \nThe requested date for project Diligent WO_DELMONTE_COC_080624 falls within the next 24 hours.\nDETAILS\nAccount\n \nLanguage and Culture Worldwide, LLC\nCustomer\n \nCompliance Wave\nShort ID\n \n536\nName\n \nDiligent WO_DELMONTE_COC_080624\nDescription\n \nSource Language\n \nen-US\nTarget Languages\n \nar-EG, zh-CN, fr-FR, el-GR, it-IT, ja-JP, ko-KR, pt-BR, es-AR\nDue Date\n \n02/03/2025 23:30:00, UTC\n \n  \nClick \nhere\n to view more details about this project. \n \nJoin our Community\n \nFind answers to your questions, or contribute your own on the RWS Community!\n \n \nNeed more help?\n \nGet in touch with the human side of RWS! \n \n \nAll contents copyright ©2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-02-02T23:30:31+00:00",
    "sent_at": "2025-02-02T23:30:20+00:00",
    "date_extracted": "2025-04-02T19:36:42.446138"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACEiJv-AAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAEZiwd3YvqVKklTF3K3kCrU=",
    "from": "noreply@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@rws.com",
    "in_reply_to": "N/A",
    "subject": "New RWS Support Portal",
    "body": "New RWS Support Portal\nView in browser\n \n \nNew RWS Support Portal\n \nDear Customer,\n \nFurther to our announcement of the upcoming new Support Portal, we are pleased to confirm that, pending successful internal testing, the new portal will be launched next month. We will be in touch with a confirmed date closer to the launch.  Rest assured, any cases that are open at that time will be seamlessly migrated to the new system.\n \nWhile the new portal should feel very familiar, we will provide additional documentation to help you settle in. This documentation will be available closer to the launch date.\n \nThank you for your continued support!\n \nThe RWS Support Team\nYou are receiving this communication as it contains important information that could impact your usage of our products. Whilst these operational communications are necessary based on your status as a customer, if you \ndo not \nwish to receive these emails you can let us know by emailing \nengage@rws.com\n or by clicking this link \nhere\n.\n \nYou may receive separate marketing emails in future depending on your selections recorded in our \npreference center\n, which you can visit to change your preferences for marketing emails. \n \n \n \n \n \n \n \nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \n© 2024 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-02-01T00:01:45+00:00",
    "sent_at": "2025-02-01T00:01:35+00:00",
    "date_extracted": "2025-04-02T19:36:42.519479"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACEiJv_wAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQACul0lTZwa9Co9W2kBhQico=",
    "from": "noreply@cloud.trados.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "noreply@cloud.trados.com",
    "in_reply_to": "N/A",
    "subject": "A new project called 2024378 Diligent WO_Altera_COC_121824 was created in Trados",
    "body": "2024378 Diligent WO_Altera_COC_121824\n has been created\nDear \nMaya Benoit \n, \nA new project has been created for an account you manage. \nDETAILS \nAccount\nLanguage and Culture Worldwide, LLC\nCustomer\nCompliance Wave\nShort ID\n537\nName\n2024378 Diligent WO_Altera_COC_121824\nDescription\nSource Language\nen-US \nTarget Languages\npt-BR \nDue Date\n02/07/2025 05:00:00, UTC\n \n \nClick \nhere\n to view more details about this project. \nJoin our Community\nFind answers to your questions, or contribute your own on the RWS Community!\nNeed more help?\nGet in touch with the human side of RWS! \n \n \nAll contents copyright © 2025 RWS Holdings Plc. \n \nEuropa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, Buckinghamshire, SL9 9FG, United Kingdom",
    "received_at": "2025-01-31T03:54:54+00:00",
    "sent_at": "2025-01-31T03:54:46+00:00",
    "date_extracted": "2025-04-02T19:36:43.104913"
  },
  {
    "email_id": "AQMkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQBGAAADQRSRHLTZx0qsyusoE1s41QcA81sF6_nlS0eEGKcm7pApBwAAAgEMAAAA81sF6_nlS0eEGKcm7pApBwACEiJv_gAAAA==",
    "conversation_id": "AAQkADI0NWMwNTMyLWI2MDctNGFiNC05Y2FiLTcwOWIzY2ZkODkwYQAQAKic_4Q6uRBDmoTCJ7B_IMo=",
    "from": "trados@rws.com",
    "to": "m.benoit@lcwmail.com",
    "reply_to": "trados@rws.com",
    "in_reply_to": "N/A",
    "subject": "Your upgrade to Trados Studio 2024 is now available | Translate everything with next-level productivity",
    "body": "Upgrade today and save 20% on Trados Studio 2024 or 3 for 2 on multiple purchases\nView in browser\n \n \nContact us\nTranslate everything with next-level productivity\nHarness the power of AI to work smarter\n \nTrados Studio 2024\n allows everyone in the supply chain - translators, project managers, and reviewers - to use AI for greater efficiency and to aid better translation quality.\n \nTrados Copilot, available in Studio 2024, is our LLM-powered virtual assistant, designed to help you work smarter, no matter your role. It offers: \nAI Assistant:\n Leverage AI to adjust translation output to suit you; for example, to apply a more casual tone, or to use any known terminology automatically.\nSmart Help:\n Get instant answers to any product questions through our AI chatbot available in the browser, complete with direct links for further learning.\nDiscover more\n \nWhy upgrade?\n \nYour upgrade to Studio 2024 is now available\nUpgrade today and save 20% on Trados Studio 2024 Professional, or 3 for 2 on multiple licenses\n \nWith enhanced accessibility features and\nimproved cloud capabilities, there's never\nbeen a better time to upgrade.\n \nAre you ready for Studio at its most powerful?\nContact us \nOffer valid until 31 March 2025. \nFind out more \nabout the world's leading computer-assisted translation software. This offer applies to new, and upgrades to, Studio 2024 Professional perpetual licenses. Pricing excludes local taxes. For more information on this offer, please \ncontact us\n.\n \n \n \n \n \nNot interested in this email? You can access your personal \npreference center\n below to select more relevant topics to hear about, or you can \nunsubscribe \nfrom all marketing communications sent from RWS.\n \nClicking unsubscribe below will \nstop \nall marketing you’re receiving from RWS across Localization, Content, Artificial Intelligence, and IP Services.\nRWS, Europa House, Chiltern Park, Chiltern Hill, Chalfont St Peter, United Kingdom SL9 9FG \nUnsubscribe\n \nManage preferences\n \n© 2025 RWS Holdings Plc. All rights reserved. The RWS name and logo, and RWS product and service names are trademarks of RWS Holdings Plc and/or its subsidiaries, some of which may be registered. Other company, product or service names are the property of their respective holders. This email was sent to m.benoit@lcwmail.com.",
    "received_at": "2025-01-30T16:05:13+00:00",
    "sent_at": "2025-01-30T16:05:01+00:00",
    "date_extracted": "2025-04-02T19:36:43.144585"
  }
]