[
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVeamY2AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAMBV0yQ4hudPqAsU2lRoMCU=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Let’s talk about “being yourself” at work",
    "body": "Plus: Complex organizations, innovating companies, and efficient governments.\n \nFebruary 25, 2024\nView in Browser\n \n \n \n \nThe latest research and ideas from the Kellogg School of Management at Northwestern University\n \n \nOrganizations Are Complex. Complexity Science Can Help Us Understand Them.\n \nYou can’t study the behavior of a flock by looking at individual birds. It’s time to bring that holistic approach to the social sciences, too.\n \n \nPodcast: How Should You Present Yourself at Work?\n \nBe yourself! No, not like that. On this episode of The Insightful Leader, we help you navigate the competing advice about how much to share and hold back.\n \n \nWebinar\n \nThe Insightful Leader Live: Is the Future of the U.S. … Italy?\n \nJoin Nicola Persico for a complimentary webinar where he’ll offer up his home country, Italy, as a cautionary tale for the United States. \nJoin us, Thursday, February 29 at 12pm CST.\nRegister\n \n \nFrom the Archive\n \nTips for Established Companies to Keep Innovating\n \nIntrapreneurship requires you to “think like a disruptor.”\n \n \nFrom the Archive\n \nIs an Efficient Government Always a Good Thing?\n \nHistory sheds light on how processes designed to serve citizens can also be put to nefarious ends.\n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-25T12:04:59+00:00",
    "sent_at": "2024-02-25T12:04:53+00:00",
    "date_extracted": "2025-04-03T20:35:57.178812"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVcWNIzAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAEYLRPHCY8ZKscYp31El11c=",
    "from": "noreply@godfreyhotelchicago.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "751x50y53056w58d51a50t57h56a50954358w50100@u.zmaildirect.com",
    "in_reply_to": "N/A",
    "subject": "Last Chance!",
    "body": "You don't often get email from noreply@godfreyhotelchicago.com. \nLearn why this is important\nCelebrating a Decade of Memories! \n \n \n \nFEB 2024\n \nThis month marks our 10 Year Anniversary in Chicago! Join us in celebrating a remarkable milestone with a nostalgic twist. In honor of this special occasion, we're thrilled to present our \n$79 Decade Flashback Rate\n, transporting you to the charm of the past with great savings!\nBOOK NOW\n \n$10 HAPPY HOUR\nTuesday-Friday at I|O Godfrey\nIn honor of our 10 year anniversary, all items on our Happy Hour menu are $10 for the entire month of February. Available Tues-Thur: 2pm-5pm; Fri: 12pm-3pm.\nVIEW THE MENU \n \n$10 I|O COSMO + PROSECCO\nAvailable for the month of February\nToast to ten incredible years with us! For the month of February, savor our celebratory $10 I|O Cosmo and Prosecco specials. R\naise a glass to a decade of excellence!\nRESERVE A TABLE \n10pm Toast to Ten Years!\nI|O GODFREY ROOFSCAPE\n \nEvery Friday & Saturday during February\nAt 10:00 p.m. every Friday and Saturday during February, enjoy a complimentary glass of bubbles to celebrate the last decade!\nThe fun pops off Friday, February 2, 2024.\nMAKE A RESERVATION\n \nTAKE A LOOK AT OUR OTHER LOCATIONS\n \nTHE GODFREY HOTEL HOLLYWOOD\n \nTHE GODFREY HOTEL BOSTON\n \nTHE GODFREY HOTEL DETROIT\n \nNEED TO RESCHEDULE?\nWe are amending our standard cancellation policy for the time being. You can reschedule or cancel your stay if booked direct up to 24 hours prior. Please contact us at (312) 649-2000 or \nFrontDesk@godfreyhotelchicago.com\n for more information.\n \n \n1\n27 West Huron at LaSalle, Chicago, IL 60654\nMain Line: \n(312) 649-2000\nFrontDesk@godfreyhotelchicago.com\n \n \n \n \n \nView in browser\n | \nUnsubscribe",
    "received_at": "2024-02-23T15:05:14+00:00",
    "sent_at": "2024-02-23T15:05:02+00:00",
    "date_extracted": "2025-04-03T20:35:57.818635"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVbIs0IAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAJpx3sKI4xtCs_rFH14s1Fk=",
    "from": "info@sietarusa.org",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@sietarusa.org",
    "in_reply_to": "N/A",
    "subject": "The SIETAR USA 2024 Conference  Starts...",
    "body": "...TOMORROW, 22-Feb-2024! ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌\n \n \nView in Web Browser\n \n \n \n \n \n \n \n \n \n \n \n \n The \nSIETAR USA 2024 Virtual Conference\n \nstarts TOMORROW!\n \n \n \n \n \nHaven't registered yet?\n \n \n \n \n \n \nWhat's stopping you? The conference starts TOMORROW, February 22! Just click the 'Register NOW' button below to sign up (ticket options are listed down the right-hand side of the page), and then check out the conference agenda and get your profile ready.\nWe hope to \"see\" you there!\nYour SIETAR USA Conference Team\np.s.: Still on the fence? Remember, your paid registration gets you access to recordings of all conference sessons even if you can't attend the entire event!\n \n \n \n \n \n \n \n \nRegister NOW \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUnsubscribe\n | Sent by SIETAR USA \n4880 Lower Roswell Rd, Suite 165 • Marietta , GA • 30068",
    "received_at": "2024-02-21T21:24:43+00:00",
    "sent_at": "2024-02-21T21:24:36+00:00",
    "date_extracted": "2025-04-03T20:35:57.865594"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVbIs0HAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAIYfEXplNJRBmBTW9GWrOSE=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "The upside of in-person work",
    "body": "Plus: the importance of aligned incentives. \nThe upside of in-person work  ·  \nView in browser\n \nThe Insightful Leader\nBY \nKELLOGG INSIGHT\nLeadership advice from the Kellogg School of Management at Northwestern University\nGood morning,\nIt’s been about four years since COVID-19 began spreading across the world—and with it, the popularity of remote work.\nHere in the U.S., most remote-capable jobs (60 percent) used to be done exclusively on-site. But in a \nfew short years\n, those numbers have been flipped on their head. Now that number is just 20 percent. In other words, the majority of workers who can telework now do, at least part time.\nSo at \nKellogg Insight\n, we’re always on the lookout for studies that can tell us how to make sense of remote work. Today, we’ll share one such study. Plus: compensating Elon Musk, and why we’re all suddenly afraid to fly on planes.\nProximity isn’t dead yet\nIn-person work has an important role to play in innovation and, in particular, in how much we are able to \nlearn\n from our collaborators.\n \nThis finding comes from a study by Kellogg’s \nHyejin Youn\n and her collaborator Frank van der Wouden of the University of Hong Kong (and a former Kellogg postdoc). The researchers analyzed more than 17 million scientific publications over the past 45 years.\nSpecifically, they set out to identify scholars who had gained new knowledge from their previous collaborations. A good proxy for this, they realized, was doing research in a new field: someone who started their career in one academic discipline, then collaborated with authors from another discipline, and ultimately published a paper in that new field as a sole author. This seemed like straightforward evidence that they’d learned from their earlier collaboration. In their sample, the team found 1.7 million researchers who fit the bill.\nThen they identified the geographic locations of those researchers and their collaborators. Collaborators were considered “local” if they were less than 700 meters apart, about a 10-minute walk.\nThey found that researchers who collaborated locally were more likely to gain new knowledge from their teammates than those who collaborated at a distance. The difference was most pronounced in the science and engineering disciplines, as well as for researchers who were in the earlier stages of their careers, and those at lower-ranked institutions.\nThe researchers take this as evidence that being together physically—perhaps reading body language, mulling a problem at a whiteboard, and teaming up to use specialized laboratory equipment—is particularly important for innovation.\nWhich doesn’t mean working remotely doesn’t have its place. Youn is a big fan of hybrid work, where employees can be productive at home, but then work together in-person to generate something new.\n“We learn from each other in person more than we think we do,” Youn says. “That’s part of our success as humans, especially when it comes to knowledge that is new, not yet defined. You have to be present to watch and learn. And collaborating locally is the way to do that.”\nYou can read more about the research in \nKellogg Insight\n \nhere\n.\nThe importance of aligning incentives\nElon Musk isn’t the only one who was disappointed when a Delaware judge decided to deny him his $55 billion dollar compensation package. \nGeorge Georgiadis\n, an associate professor of strategy at Kellogg, wasn’t pleased either.\nYes, $55 billion is a pretty eye-popping sum, he acknowledges in a recent piece for \nThe Hill\n. But the package was specifically designed to be high-risk, high-reward to incentivize performance—and somewhat improbably, Tesla’s stock price hit nearly all of its targets.\nMy argument doesn’t center on whether Musk, already a multibillionaire, would be more or less incentivized with $10 billion instead of $50 billion. The concern lies in preserving and protecting the integrity and effectiveness of performance pay.\nPerformance pay can be highly effective in aligning a company’s goals with employees’ actions, even when the likelihood of hitting performance targets seems slim. It aids in retaining employees, particularly high performers. Bonuses, alongside stock and option awards subject to vesting, provide compelling reasons for talented individuals to remain with the company. Their effectiveness, however, hinges on trust in the stability of rules and the commitment that goalposts won’t shift if someone defies the odds.\nYou can read more of Georgiadis’s argument in \nThe Hill\n \nhere\n.\n“The media tends to report things that really tap into our general concern. These events get overrepresented in the context of social media. If you’re a user and you’re looking at these stories, you don’t see how many planes were successful in their flights, which is a lot. You just see the thing that is drawn in your attention, the thing that’s reported, the crashes.”\n— Assistant professor of marketing and organizations \nWilliam Brady\n, in \nThrillist\n, on the recent media coverage of Boeing.\nSee you next week!\nJess Love, editor in chief\nKellogg Insight\n  \nYou should follow us on \nTwitter\n or \nLinkedIn\n.\nAnd listen to our \npodcasts\n.\nFeedback\n  ·  \nUnsubscribe\n  ·  \nAbout Us\n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-21T12:04:46+00:00",
    "sent_at": "2024-02-21T12:04:36+00:00",
    "date_extracted": "2025-04-03T20:35:59.028900"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVbIs0GAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAIdR5WoVZypAvnlgML9Prew=",
    "from": "johns@drjohnsullivan.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "johns@drjohnsullivan.com",
    "in_reply_to": "N/A",
    "subject": "This “Forever” Hiring Shortage… Will Forever Hurt Your Business Results (Shifting to Competitive Advantage Recruiting)",
    "body": "You don't often get email from johns@drjohnsullivan.com. \nLearn why this is important\nThe recent Post-COVID hiring shortage wasn’t temporary, instead, it’s a permanent business condition.\n \n \nShare\n \n \nShare\n \n \nTweet\n \nLATEST ARTICLE\n \nThis “Forever” Hiring Shortage… Will Forever Hurt Your Business Results (Shifting to Competitive Advantage Recruiting)\nThe recent Post-COVID hiring shortage wasn’t temporary, instead, it’s a permanent business condition. So why isn’t it a standard corporate practice to measure (and respond to) the current level of recruiting competition in your industry?\nDescriptors\n| Recruiting / Hiring shortages – Future of recruiting components – 5 min read\nIn order to minimize the business damage during this prolonged shortage, Recruiting will be required to make a quantum shift in both its recruiting strategy and its hiring tools. So, the recruiting function now offers its organization a competitive advantage over each of its major recruiting competitors. I call this required new TA strategy, Competitive Advantage Recruiting (or CAR).\nCompetitive Advantage Recruiting… provides the recruits that allow business units to prosper\nCompetitive Advantage Recruiting is a next-generation recruiting strategy designed to allow a corporation to dominate the hiring competition in its industry. Its primary differentiating factor is that it is externally focused. So, it has as its primary goal the reaching and then the maintaining of a competitive advantage in this permanently competitive marketplace. Of course, for that to happen, every aspect of your recruiting process must have a superior design. So that it produces superior results (when compared side-by-side to the same process in operation at your TA competitors). A second goal is to provide superior recruiting performance as a result of using an objective data-driven recruiting strategy and toolkit. A listing of the core elements of this CAR strategy can be found later in this article. \nNote:\n You can learn more about the steps for implementing Competitive Advantage Recruiting \nhere\n. \n————————————\nExpect These Negative Business Consequences \n(When you fail to adapt to this forever shortage) \nKorn Ferry\n estimates that by 2030, this global talent shortfall will result in 85 million open jobs that can’t be filled. And that failure will cost companies trillions of dollars in lost economic opportunities. When that shortfall occurs at your corporation, your executives will realize that this hiring shortage will permanently hurt your sales/profit, stock price, production, AI, supply chain, and innovation. These top 10 negative consequences are listed below, with the highest impact negative consequences appearing early on the list. \nExecutives will notice the revenue shortfalls –\n when recruiting ends up hiring lower-performing individuals into revenue-generating positions. Or when revenue-generating and revenue-impact positions are left vacant for too long. Your business will not generate enough revenue to meet its budget allocations. And that loss in revenue may actually lower your stock price.\nInnovation will come to a grinding halt –\n employees will be overworked because of numerous hiring failures in key positions. These innovator employees simply won’t have the time to collaborate or to think about future innovations. In addition, in a highly competitive marketplace. A strained and poorly designed recruiting process won’t have the capability to recruit additional innovators successfully. Taken together, these will limit your organization’s most valuable human output.\nSome work simply won’t get done \n– when a significant percentage of your priority jobs go unfilled. Much important work simply won’t get done. And when one phase of a business process doesn’t get completed, the output of the entire process will be reduced.\nDeadlines will be missed\n – with a significant percentage of your priority jobs going unfilled. And with other jobs remaining open for months. Many internal and external deadlines will simply be missed.\nWork quality will diminish\n –ineffective sourcing and candidate screening processes will result in the hiring of many weak performers. Those mis-hires, coupled with so many unfilled jobs, will require team members to work longer hours just to produce the same volume of work. And that employee strain/stress will likely result in more accidents. As well as a measurably lower quality of work that your customers will likely notice.\nYour new hire turnover will be high\n – because your overworked recruiters won’t likely have enough time to match a top candidate perfectly with their perfect job/manager. Your new hire turnover rate will likely be extremely high, and that will be extremely expensive.\nYou will hire less diversity – \ndiverse teams are desirable because studies show they are more productive. However, without a data-driven diversity recruiting process that provides a competitive advantage, you will likely fail to get even your fair share of the available diversity candidates.\nOutdated hiring processes will hurt your brand –\n when your image as a desirable company fades. As a result of potential candidates learning about ineffective hiring processes and a poor candidate experience. Over time, your recruiting results will continue to degrade unabated.\nHiring manager time will be wasted\n – a weak, noncompetitive recruiting process will result in many failed searches. And having to reopen so many of them will exhaust and frustrate your hiring managers.\nTA may be outsourced\n – as the hiring shortage at your organization becomes more severe over time. You can expect added pressure from your executives to give up and to outsource your entire function to a lower-cost vendor instead.\n————————————\nHere Are The Core Elements… Of The CAR Strategy\nFor your corporation to remain successful during this permanent hiring shortfall, I have found that it must shift away from the traditional recruiting model. And shift into this competitive advantage recruiting strategy. A dozen core elements of this Competitive Advantage Recruiting strategy are highlighted below.\nRaise the bar to recruiting domination \n– even the recruiting functions that have been successful in the past. Will struggle throughout this “forever” hiring shortage because of the intense competition that everyone will now face. This will force your executives to raise the bar on recruiting, away from the historical goal of simply being competitive, to a higher goal of recruiting dominance in your industry. And it will be quickly obvious to everyone that you won’t be able to dominate without a much more aggressive strategy and toolkit. That includes a component of continually tracking every aspect of the recruiting marketplace and what each of your TA competitors is doing. \nIt is data / metric driven\n – with the high level of competition, you simply can’t tolerate high error rates. So, this CAR strategy emphasizes data-driven decisions and the use of performance metrics throughout the recruiting process.\nIt emphasizes having direct business impacts\n – because clear ownership leads to excellence. TA must accept the accountability for not just completing hires. But going further to ensure that those hires produce measurably higher business impacts. So, as part of the strategy, TA must have a process for measuring the direct business impact that recruiting creates in each strategic business function.\nIt prioritizes key jobs\n – because there are never enough resources to hire the best for every open job. This CAR strategy prioritizes jobs so that it is easier to focus the most and the best recruiting resources on filling these priority jobs with exceptional talent. Similarly, the strategy also prioritizes key business units and teams.\nIt uses a mass personalized recruiting approach \n– research shows that targeted, personalized recruiting is much more effective than the “treat them all the same” shotgun approach. So, the CAR strategy focuses on providing “mass personalized” recruiting in priority jobs. The first step in mass personalization is accepting the fact that top candidates now hold (and will continue to hold) a lopsided amount of power in the recruiting relationship. Mass personalization also requires you to treat top candidates as unique individuals who will add tremendous value to your organization. This customized approach also requires you to tailor your recruitment marketing and your assessment and selling approaches. So that they closely fit the candidate’s expectations, needs, and job acceptance criteria. \nIt is an aggressive strategy – \nyou certainly won’t be able to win a long-term “war for talent” unless you are aggressive and are willing to take some risks. And that level of aggressiveness begins with directly targeting (some call it poaching) the most desirable “passive candidates” currently fully employed because the very best and most desirable candidates are likely already working across the street at one of your competitors. As an added bonus, when you recruit employees away from individual competitors. You will likely also acquire their organization’s new ideas and best practices.\nThe strategy assumes continuous obsolescence\n – in order to keep up with the rapid speed of change that results from the continuous implementation of new recruiting technology. Recruiting leaders must assume that every element in your current recruiting effort is constantly becoming obsolete. To avoid obsolescence, TA must use data to continually test and then update every individual recruiting process and tool that is beginning to become obsolete. \nIt demands that you only use the best sources\n – because all successful hiring of top performers starts with great sourcing. TA leaders must use data to identify and exclusively use the best sources to find candidates for each priority job. Usually, the most effective sourcing channel that should be emphasized is a data-driven referral program that makes every employee a 24/7 talent scout.\nIt hires fast\n – because the competition for top candidates will remain high. The best candidates may now make their job choices even faster. And that will mean that you won’t be successful unless you assess candidates and make offers faster than your competitors. That means that you must analyze every hour of your hiring process. To shorten it without negatively impacting new hire quality.\nIt creates a candidate pipeline\n – one of the keys to successfully hiring the top “passive candidates.” It is to start identifying and building a relationship of trust with them long before you actually have an open position for them. And the tremendous value added by this “upfront time.” This makes the creation and maintenance of this pipeline essential.\nIt builds a powerful brand\n – in a highly competitive marketplace. It’s important to realize that top candidates are first drawn to employers with a well-known employer brand. So, if you even expect to get the attention of the most in-demand candidates. You must build, maintain, and measure the strength of your organization’s employer brand.\nYour recruiters must be tech and business-savvy \n– to successfully recruit top tech and in-demand talent. You must have sophisticated recruiters who fully understand each candidate and the technologies that they use. Also, to gain the trust and the time of your hiring managers. Your recruiters must fully understand the business environment and the challenges that the hiring manager faces.\nYou must emphasize recruiting remote workers \n– because hiring shortages are often limited to a few geographic areas. Hiring managers can avoid some of those shortages by opening up more remote work opportunities. In addition, hiring managers must realize that they can only land some top global candidates if they offer them a work-at-home option. \nNote:\n You can learn more about the additional critical success factors in this CAR strategy \nhere\n.\n————————————\nIf You Want To Know More About… The Underlying Causes Of This Shortage\nIf you’re interested, this next section provides a “snapshot list” of what I have found to be the top 10 factors. That is driving this increase in the recruiting competition. Either by increasing the number of job openings or talent competitors. Or by reducing the available supply of applicants. \nFactors that are increasing the number of job openings\nThe expanding use of technology results in numerous new job openings \n– the ever-accelerating spread of technology into every business function. This means that there will continue to be multiple job openings available to each qualified candidate. But especially in the functional areas of AI, Quantum Computing, IT, marketing, and data security.\nHigh employee turnover rates are increasing the number of job openings \n– since the beginning of the great resignation, employee turnover rates have been high. With so many employee departures, companies will continue to have more jobs to refill. \nWeak corporate recruiting will keep jobs open for longer\n – budget cuts and recruiter layoffs will continue to limit the recruiting capabilities of many corporations. And with so many ineffective corporate recruiting efforts. Most hard-to-fill jobs will stay open much longer. And that will increase the number of days when a recruiter must compete against other active recruiters. \nFactors that are decreasing the number of potential applicants\nRapid skill obsolescence reduces the number of highly skilled candidates \n– in our fast-changing world, employee skills quickly become outdated. And that, coupled with massive cutbacks in corporate training, means that the percentage of the workforce currently upskilled in the needed technology areas isn’t rising to meet the demand for skilled new hires. While at the same time, there may be a continuing surplus of lower-skilled workers.\nGig jobs reduce the available corporate workforce\n – the increased availability of gig jobs and Internet income opportunities. It will continue to reduce the percentage of the overall workforce interested in corporate jobs.\nRetirements continue \n– large-scale baby boom retirements are ongoing. And those retirements continue to reduce the size of the available workforce. \nThere is a shortage of college grads \n– fewer students are now entering college. And the number of graduates in hot technical majors hasn’t kept up with the demand. So, college recruiting in hot majors will continue to be highly competitive.\nLower levels of immigration\n – lower projected levels of legal immigration. A decrease in the number of foreign students attending US colleges will result in a lower supply of international workers who can work in US facilities.\nSmaller families reduce the growth of the workforce \n– a global population shrinkage trend is now a problem in Italy, Japan, China, and, to some extent, the US. This continuing trend will mean fewer young candidates will enter the workforce over the next decade. \nWorker priorities are changing \n– because of the Covid scare and the continuing high unemployment rate. This has caused many potential candidates to take their time in deciding whether they will return to corporate work. In addition, increased levels of employee burnout and harsh return-to-the-office policies are also causing many potential applicants to delay their return to the workforce.\nIf you only do one thing \n– begin to track these ratios. The number of qualified applicants per priority open jobs. And the number of companies actively recruiting for your most critical job to determine how stiff your recruiting competition currently is.\nFinal Thoughts\nHistorically, the critical factors essential for business growth included access to enough capital, land/raw materials, machinery, and labor/management capabilities. However, in today’s fast-moving and quick-to-copy everything global business environment. A new business growth paradigm has been developing. So, over time,\n technology capability, innovation, and speed may soon become the three top critical success factors \nthat now drive continuous business growth. \nAs a result of the emergence of these new growth factors, great hiring has become strategically essential. A corporation simply can’t develop or implement technology, move fast, or innovate without the capability of successfully hiring exceptional candidates in the most competitive recruiting marketplace ever.\nAuthor’s Note\n \nPlease spread these ideas\n by sharing this article with your team/network\n and by posting it on your favorite media.\nAlso, join the well over 20,000+ that follow or have connected with Dr. Sullivan’s community on \nLinkedIn\n. \nAnd, if you don’t already subscribe to Dr. Sullivan’s Aggressive Talent Management articles, you can do that \nhere\n.\nMOST RECENT ARTICLES\nThis “Forever” Hiring Shortage… Will Forever Hurt Your Business Results (Shifting to Competitive Advantage Recruiting)\nDiscover Exceptional Candidates – Scan Resumes For These Talent Indicators\nCompetitive Retaliation – When They Recruit Your Talent… Strike Back Hard! (To boost your employee retention)\nA Fresh Eyes Review… The Key To Getting Any Business Proposal Approved (And a Promotion)\nRESOURCES\n \nStay Interviews and Other Powerful Retention Tools\nIn this brand new eBook, learn how to implement Stay Interviews, the highest ROI activity that any manager can utilize which has been proven effective in keeping top performers.\nPURCHASE HERE\n \n \nOnboarding & Orientation Toolkit\nHave you been frustrated that it takes new hires/transfers longer than it should to get up-to-speed and become productive faster? If so, then this Guide is the essential must-have, must-read, must-do resource for you!\nPURCHASE HERE\n \nIf my article stimulated your thinking and provided you with actionable tips, please follow or connect with me.\n \n \n \n \n \nPROFESSOR, SPEAKER, ADVISOR, AUTHOR\nDr. Sullivan has written over 1300 articles and a dozen white papers, conducted over 50 different webinars, and dozens of workshops. He is an engaging corporate speaker who has excited audiences at over 300 corporations/organizations in 30 countries on six continents.\nDr. John Sullivan is a noted author, speaker, and educator. He leverages his 30+ years of guidance to Fortune 500 and Global 1000 firms.\nIf you need advice or a speaker, contact us at john@drjohnsullivan.com \nCopyright © 2024 \nDr John Sullivan\n, All rights reserved.\nYou are receiving this email because you opted in for updates on DrJohnSullivan.com\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-02-20T15:06:09+00:00",
    "sent_at": "2024-02-20T15:05:58+00:00",
    "date_extracted": "2025-04-03T20:35:58.511421"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVaNmc6AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAMuJ2iKZtUBPjnjX8iz3aAQ=",
    "from": "enquiries@lovethework.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "enquiries@lovethework.com",
    "in_reply_to": "N/A",
    "subject": "The Progress Check: Sustainability | FREE ACCESS",
    "body": "You don't often get email from enquiries@lovethework.com. \nLearn why this is important\nMake real progress through creativity with our free Report\n | \nView in browser\n \n \n \nThe Progress Check\n report series offers insights into some of our industry's most pressing issues – with ideas that will help your strategies align with contemporary consumer expectations. \nThe Progress Check on Sustainability\n reveals the creative companies meeting today’s urgent climate concerns. This Report will show you how to embed sustainability-first principles into your creative strategy.\n \nThe Work is your single source for inspiration – home to award-winning work, Festival Talks and industry trends you won't find anywhere else. Sign up for a \nfree account\n to access this Report and unlock more subscriber-only content that will give you the power to create better.\n \nSupport behaviour change\n \nMake sure it's a culturally sensitive and viable solution. Lay's knew that crop burning was auspicious in Indian farm culture, so they created a new design of an earthen kiln for the controlled burning of stubble. This project reduced fertilizer costs to farmers by 33% and increased their crop yield by 19%.\n \nProper planning, better buying\n \nSelect channels for your media plan that help you double down on your brand’s sustainability message. Read about how Volkswagen attracted PR and helped exceed its sales target by 9%, using paint that cleansed the air in its outdoor advertising campaigns.\n \nReframe complex messages\n \nInject creativity into comms around sustainability to make it easily understood for your audience. Instead of talking about tonnes of carbon reduced, McDonald’s reframed that information in terms of distances travelled by train.\nREAD THE REPORT\n \n \n \n \n \n \n \n \n \n \n \n \nThis email was sent to felicia@lcwmail.com. You can \nmanage your preferences\n or unsubscribe \nhere\n.\nLIONS, Ascential Events (Europe) Limited, 33 Kingsway, London WC2B 6UF\n \n© Copyright Ascential Events (Europe) Limited",
    "received_at": "2024-02-19T17:18:26+00:00",
    "sent_at": "2024-02-19T17:18:19+00:00",
    "date_extracted": "2025-04-03T20:35:58.579079"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVYb2wAAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAKNxoDczhsxHtbrbI9YdXks=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Are whistleblowers seen as heroes or snitches?",
    "body": "Plus: Modern governments, innovation teams, and Groucho Marx.\n \nFebruary 18, 2024\nView in Browser\n \n \n \n \nThe latest research and ideas from the Kellogg School of Management at Northwestern University\n \n \nHow the Railroad Laid the Tracks for Modern Government\n \nTechnologies that allowed federal officials to monitor workers from afar played a key role in the emergence of the bureaucratic state.\n \n \nAre Whistleblowers Seen as Heroes or Snitches? It Depends.\n \nReporting workplace misconduct often requires choosing between morality and loyalty. New research explores how that trade-off is viewed by others.\n \n \nWebinar\n \nThe Insightful Leader Live: Is the Future of the U.S. … Italy?\n \nJoin Nicola Persico for a complimentary webinar where he’ll offer up his home country, Italy, as a cautionary tale for the United States. \nJoin us, Thursday, February 29 at 12pm CST.\nRegister\n \n \nFrom the Archive\n \nThe Groucho Marx Theory of Efficient Markets\n \nA finance professor argues that markets remain efficient only if enough people believe they are not.\n \n \nFrom the Archive\n \nThree Steps to Help Innovation Teams Succeed at an Established Company\n \nA former Target executive shares how to move fast within organizations that are slow to evolve.\n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-18T12:04:18+00:00",
    "sent_at": "2024-02-18T12:04:12+00:00",
    "date_extracted": "2025-04-03T20:35:59.531450"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVYb2v-AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAJGaaJNTKytNnba1YDUbSdE=",
    "from": "info@e.graduatehotels.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@graduatehotels.com",
    "in_reply_to": "N/A",
    "subject": "Last call: up to 40% off",
    "body": "You don't often get email from info@e.graduatehotels.com. \nLearn why this is important\nStep on it 🚗\nView In Browser\n \n \n \n \nOffer valid at participating Graduate Hotels, for new reservations only. Offer must be mentioned at time of reservation and based on 2024 standard rates. Blackout dates may apply.\n \n \n \n \n \nUnsubscribe\n \nfrom our marketing emails.\nPrivacy Policy\n \n|\n \nTerms & Conditions",
    "received_at": "2024-02-16T15:34:28+00:00",
    "sent_at": "2024-02-16T15:34:22+00:00",
    "date_extracted": "2025-04-03T20:35:59.396779"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVXlabsAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAD0SkHO7sodOnPmFniDl4lw=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Is the Future of the U.S. … Italy?",
    "body": "Join us Thursday, February 29, at 12:00 Central, where we'll discuss U.S. and Italian economies with Nicola Persico.\n \nFebruary 15, 2024\nView in Browser\n \n \n \n \n \nThursday, February 29, 12:00 p.m.-1:00 p.m. Centra...\n \nThe Insightful Leader Live: Is the Future of the U.S. … Italy?\n \nThirty years ago, the economic fortunes of the United States and Italy looked very similar. Today, however, the United States’ per-capita GDP is more than double Italy’s. So what happened, and what can the U.S. learn from Italy’s struggles? In this free webinar, economist \nNicola Persico\n offers up his home country, Italy, as a cautionary tale for the United States. He argues that demographic changes, debt, and overregulation have led to low growth—and could do the same in America if the country doesn’t make smart policy decisions going forward.\n \nRegister\n \n \nFaculty Speaker\n \nNicola Persico\n is the John L. and Helen Kellogg Professor of Managerial Economics & Decision Sciences at Kellogg. He has received numerous honors and fellowships, including several NSF grants, and has published widely in the areas of political economy, law and economics, and labor economics. Persico was born and raised in Italy.\n \n \nFor more on Nicola Persico's research, explore some of his contributions to \nKellogg Insight\n:\n \nIn a World of Widespread Video Sharing, What’s Real and What’s Not?\nWhat Happens to Worker Productivity after a Minimum Wage Increase?\n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-15T13:22:01+00:00",
    "sent_at": "2024-02-15T13:21:54+00:00",
    "date_extracted": "2025-04-03T20:35:59.743539"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVWd3keAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQALdVGXtnW65ApGF9euRUjnk=",
    "from": "info@e.graduatehotels.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@graduatehotels.com",
    "in_reply_to": "N/A",
    "subject": "Up to 15% off tournament stays in Minneapolis 🏀",
    "body": "You don't often get email from info@e.graduatehotels.com. \nLearn why this is important\nGame on, basketball fans.\nView In Browser\n \n \n \n \n \n \n \n \n \n \n \n \nUnsubscribe\n \nfrom our marketing emails.\nPrivacy Policy\n \n|\n \nTerms & Conditions",
    "received_at": "2024-02-14T21:58:28+00:00",
    "sent_at": "2024-02-14T21:58:22+00:00",
    "date_extracted": "2025-04-03T20:36:00.094575"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVWd3kdAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAF5adsWCv6BCpVMbxOqx5x0=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Love at first cite",
    "body": "Plus: this year's best Super Bowl ads. \nLove at first cite  ·  \nView in browser\n \nThe Insightful Leader\nBY \nKELLOGG INSIGHT\nLeadership advice from the Kellogg School of Management at Northwestern University\nGood morning,\nHappy Valentine’s Day! Here at \nKellogg Insight\n, we may not have candy or roses to offer you, but we do have the next best thing: academic studies about marriage. \nAnd if this particular holiday is not your thing, never fear! We’ll also share some highlights from the \n20th annual Kellogg School Super Bowl Advertising Review\n.\nMatters of the heart\nWant to understand the science of marriage a bit better? For best results, please imagine these findings presented to you in a heart-shaped velvet box: \n1. \nPreparing to tie the knot? Consider a joint bank account. \nAmong the most important discussions newlyweds can have is whether and how to merge their finances. It can be a fraught conversation, as research shows that \nmoney is a leading cause of arguments between partners\n.\nResearch from Kellogg’s \nEli Finkel\n shows one way couples can help preserve their relationship during those critical first years of marriage: by going all in on a joint bank account.\n \nFinkel and his coauthors found that a joint bank account can help couples align their financial goals and adhere to communal norms, rather than behave in a more transactional way. If all money is everyone’s money, then partners don’t need to keep score.\n“The newlywed years are considered the ‘connubial crucible.’ That means the dynamics that couples develop in those years predict how their relationship will progress thereafter,” Finkel explains. “We wanted to take that crucial period and see if we could use bank-account structure to alter how satisfied couples are in their relationships. And we found that we could.”\n2. \nSorry, Stevie: maybe superstition \nis\n the way.\nWhen Kellogg’s \nKieu-Trang Nguyen\n got married, she and her husband didn’t consult the stars to see if they were compatible. But they have plenty of Vietnamese family and friends who did—using Tu Vi, an ancient belief system that offers individuals and couples predictions about future events, such as marriages, births, deaths, business prospects, and travels.\nAs a scholar, Nguyen wanted to know how much these beliefs really matter to couples when it comes to making marriage decisions and whether auspicious marriages fare better.\nHer recent research reveals that couples in auspicious marriages benefit in measurable ways: they earn more and have a higher standard of living, for example, and their children are less likely to drop out of school.\nWhich is not to say that the stars were necessarily right in their predictions. Nguyen says that there’s a self-fulfilling prophecy at work: when a couple’s social circle believes a marriage is auspicious, they are more likely to step in and offer help, buoying the couple through hard times.\n3. \nWhom you marry has important economic effects—beyond your own household. \nWas your spouse’s ambition something you noticed when you were dating? If so, research by Kellogg’s \nBenjamin Friedrich\n suggests you aren’t alone.\nIn particular, Friedrich and his coauthors looked at what is called educational ambition—the starting wages and wage-growth trajectories associated with various educational programs. Using administrative data from Denmark from 1980 to 2018, the researchers found that over the past forty years, couples have become more likely to self-select into marriages with partners in the same ambition category.\nThey estimated that this trend explains more than 40 percent of increasing income inequality since 1980. And the widening gap is driven partly by people in the highest ambition group, who are the most likely to marry one another—and who also earn more than they did four decades ago.\nSo when it comes to couples’—and countries’—financial outcomes, “marital sorting is becoming more and more important,” Friedrich says.\nThe Super Bowl’s superb ads\nOK, enough of the love stuff.\nFor 20 years, Kellogg’s \nDerek Rucker\n and \nTim Calkins\n have gathered students together to grade Super Bowl ads. Rather than rating them based on solely cleverness or likability—like many of us casual fans do—they use a framework developed by Rucker called \nADPLAN, which measures attention, distinction, positioning, linkage, amplification, and net equity\n. \nIn 2024, the students’ overall winner was Google Pixel for its “Javier in Frame” spot. Like the Kansas City Chiefs, Google took the crown for the second year in a row; its “Fixed on Pixel” spot was the 2023 Super Bowl Ad Review winner.\n“Google Pixel has clearly figured out the formula to success for advertising in the Super Bowl,” Rucker said after the event. “Once again the company was able to demonstrate a new technology that enhances the user experience, while also connecting with viewers in an unexpected, emotional way.” \nOther brands that earned top marks included Mountain Dew’s “Having A Blast” and Dove’s “Hard Knocks.”\nOverall, “it was a great year for advertising, and we saw very few brands miss the mark,” Calkins said. “Spots attracted attention with strong linkage, solid branding and utilized ‘celebrity wow.’” \nAnd if the two organizers had gotten a vote? In \na webinar on Monday\n, Rucker said his favorites were CeraVe and Reese’s, while Calkins gave the nod to Microsoft, Etsy, and Poppi.\nRead more about the Super Bowl Ad Review and this year’s results \nhere\n.\n“If we are intentional and more inclusive with future growth, we could all but close the wealth gap for the majority of Black Americans.”\n— Kellogg senior fellow \nDwight Hutchins\n, speaking at the Kellogg and Northwestern Mutual \nGather Against the Gap event\n, which focused on strategies to close the U.S.’s $10 trillion racial wealth gap.\nSee you next week! \nSusie Allen, senior research editor\nKellogg Insight\n  \nYou should follow us on \nTwitter\n or \nLinkedIn\n.\nAnd listen to our \npodcasts\n.\nFeedback\n  ·  \nUnsubscribe\n  ·  \nAbout Us\n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-14T12:05:04+00:00",
    "sent_at": "2024-02-14T12:04:56+00:00",
    "date_extracted": "2025-04-03T20:36:00.241532"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVWd3kcAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAOu8Wm4B5nBPrwNR5BZXEmU=",
    "from": "quarantine@messaging.microsoft.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "quarantine@messaging.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Microsoft 365 security: You have messages in quarantine",
    "body": "Review These Messages\n1 messages\n are being held for you to review as of \n2/13/2024 5:21:35 PM (UTC)\n. \nReview them within \n15 days of the received date\n by going to the \nQuarantine page\n in the Security Center. \nPrevented spam messages \nSender: \ndan.cook@cbrealty.com \n \n \nSubject: \nShoe these kids some LOVE! \n \n \nDate: \n2/13/2024 2:26:45 PM \n \n \nReview Message \nRelease \nBlock Sender \n \n \n \n \n© 2024 Microsoft Corporation. All rights reserved. \nPrivacy Statement\n \nAcceptable Use Policy\n \n((SignedCardPayload))",
    "received_at": "2024-02-13T17:42:10+00:00",
    "sent_at": "2024-02-13T17:42:07+00:00",
    "date_extracted": "2025-04-03T20:36:00.807143"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVWd3kbAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAN_-Zt5W-VJDuCB-5Z9xqlw=",
    "from": "johns@drjohnsullivan.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "johns@drjohnsullivan.com",
    "in_reply_to": "N/A",
    "subject": "Discover Exceptional Candidates – Scan Resumes For These Talent Indicators",
    "body": "You don't often get email from johns@drjohnsullivan.com. \nLearn why this is important\nMost resume scans are shallow, so they pass over factors that reveal if a candidate is exceptional.\n \n \nShare\n \n \nShare\n \n \nTweet\n \nLATEST ARTICLE\n \nDiscover Exceptional Candidates – Scan Resumes For These Talent Indicators\nMost resume scans are shallow, so they pass over factors that reveal if a candidate is exceptional. \nDescriptors \n| Recruiting/Resume screening – Talent indicators – How-to – 5 min read\nWhy Most Resume Scanning Approaches Fail To Identify Exceptional Candidates\nMost traditional resume-scanning processes come up short. They are designed primarily only to identify the job selection requirements that each candidate meets. However, in the cases where you must hire an exceptional candidate, these scans are painfully inadequate. Most of these scans literally “pass over” and fail to record the resume talent factors that indicate when a candidate is exceptional because they have Advanced Talent Capabilities (ATC). These advanced capabilities can include the ability to innovate, learn rapidly, be an early adopter of technology, and have broad industry contacts. And, of course, it is important to realize upfront. Identifying these ATC factors is critical for great hiring because having only a handful of these ATC factors will upgrade a merely qualified candidate… to an exceptional one.\nThe “Advanced Talent Capability” Indicators That You Must Identify\nDuring the decades I taught a master class in aggressive recruiting, I continually asked participating hiring managers and recruiters to look beyond the basic selection criteria for a job (i.e., job skills, experience, and credentials). And to identify the advanced capabilities that would make any new hire truly exceptional. So, I now recommend that everyone include a process for identifying them during all human and software resume scans and interviews. The highest impact ATC factors appear early in this following list.\nThey focus on their accomplishments\n – rather than only listing their duties and skills. An exceptional candidate names and then highlights each of their major accomplishments. Highlighting these accomplishments demonstrates that they are results-oriented and provide every one of their deliverables.\n An example of content to look for: \nI reached 100% of the xyz project goals, including its on-time and under-budget metrics. The director noted that it was the #1 team accomplishment all year. As a result, I was nominated for and won the Employee of the Year award!\nThey quantify their results and provide comparison numbers \n– the language of business and executives focuses on numbers and dollars. So, the best candidates use numbers throughout their resumes to quantify their major results. And to make comparisons between the accomplishments in different departments easier. They also include a dollar value estimate for each major accomplishment and a comparison number to show the extent of the change in the metric (i.e., compared to the average and the previous best and worst numbers).\n \nAn example of content to look for: \nI\n \nimplemented changes to our quality control process that resulted in a 32% increase in output quality (valued this year at $106,000). Last year’s increase in quality was only 12%, and its value was only $34,000).\nThey measure the quality of their work outputs \n– exceptional candidates show that they understand the importance of work in product quality. They do that by reporting the quality of their work immediately after they have revealed the volume of their work. \nAn example of content to look for: \nI have been consistently ranked as the high-volume producer within the division. At the same time, it maintains a .001% error rate and a 98% customer satisfaction rating.\nThey reveal the quality of the organizations they worked for in their resume \n– this may seem like a minor factor. However, the reviewer downgrades many exceptional candidates because they worked at a weak company or a mostly unknown organization. Automatically downgrading them would be a mistake if the individual worked in one of their most successful business units or teams. So, look for candidates that proactively educate the resume reader. By highlighting several indications of organizational quality (not the size) at each organization where they worked.\n An example of content to look for: \nI worked at the most innovative business unit at the start-up XYZ Technology. It was ranked #6 for product quality and innovation out of the 167 companies in our chip manufacturing industry.\nThey make it clear that they have worked with key people and the top organizations –\n because the best executives and vendors only want to work with the best. Exceptional candidates highlight the fact that they were chosen to provide input, advice, or work for your key executives. They also highlight that they were chosen to work with the best customers and external consultants.\n \nAn example of content to look for: \nI was selected by my CEO to be the only division employee who was appointed to serve on her strategic planning committee. I was also chosen to shadow the director of Google’s strategic planning during his visits to our facility. \nThey demonstrate that they are early adopters of technology\n – rather than fearing new technologies, this candidate actively embraced them. And as part of their commitment and without being told. They demonstrated that they have continually researched, benchmarked, and reported to the team what they have learned about emerging technologies in their field.\n \nAn example of content to look for: \nAs \npart of my self-directed, continuous learning on industry trends. I noticed that AI was projected to become a critical technology in our industry soon. So, I became an AI expert by first reading and then using my extensive industry contracts to benchmark our industry’s “emerging next practices” in the area of AI. As a result, my recommended AI implementation plan was accepted within six months by a unanimous vote of the team.\nThey provide a web link to their actual work –\n resume screening and interview processes both have inherent weaknesses. Because you only read/hear a candidate’s words. Even though, in many cases, the best assessment can only occur when an analyst actually reviews their work. So, you should consider it a positive factor whenever a candidate shows that they are proud of their work. By making it easy to access with hyperlinks to samples of the work and what they have written in their field. \nAn example of content to look for: \nWith the permission of my superiors, I published an online white paper covering the advantages of implementing AI in the sales function. You can gain access to it here on LinkedIn.\nThey demonstrate that they utilize data and metrics everywhere –\n Because a top growth area in most business units is to become a data-driven function. So, it makes sense for an exceptional employee to serve as a role model in developing that capability. Look for candidates that “pepper their resume” with the actual performance metrics that they used. And also to show how they have used data to support each of their important decisions. \nAn example of content to look for: \nBecause of my interest in and knowledge of metrics and data. Even though I didn’t work in recruiting, I was assigned to lead the team that was developing success metrics for that function. As a result, the team developed, tested, and implemented recruiting metrics that covered the quality of hire, time to hire, the new hire failure rate, the cost of a weak hire, and the new hire turnover rate. The head of Google recruiting even called and benchmarked against our work.\nThey demonstrated that they are a serial innovator –\n in a rapidly changing world, few outputs are more important than continuous innovation. However, realize that it is often a mistake to only search for the word innovation (because others often misuse the word). Instead, search deeper and look for the actions and behaviors that reveal that an employee is really an innovator. Those actions include developing hypotheses, benchmarking, collaborating with others, experimenting, and learning from failure. \nAn example of content to look for: \nI created an internal learning group of outside-the-box thinkers with the goal of exploring how we could increase innovation in the sales area. Within three months, the VP formally sanctioned and funded the group. Later, I was asked to successfully develop and lead two other formal innovation groups (in customer service and WFH policy).\nThey admit failure, but they learn from each other –\n Teams that operate in a high-risk environment often fail. However, rather than not mentioning the topic, most exceptional candidates are instead open about their major work failures. The employee has used them as an opportunity to learn and improve. \nAn example of content to look for: \n \nOur DEI team developed a new diversity training class for managers. Unfortunately, the reviews of the new class were embarrassing. But rather than waiting, I took ownership of the problem. And I subsequently collaborated with our engineering function’s failure analysis team. And with their help, we identified the 2 root causes and the 6 critical success factors. In this case, we found that the #1 critical success factor always involved “the customer” in the design and the final testing of all new classes.\nThe candidate is on the leading edge in their profession \n– exceptional new hires usually require little formal training because they pride themselves on being self-directed, continuous learners. One of the ways that you can determine if a candidate is on the leading edge of knowledge in their field and business is by using industry buzzwords throughout their resume and during their interviews. \nWhat to look for:\n To stay ahead of our industry developments. I completed an online course covering industry trends. In it, I learned about currently hot and emerging subject areas. Including AI, Quantum Computing, Salesforce, Python, overhiring, blockchain, ESG and online team communications platforms\nThey take ownership of problems before others\n – all good employees accept accountability for their area. However, exceptional employees go further and “accept the ownership” of problems no one seems to own. This willingness to act proactively obviously helps to accelerate the team’s overall problem-solving effort. \nAn example of content to look for: \nI noticed that no one within our team seemed to be addressing our falling customer service scores. So, with my leader’s permission, I alerted everyone that I was accepting ownership, which involved researching the problem and seeking their input on a solution. Within three months, our team leader thanked me for returning our customer service scores to normal.\nThey have business acumen\n – no matter how strong a candidate is in their functional area. It is a fact that they will be able to provide much more additional value. If they are also strong in each of the important functional business areas. So, look for evidence that the candidate also has knowledge and experience in the business competencies. Customer service, selling, goal setting, leadership, metrics, finance, and problem identification. \nAn example of content to look for: \nEven though I was the youngest store employee, the store manager trusted me. She gave me the financial responsibility for store closing and the end-of-the-day cash reconciliation. During my tenure, we had only one day when, initially, the cash and the receipts were more than $10 out of balance.\nThe candidate will soon be promotable\n – the most desirable candidates are often those who will soon qualify for a promotion. So, when you are assessing a promising candidate, make a rough estimate of how long (minimum and maximum) it will likely be until they are promotable. This assessment of their \nlikely career trajectory\n after they join your company will help to ensure that you will have a sufficient number of future leaders. \nAn example of content to look for:\n Have the resume review check their resume to determine if the candidate currently meets over 60% of the promotion requirements for their next level of job. If so, designate them as an exceptional candidate. \nTheir resume includes powerful quotes\n – resume screeners should be aware. Exceptional employees are constantly “talked about” by executives, customers, and managers. As a result, they have received many positive quotes about their capabilities and accomplishments. So, you should expect exceptional candidates to repeat some of those positive quotes in their resumes and during their interviews.\n An example of content to look for:\n \nThe owner said he was completely impressed with my work at his gas station. “That he would fully pay for my college education” (And he did).\nAdditional Indicators Of Candidate Excellence\nOf course, every organization has to identify its own set of ATCs that make a candidate exceptional. So, in addition to the above list, I have provided some slightly less impactful talent capabilities in this section. It may also indicate that you have an exceptional candidate.\n \nThey are proactive\nThey have a global perspective\nThey quickly adapt to major changes\nThey are a problem solver\nThey are self-motivated\nThey move fast\nThey work effectively in a diverse team\nThey are consistently highly rated and ranked\nThey are an influencer\nThey make others around them better\n—————————————-\nNote: When updating your own resume.\nMake sure that each of the advanced talent capabilities that you have\nare included and easy to find in a quick scan.\nIf you only do one thing \n– From a recent key position opening, identify your preferred top seven capabilities from the Advanced Talent Capabilities list in this article. Next, capture the resume of a recent new hire in that job. One that you have already determined to be an exceptional employee. Thoroughly scan their resume to determine how many of your seven chosen capabilities were covered in that exceptional employee’s resume. Next, do the same resume scan on an average candidate for the same job. Finally, compare the difference between the number of ATCs identified in each resume. These results should reinforce your inclination to develop a formal resume-scanning process that will more accurately identify exceptional candidates in the future. \nFinal Thoughts\nUnfortunately, it is fairly common for resume reviewers to rely on their subjective judgment to decide when a candidate should be rated as exceptional. This “soft approach” often results in fewer candidates being designated as exceptional. So, instead, what is needed is a more systematic and objective approach that first identifies each of the important Advanced Talent Capabilities that are relevant to this job. Then, it develops a mandatory process for systematically and thoroughly scanning the resume for all indications of these capabilities.\nAuthor’s Note\nPlease spread these ideas\n by sharing this article with your team/network\n and by posting it on your favorite media. \nAlso, join the well over 20,000+ that follow or have connected with Dr. Sullivan’s community on \nLinkedIn\n.\nAnd, if you don’t already subscribe to Dr. Sullivan’s Aggressive Talent Management articles, you can do that \nhere\n.\nMOST RECENT ARTICLES\nDiscover Exceptional Candidates – Scan Resumes For These Talent Indicators\nCompetitive Retaliation – When They Recruit Your Talent… Strike Back Hard! (To boost your employee retention)\nA Fresh Eyes Review… The Key To Getting Any Business Proposal Approved (And a Promotion)\n8 Ugly Numbers… That Highlight HR’s Failures\nRESOURCES\n \nStay Interviews and Other Powerful Retention Tools\nIn this brand new eBook, learn how to implement Stay Interviews, the highest ROI activity that any manager can utilize which has been proven effective in keeping top performers.\nPURCHASE HERE\n \n \nOnboarding & Orientation Toolkit\nHave you been frustrated that it takes new hires/transfers longer than it should to get up-to-speed and become productive faster? If so, then this Guide is the essential must-have, must-read, must-do resource for you!\nPURCHASE HERE\n \nIf my article stimulated your thinking and provided you with actionable tips, please follow or connect with me.\n \n \n \n \n \nPROFESSOR, SPEAKER, ADVISOR, AUTHOR\nDr. Sullivan has written over 1300 articles and a dozen white papers, conducted over 50 different webinars, and dozens of workshops. He is an engaging corporate speaker who has excited audiences at over 300 corporations/organizations in 30 countries on six continents.\nDr. John Sullivan is a noted author, speaker, and educator. He leverages his 30+ years of guidance to Fortune 500 and Global 1000 firms.\nIf you need advice or a speaker, contact us at john@drjohnsullivan.com \nCopyright © 2024 \nDr John Sullivan\n, All rights reserved.\nYou are receiving this email because you opted in for updates on DrJohnSullivan.com\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-02-13T15:02:42+00:00",
    "sent_at": "2024-02-13T15:01:39+00:00",
    "date_extracted": "2025-04-03T20:36:00.825512"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVWd3kaAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAAr0Apudt9ZKq0N8wfgoybA=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "THIS WEEK: Making Sense of America’s Prescription Drug Market",
    "body": "Join us this Thursday, February 15, at 12:00 Central, for a discussion on healthcare with Amanda Starc\n \nFebruary 13, 2024\nView in Browser\n \n \n \n \n \nThursday, February 15, 12:00 p.m.-1:00 p.m. Centra...\n \nThe Insightful Leader Live: Making Sense of America’s Prescription Drug Market\n \nWhy is the American prescription drug market so … confusing? Americans pay a lot for drugs, both individually and collectively. Yet medically necessary drugs remain out of reach for many patients, and critical medications always seem to be in short supply. Meanwhile, Florida is keen to import drugs from Canada. Is something about America’s pharmaceutical market broken? In this webinar, healthcare economist \nAmanda Starc\n will answer your questions about all things prescription drugs. She’ll also offer her take on how to build a healthier market.\n \nRegister\n \n \nFaculty Speaker\n \nAmanda Starc\n is an Associate Professor of Strategy at the Kellogg School of Management and a Faculty Research Fellow at the National Bureau of Economic Research. Dr. Starc's research interests include industrial organization and health economics. Her research examines the Medicare Advantage, Medicare Part D, and Medicare Supplement (\"Medigap\") markets, as well as consumer behavior in insurance exchanges.\n \n \nFor more on Amanda Starc's research, explore some of her contributions to \nKellogg Insight\n:\n \nCan We Build a Better Prescription Drug Market?\nConsumers Lose Out When Health Insurers Offer Lots of Plans\n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-13T14:06:32+00:00",
    "sent_at": "2024-02-13T14:06:19+00:00",
    "date_extracted": "2025-04-03T20:36:01.336296"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVVtEdiAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAE-2RYqbdBpGrURwVclOhUY=",
    "from": "info@sietarusa.org",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@sietarusa.org",
    "in_reply_to": "N/A",
    "subject": "The SIETAR USA 2024 Conference  is Coming Up Fast!",
    "body": "...It's closer than you think! ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌\n \n \nView in Web Browser\n \n \n \n \n \n \n \n \n \n \n \n \n The \nSIETAR USA 2024 Virtual Conference\n \nis in less than 2 weeks!\nFebruary 22 - 24, 2024\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDive In and Sign Up TODAY!\n \n \n \n \n \n \nWhat's stopping you? Just click the 'Register NOW' button below to sign up (ticket options are listed down the right-hand side of the page), and then check out the conference agenda and get your profile ready.\nWe hope to \"see\" you there!\nYour SIETAR USA Conference Team\n \n \n \n \n \n \n \n \nRegister NOW \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUnsubscribe\n | Sent by SIETAR USA \n4880 Lower Roswell Rd, Suite 165 • Marietta , GA • 30068",
    "received_at": "2024-02-12T22:31:26+00:00",
    "sent_at": "2024-02-12T22:31:16+00:00",
    "date_extracted": "2025-04-03T20:36:01.792780"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVUzt4UAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAOeQCELl2JRHshMoKQhN54Q=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Are your ads worth it? Here’s how to tell.",
    "body": "Plus: Celebrity brands, socially responsible companies, and team success.\n \nFebruary 11, 2024\nView in Browser\n \n \n \n \nThe latest research and ideas from the Kellogg School of Management at Northwestern University\n \n \nHere’s a Cost-Effective Way to Tell If Your Digital Ads Are Working\n \nRunning even a small number of experiments can reveal a lot, a new study finds.\n \n \nPodcast: The Complicated Promise of ESG\n \nOn this episode of The Insightful Leader: Are companies as socially responsible as they claim? And how much should investors care?\n \n \nWebinar\n \nThe Insightful Leader Live: Making Sense of America’s Prescription Drug Market\n \nIn this complimentary webinar, Amanda Starc will answer your questions about the economics of the prescription drug market, and offer her take on how to build a healthier one. \nJoin us, Thursday, February 15 at 12pm CST.\nRegister\n \n \n \n \n \nNew - The Insightful Leader Live: Is the Future of the U.S. … Italy?\n \nKellogg’s Nicola Persico offers up his home country, Italy, as a cautionary tale for the United States. Join us, Thursday, February 29 at 12pm CST.\nRegister\n \n \nFrom the Archive\n \nCould Aligning with a Star Help Your Brand?\n \nCelebrity brands are on the rise. Here’s what to know before you pursue a famous business partner.\n \nFrom the Archive\n \nFor Teams, What Matters More: Raw Talent or a History of Success Together?\n \nA study of professional sports teams suggests that one factor is clearly more important, but the best teams combine them both.\n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-11T12:03:51+00:00",
    "sent_at": "2024-02-11T12:03:45+00:00",
    "date_extracted": "2025-04-03T20:36:01.516548"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVRrgnOAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAC5lrfTbmohFmFyKvpWK8Zo=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Skip the script—but don’t wing it either",
    "body": "Plus: AI in medicine and supply-chain ESG risks. \nSkip the script—but don’t wing it either  ·  \nView in browser\n \nThe Insightful Leader\nBY \nKELLOGG INSIGHT\nLeadership advice from the Kellogg School of Management at Northwestern University\nGood morning,\nWhat’s the best presentation you’ve ever seen at work? Chances are, you remember it less because of the information it contained and more because of how that information was conveyed. \n“To be successful, it’s simply not enough to have brilliant ideas. You must also be able to communicate your ideas clearly and concisely in order to persuade investors, stakeholders, and clients,” says \nMichael Foley\n, a clinical assistant professor of leadership and communication at the Kellogg School.\nThis week, we’ll offer some of Foley’s tips for honing your message and connecting with your audience. We’ll also share some research from \nMatt Groh\n, an assistant professor of management and organizations, on the use of AI in medicine.\nA balancing act\nMost speakers are either scripters or wingers, says Foley. Scripters stick closely to their talking points; wingers just, well, tend to wing it. Which method is more effective? According to Foley, neither. The sweet spot is in the middle.\n \nLeaders should aim for what Foley calls “structured improvisation,” where you prepare your key talking points while giving yourself the freedom to express yourself in a natural and conversational manner.\n“The structure shows the audience that you’ve done your due diligence and that you’re going to be crisp, clear, and on point,” Foley says. “It also shows you know where they’re coming from, you’ve anticipated some of their questions already, and you’ve woven them into your content.”\nWhen you master this technique, you can jot down notes on a napkin and talk effortlessly for twenty minutes or more, he says.\nSpeakers should also aim to strike a balance between objective and subjective evidence. Objective evidence—data, statistics, charts—helps you establish context and build a case, especially with technical audiences. Subjective evidence is best used to illustrate a point, such as relating a testimonial to demonstrate client impact.\nKnowing your audience can help you determine how much of each type of evidence you cite. For example, stories work well in business presentations or investment pitches, but might not resonate with analytical audiences such as engineers, PhD researchers, and accountants.\nYou can read the rest of Foley’s recommendations in \nKellogg Insight\n.\nWhat AI can—and can’t—do for medical diagnosis\nLike many fields, medicine is still figuring out how it will make the most effective use of artificial intelligence. While robots are unlikely to replace doctors anytime soon, it’s easy to imagine a future in which the two work together. These physician–machine partnerships hold particular promise for dermatology, a specialty in which diagnosis often comes down to recognizing the visual characteristics of a disease—something that deep-learning systems (DLSs) can be trained to do with great precision. \nThere’s even hope that machine learning could help address a known problem in the field: only 10 percent of images in dermatology textbooks depict patients with darker skin, meaning that physicians may be unfamiliar with the different ways diseases can present across skin tones.\nIn new research, Groh put the issue of machine-aided dermatology to the test by seeing how suggestions from deep-learning systems affected physicians’ photo-based diagnoses. \nThe results were mixed. Assistance from even an imperfect deep-learning system increased dermatologists’ and general practitioners’ diagnostic accuracy—but among general practitioners, the DLS exacerbated disparities in accuracy across light and dark skin. In other words, generalists supported by AI got much better at making correct diagnoses in light skin but only slightly better in darker skin.\nThe findings suggest that the best AI-supported dermatology might look different from how we currently imagine it—and that DLSs and doctors are more powerful together than they are alone. “It’s all about augmenting humans,” Groh says. “We’re not trying to automate anyone away. We’re actually trying to understand how augmentation might work, when and where it will be useful, and how we should appropriately design augmentation.”\nYou can read more about the research in \nKellogg Insight\n.\n“What my research tries to highlight is that there are certain ESG factors and signals that can be taken advantage of from an investor’s perspective.”\n— Assistant professor of accounting \nAaron Yoon\n, in \nKellogg Insight\n, on the link between supply-chain ESG risks and stock prices.\nSee you next week!\nSusie Allen, senior research editor\nKellogg Insight\n  \nYou should follow us on \nTwitter\n or \nLinkedIn\n.\nAnd listen to our \npodcasts\n.\nFeedback\n  ·  \nUnsubscribe\n  ·  \nAbout Us\n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-07T12:05:47+00:00",
    "sent_at": "2024-02-07T12:05:41+00:00",
    "date_extracted": "2025-04-03T20:36:02.696951"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVQ2KRwAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAOkbLYllBlhEnlyyLhLjVfw=",
    "from": "info@e.graduatehotels.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@graduatehotels.com",
    "in_reply_to": "N/A",
    "subject": "Cue the college tours with up to 40% off at Graduate Hotels",
    "body": "You don't often get email from info@e.graduatehotels.com. \nLearn why this is important\nWe call shotgun!\nView In Browser\n \n \n \n \nOffer valid at participating Graduate Hotels, for new reservations only. Offer must be mentioned at time of reservation and based on 2024 standard rates. Blackout dates may apply.\n \n \n \n \n \nUnsubscribe\n \nfrom our marketing emails.\nPrivacy Policy\n \n|\n \nTerms & Conditions",
    "received_at": "2024-02-05T22:17:51+00:00",
    "sent_at": "2024-02-05T22:17:43+00:00",
    "date_extracted": "2025-04-03T20:36:02.701636"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVQ2KRvAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQABMGeyn42CRIqBaGCDs8diE=",
    "from": "info@sietarusa.org",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@sietarusa.org",
    "in_reply_to": "N/A",
    "subject": "SIETAR USA 2024 Conference Coming Up Fast!",
    "body": "Join us for this virtual event! ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌\n \n \nView in Web Browser\n \n \n \n \n \n \n \n \n \n \n \n \n The \nSIETAR USA 2024 Virtual Conference\n \nis just over 2 weeks away!\nFebruary 22 - 24, 2024\n \n \n \n \n \nHave YOU registered yet? Attending this year's conference will bring you knowledge, connections, and inspiration - all of which will have a positive impact on your job performance, business growth, and your professional path. And we can ALL always afford to learn more! \n \n \n \n \n \n \nSign Up TODAY!\n \n \n \n \n \n \nJust click the 'Register NOW' button below to sign up (ticket options are listed down the right-hand side of the page), and then check out the conference agenda and get your profile ready.\nWe hope to \"see\" you there!\nYour SIETAR USA Conference Team\n \n \n \n \n \n \n \n \nRegister NOW \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUnsubscribe\n | Sent by SIETAR USA \n4880 Lower Roswell Rd, Suite 165 • Marietta , GA • 30068",
    "received_at": "2024-02-05T21:01:20+00:00",
    "sent_at": "2024-02-05T21:00:39+00:00",
    "date_extracted": "2025-04-03T20:36:02.666532"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVQixoTAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAB14WCKqKoxJm9FRk1znjKo=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "The price of remote collaboration",
    "body": "Plus: Small businesses, working parents, and “deepfakes.”\n \nFebruary 04, 2024\nView in Browser\n \n \n \n \nThe latest research and ideas from the Kellogg School of Management at Northwestern University\n \n \nCould Remote Work Hurt On-the-Job Learning?\n \nWe are more likely to learn from our collaborators when we are in close proximity to them, a new study finds.\n \n \nTake 5: What Does It Take to Make a Small Business Work?\n \nThe challenges are big. So are the opportunities.\n \n \nWebinar\n \nThe Insightful Leader Live: Making Sense of America’s Prescription Drug Market\n \nIn this complimentary webinar, Amanda Starc will answer your questions about the economics of the prescription drug market, and offer her take on how to build a healthier one. \nJoin us, Thursday, February 15 at 12pm CST.\nRegister\n \n \n \nFrom the Archive\n \nWorking Parents Feel Pulled in Two Directions. What Does This Mean for Companies?\n \nA look at what happens when parental and professional identities collide.\n \nFrom the Archive\n \nIn a World of Widespread Video Sharing, What’s Real and What’s Not?\n \nA discussion with a video-authentication expert on what it takes to unearth “deepfakes.”\n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-04T12:04:47+00:00",
    "sent_at": "2024-02-04T12:04:42+00:00",
    "date_extracted": "2025-04-03T20:36:24.425956"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVOuZpfAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAEmM0KZIqHBHrmDC5nHGkSA=",
    "from": "noreply@godfreyhotelchicago.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "d4fn47c4944814bv47u46x4bg4ab4b848t4d346b00@u.zmaildirect.com",
    "in_reply_to": "N/A",
    "subject": "February News",
    "body": "You don't often get email from noreply@godfreyhotelchicago.com. \nLearn why this is important\nCelebrating a Decade of Memories! \n \n \n \nFEB 2024\n \nThis month marks our 10 Year Anniversary in Chicago! Join us in celebrating a remarkable milestone with a nostalgic twist. In honor of this special occasion, we're thrilled to present our \n$79 Decade Flashback Rate\n, transporting you to the charm of the past with great savings!\nBOOK NOW\nWin a $10 Stay\nTEN DAYS, TEN LUCKY WINNERS\n \nTo keep the celebrations going, we're giving away ten, $10 overnight stays! Enter to win our Instagram giveaway by liking the post, following the \n@godfreyhotelchicago\n and \n@iogodfrey\n, tagging your travel buddy, and sharing our post on your story. One winner will be selected daily beginning February 2 through February 11, 2024.\nENTER TO WIN\nWin an Igloo Experience!\nTEN DAYS, TEN LUCKY WINNERS\n \nAre you noticing a theme? It's all about 10! I|O Godfrey is hosting \n\"Ten Days of Igloo Giveaways\"\n starting February 1, 2024. Enter to win an enchanting igloo outing for up to six people, complete with a $500 food and beverage credit. It's our way of saying thank you for a decade of unforgettable memories!\nENTER TO WIN\n \n$10 HAPPY HOUR\nTuesday-Friday at I|O Godfrey\nIn honor of our 10 year anniversary, all items on our Happy Hour menu are $10 for the entire month of February. Available Tues-Thur: 2pm-5pm; Fri: 12pm-3pm.\nVIEW THE MENU \n \n$10 I|O COSMO + PROSECCO\nAvailable for the month of February\nToast to ten incredible years with us! For the month of February, savor our celebratory $10 I|O Cosmo and Prosecco specials. R\naise a glass to a decade of excellence!\nRESERVE A TABLE \n10pm Toast to Ten Years!\nI|O GODFREY ROOFSCAPE\n \nEvery Friday & Saturday during February\nAt 10:00 p.m. every Friday and Saturday during February, enjoy a complimentary glass of bubbles to celebrate the last decade!\nThe fun pops off Friday, February 2, 2024.\nMAKE A RESERVATION\n \nTAKE A LOOK AT OUR OTHER LOCATIONS\n \nTHE GODFREY HOTEL HOLLYWOOD\n \nTHE GODFREY HOTEL BOSTON\n \nTHE GODFREY HOTEL DETROIT\n \nNEED TO RESCHEDULE?\nWe are amending our standard cancellation policy for the time being. You can reschedule or cancel your stay if booked direct up to 24 hours prior. Please contact us at (312) 649-2000 or \nFrontDesk@godfreyhotelchicago.com\n for more information.\n \n \n1\n27 West Huron at LaSalle, Chicago, IL 60654\nMain Line: \n(312) 649-2000\nFrontDesk@godfreyhotelchicago.com\n \n \n \n \n \nView in browser\n | \nUnsubscribe",
    "received_at": "2024-02-01T17:40:44+00:00",
    "sent_at": "2024-02-01T17:40:38+00:00",
    "date_extracted": "2025-04-03T20:36:03.728726"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVOuZpeAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAPtkUizsCsZBnxrW3-1k9Wc=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Making Sense of America’s Prescription Drug Market",
    "body": "Join us Thursday, February 15, at 12:00 Central, where we'll discuss healthcare with Amanda Starc\n \nFebruary 01, 2024\nView in Browser\n \n \n \n \n \nThursday, February 15, 12:00 p.m.-1:00 p.m. Centra...\n \nThe Insightful Leader Live: Making Sense of America’s Prescription Drug Market\n \nWhy is the American prescription drug market so … confusing? Americans pay a lot for drugs, both individually and collectively. Yet medically necessary drugs remain out of reach for many patients, and critical medications always seem to be in short supply. Meanwhile, Florida is keen to import drugs from Canada. Is something about America’s pharmaceutical market broken? In this webinar, healthcare economist \nAmanda Starc\n will answer your questions about all things prescription drugs. She’ll also offer her take on how to build a healthier market.\n \nRegister\n \n \nFaculty Speaker\n \nAmanda Starc\n is an Associate Professor of Strategy at the Kellogg School of Management and a Faculty Research Fellow at the National Bureau of Economic Research. Dr. Starc's research interests include industrial organization and health economics. Her research examines the Medicare Advantage, Medicare Part D, and Medicare Supplement (\"Medigap\") markets, as well as consumer behavior in insurance exchanges.\n \n \nFor more on Amanda Starc's research, explore some of her contributions to \nKellogg Insight\n:\n \nCan We Build a Better Prescription Drug Market?\nConsumers Lose Out When Health Insurers Offer Lots of Plans\n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-02-01T16:05:03+00:00",
    "sent_at": "2024-02-01T16:04:56+00:00",
    "date_extracted": "2025-04-03T20:36:03.413368"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVNIrXiAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAHhGby1H4XRArMUzdd_HIi0=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Scared of AI? Here’s an optimistic take.",
    "body": "Plus: middle managers and over-the-counter markets. \nScared of AI? Here’s an optimistic take.  ·  \nView in browser\n \nThe Insightful Leader\nBY \nKELLOGG INSIGHT\nLeadership advice from the Kellogg School of Management at Northwestern University\nGood morning,\nQuick: guess how many of the 270 jobs listed in the 1950 census have since been eliminated by automation. Are you thinking a quarter? A third?\n“Just one,” says Kellogg’s \nHatim Rahman\n, an assistant professor of management and organizations. “And in case you are wondering, \nthat job was an elevator operator\n.”\nIt’s a statistic that he wants us to keep in mind as we ponder the future of work—and specifically, the “fear that AI is going to suddenly lead to mass unemployment.” Rahman spoke about how AI will affect our careers, and our society, on a recent \nThe Insightful Leader Live\n webinar. Today, we’ll share some highlights from that discussion.\nChange happens more slowly than we think\nIf worries about AI decimating the labor force and taking away your livelihood have been keeping you up at night, Rahman has some words of reassurance: “Decades of research shows that fear is unfounded.”\n \nAs much as it \nfeels like\n technology is advancing so rapidly that we can barely keep up, it takes much longer for those advances to fully embed themselves in society. This will be true of AI, too. “It’s going to take a long time for it to penetrate an industry, especially in ways that will affect your career,” says Rahman.\nThis may be cold comfort to individual illustrators, translators, and journalists who have already \nlost some work to generative AI\n. But zoom out a bit, and it’s clear that while these professions are the first to be affected by the technology, they are nowhere near obsolete. Instead, they are changing, as AI is gradually incorporated into various work streams and new infrastructure emerges to support it. “The more complex the technology, the more technical, human, and monetary resources are needed to develop, integrate, and maintain [the] technology,” says Rahman.\nHow we use AI is up to us\nBy now you’ve surely heard the argument that AI is neither good nor bad, but simply a tool. Much will depend, then, upon how we choose to deploy it. And, Rahman says, there is time for us to make this choice collectively and deliberately.\nWe can choose to use AI to replace as many workers as possible—or we can instead choose to use AI to bolster talent and identify it in underrecognized places. We can choose to let machines make the bulk of the decisions around our healthcare, education, and defense—or we can choose to keep humans at the helm, ensuring that human values and priorities rule the day.\nAnd it’s not pollyannaish to think we’ll actually have a choice. There are already areas where we’ve opted to prioritize human involvement. Take aviation. Despite estimates that more than 90 percent of a pilot’s responsibilities can be automated, our society has still decided to put well-trained pilots, capable of flying manually, in the cockpit in case things go awry.\nAutomation has worked out pretty well for pilots, says Rahman. “In fact, in aggregate, \nthe number of pilots and their pay has increased for years\n.”\nTo learn more about how AI will reshape our world, \nyou can read more in \nKellogg Insight\n.\nTalking Point\nTo sell an asset for the highest price, you generally want to solicit offers from as many buyers as possible. The same goes for purchasing: the more potential sellers you approach, the better the deal you’ll probably get. The benefits of competition are, after all, a cornerstone of economics. But in over-the-counter (OTC) markets—or networks for trading securities not listed on formalized exchanges—investors have historically sought few counterparties, something researchers have struggled to explain. A new study finds that OTC investors are motivated by concerns about front-running—that is, when counterparties know what move an investor plans to make, they can take steps to raise or lower the price of that asset. Contacting few counterparties, the research shows, protects against this problem. \nRead more in \nKellogg Insight\n.\n“How do we let people go home from work at a reasonable time, disconnect at a reasonable time, not burden them with emails on the weekends, on vacations, after hours?”\n— Professor of management and organizations \nAdam Waytz\n, on \nMarketplace\n, on the plight of middle managers and the importance of letting them unplug.\nSee you next week!\nSusie Allen, senior research editor\nKellogg Insight\n  \nYou should follow us on \nTwitter\n or \nLinkedIn\n.\nAnd listen to our \npodcasts\n.\nFeedback\n  ·  \nUnsubscribe\n  ·  \nAbout Us\n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-31T12:06:19+00:00",
    "sent_at": "2024-01-31T12:06:12+00:00",
    "date_extracted": "2025-04-03T20:36:04.801211"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVMTZGXAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAIh9noV9MPFAlW0AG_FVTWE=",
    "from": "info@e.graduateminneapolis.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@graduateminneapolis.com",
    "in_reply_to": "N/A",
    "subject": "Book now for college football 2024",
    "body": "Score your gameday stays early.\nView In Browser\n \n \nQUESTIONS?\nPlease give us a call at 651-422-8994.\n \nSelect reservation dates are subject to a minimum stay requirement, please see website for details.\n \n \nGraduate Minneapolis\n615 Washington Ave SE\nMinneapolis, MN 55414\n612 379 8888\n \n \n \nUnsubscribe\n \nfrom our marketing emails.\nPrivacy Policy\n \n|\n \nTerms & Conditions",
    "received_at": "2024-01-29T16:10:49+00:00",
    "sent_at": "2024-01-29T16:10:16+00:00",
    "date_extracted": "2025-04-03T20:36:04.432096"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVLwXY9AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAFaKJIEaaFtKhWyhYuDQ338=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "What’s lurking in your supply chain?",
    "body": "Plus: AI, career complacency, and housing costs.\n \nJanuary 28, 2024\nView in Browser\n \n \n \n \nThe latest research and ideas from the Kellogg School of Management at Northwestern University\n \n \nHow Will AI Reshape Our World? It’s Really Up to Us.\n \nWe need to be proactive to ensure AI supports—rather than supplants—human priorities.\n \n \nESG Risks Can Lurk in Supply Chains, Too\n \nMost companies know little of their suppliers’ ESG practices. But negative incidents can sway stock prices—and investors should take note.\n \n \nWebinar\n \nThe Insightful Leader Live: Making Sense of America’s Prescription Drug Market\n \nIn this complimentary webinar, Amanda Starc will answer your questions about all things prescription drugs, and offer her take on how to build a healthier market. \nJoin us, Thursday, February 15 at 12pm CST.\nRegister\n \n \n \nFrom the Archive\n \nDon’t Let Complacency Derail Your Career\n \nHow to hone your learning agility and take good risks.\n \nFrom the Archive\n \nWould Housing Cost Less If It Were Easier to Build New Homes? Surprisingly, Not Much.\n \nA study suggests that supply and demand are only part of a complex problem.\n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-28T12:05:53+00:00",
    "sent_at": "2024-01-28T12:05:07+00:00",
    "date_extracted": "2025-04-03T20:36:05.138454"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVHY7UmAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQACklqtCcWktFj-FNrGsytv0=",
    "from": "sales@godfreyhotelchicago.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "sales@godfreyhotelchicago.com",
    "in_reply_to": "N/A",
    "subject": "Exclusive Winter Savings at The Godfrey Hotel Chicago",
    "body": "You don't often get email from sales@godfreyhotelchicago.com. \nLearn why this is important\nReset, rejuvenate, and revel in the beauty of winter. \n \n \n \nWINTER\n \nWINTER SAVINGS\nReset. Recharge. Rejuvenate.\nAs we welcome the fresh beginnings of 2024, we are excited to offer you an exclusive opportunity to reset, rejuvenate, and revel in the beauty of winter.\n✨ Enjoy 15% Off Your Stay ✨\nBook Dates: Now through February 29, 2024\nStay Dates: Now until March 31, 2024\n*Terms and conditions apply. Rates are subject to availability. Blackout dates may apply.\nBOOK NOW\n \nUpgrade Your Stay\nMAXIMIZE THE RELAXATION\n \nSPA TREATMENTS\nSpa Boutique by Windy City Massage offers a range of treatments designed to soothe your senses and rejuvenate your body.\nLEARN MORE \n \nPAMPERING PACKAGE\nUnwind and refresh with beautiful botanicals and sweet convections included in our Partners Pampering Package.\nLEARN MORE \nAlcohol-free Cocktails\nCELEBRATE DRY JANUARY AT I|O GODFREY\n \nAre you embracing an alcohol-free start to the year? Try our specially curated mocktails at I|O Godfrey. It's the perfect way to toast to your health and happiness in 2024!\nMINT TO BE\n: Customize your drink by choosing from peach, strawberry, raspberry açaí, lavender, or cucumber. This mocktail is beautifully balanced with muddled mint, fresh lime, lemon, and topped with Topo Chico, creating a burst of freshness with every sip.\nPEACH OUT\n: Dive into the refreshing blend of blueberry, yucca peach tea, muddled agave, and rosemary, topped with club soda and chia seeds. A perfect blend to rejuvenate your senses.\nMAKE A RESERVATION\n \nBOOK AN IGLOO\nTuesday-Sunday at I|O Godfrey\nEach igloo becomes your private universe, where fun moments are shared over cocktails and bites under a sparkling sky.\nBOOK AN IGLOO \n \nHAPPY HOUR\nTue-Thu: 2-5pm | Fri: 12-3pm\nUnwind after work with great deals on bites, like our Wagyu sliders. Plus discounted cocktails and wine!\nVIEW THE MENU \n \nTAKE A LOOK AT OUR OTHER LOCATIONS\n \nTHE GODFREY HOTEL HOLLYWOOD\n \nTHE GODFREY HOTEL BOSTON\n \nTHE GODFREY HOTEL DETROIT\n \nNEED TO RESCHEDULE?\nWe are amending our standard cancellation policy for the time being. You can reschedule or cancel your stay if booked direct up to 24 hours prior. Please contact us at (312) 649-2000 or \nFrontDesk@godfreyhotelchicago.com\n for more information.\n \n \n1\n27 West Huron at LaSalle, Chicago, IL 60654\nMain Line: \n(312) 649-2000\nFrontDesk@godfreyhotelchicago.com\n \n \n \n \n \nView in browser\n | \nUnsubscribe",
    "received_at": "2024-01-25T00:36:52+00:00",
    "sent_at": "2024-01-25T00:36:44+00:00",
    "date_extracted": "2025-04-03T20:36:05.524189"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVHY7UlAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAEMc7ScSyX1OnwUsB2x29xE=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Be yourself! No, not like that.",
    "body": "Plus: global cities and AI's effects on the labor market. \nBe yourself! No, not like that.  ·  \nView in browser\n \nThe Insightful Leader\nBY \nKELLOGG INSIGHT\nLeadership advice from the Kellogg School of Management at Northwestern University\nGood morning,\nEarly in her career, \nEllen Taaffe\n got some advice she didn’t like. Taaffe, who enjoys wearing bright colors, was told by her boss that her red blazers were making her stand out in the wrong way. She should wear a navy blazer, like the rest of her team.\nTaaffe, a clinical associate professor of management and organizations and author of the recent book \nThe Mirrored Door\n, has subsequently thought a lot about how we present ourselves at work. But at the time of the red blazer showdown, she didn’t know what to think or do. Should she wear the clothes that felt right to her—or accept this as one of those parts of herself that she doesn’t bring to the office? \nToday, we’ll delve into the thorny issue of personal authenticity in the workplace. We’ll also discuss what happens when wealthy foreigners move to popular global cities.\nHow should you present yourself at work?\nIn the end, Taaffe didn’t ditch her red blazers. And in \na recent episode of The Insightful Leader podcast\n, she explained that she’s glad she stuck to her guns. It made room for other people to shed the unofficial navy blue uniform, too. “So I think that was helpful,” she said.\n \nThere’s been a lot of discussion in recent years about the importance of being able to bring our whole selves to work. There are a lot of good reasons for this, particularly when it comes to creating a workplace that feels inclusive to people who haven’t always been included.\nBut it’s also important to acknowledge that, fair or not, how we show up at work could affect how we are treated. \nFor instance, wearing pajamas at work probably doesn’t send the right message about your level of professionalism or how much you respect the people around you. But dressing too fancily can backfire, too. Take this research from \nDerek Rucker\n, a professor of marketing, who has researched how people react to luxury brands. In one study, he found that mentioning high-status items can hurt job candidates applying for positions that require a lot of personal warmth (for example, human resources).\nRucker says he thinks about how he dresses more than he used to “because I realized there may be unintended signals that I send,” he said. “And so I don’t obsess about it to the point where it’s like, let me think about every single item every single day. … But if I’m meeting new people, I think a little more about what I will wear and how I present myself.”\nSo, how do you decide when it’s worth it to present yourself as you truly are—and when not to? And how can managers create an environment where people feel safe to be themselves in the right ways? For more on how to thread these needles, \nyou can listen to the whole episode\n.\nTalking Point\nWho among us hasn’t dreamed—even just in passing—about starting life afresh in some far-flung place? In recent decades, the decreased cost of air travel and the rise of remote work have made that dream a reality for some. Popular global cities, including Paris and Venice, have seen a surge of foreign arrivals from wealthy countries, laptops in hand and stars in their eyes, settling in for months or longer. For governments, the new arrivals pose a tricky challenge: they are a boon to local economies but also bring increases in rents, traffic, and congestion. So should new arrivals be discouraged or encouraged? \nNew research\n by finance professor \nSergio Rebelo\n tackles that question and finds a creative way to harness the upsides while minimizing the downsides. Specifically, he and his coauthors suggest taxing capital gains on property sales and using the revenue to help offset the harms caused to locals.\nRead more in \nKellogg Insight\n. \n“A lot of low-wage occupations are going to be automated by AI, … and it’s going to increase pay for occupations that use AI as a complement.”\n— Professor of finance \nDimitris Papanikolaou\n, speaking at the \nAmerican Finance Association annual meeting\n, on how AI will affect the labor market.\nSee you next week!\nSusie Allen, senior research editor\nKellogg Insight\n  \nYou should follow us on \nTwitter\n or \nLinkedIn\n.\nAnd listen to our \npodcasts\n.\nFeedback\n  ·  \nUnsubscribe\n  ·  \nAbout Us\n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-24T12:05:55+00:00",
    "sent_at": "2024-01-24T12:05:46+00:00",
    "date_extracted": "2025-04-03T20:36:05.946716"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVHY7UkAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAFw55v4VUn1PvtayemPdKak=",
    "from": "johns@drjohnsullivan.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "johns@drjohnsullivan.com",
    "in_reply_to": "N/A",
    "subject": "8 Ugly Numbers… That Highlight HR’s Failures",
    "body": "You don't often get email from johns@drjohnsullivan.com. \nLearn why this is important\nA Think Piece – Posing the question, “Is it time to take a closer look at failures in HR?”\n \n \nShare\n \n \nShare\n \n \nTweet\n \nLATEST ARTICLE\n \n8 Ugly Numbers… That Highlight HR’s Failures\nA Think Piece\n – Posing the question, “Is it time to take a closer look at failures in HR?”\nUnderstanding The Many Benefits Of Failure And Criticism\nWith few exceptions, throughout my career, I found that HR professionals are positive individuals who don’t even want to talk about failure. That positivity also means they are uncomfortable with the criticism that comes along with failure. However, I find that perspective to be a serious miscalculation. Because “\ncriticism is the engine of change,” \nit is beneficial as it harnesses outsiders (with fresh eyes) to help you understand every aspect of what went wrong.\nThe many benefits of failure include:\nIt makes you stronger\nIt tells you what not to do again\nIt forces you to innovate\nIt reveals the root causes of failure\nIt’s an excuse to interact with executives\nIt keeps your ego in check\nIt illuminates the path to success\nIt forces you to focus on output quality\nIt provides you with fresh criticism\nIt forces you to use metrics and collect data\n“It’s fine to celebrate success,\n \nbut it is more important to heed the lessons of failure.”―\n Bill Gates\nThe Eight Major Failure Areas In HR\nThe remainder of this article covers eight major failure areas in HR. And within each of these eight areas. I provide at least one “snapshot data point” supporting the argument covering why that HR area deserves closer examination. \nHR failure #1 –\n New data suggests that… HR’s current benefits expansion means higher costs but perhaps no real impact \n– although HR leaders might not be aware of it. Since COVID, HR has essentially advocated a new form of \ncorporate paternalism\n. HR has been striving to take care of more and more “worker needs and wants.” Even though meeting these new wants might not impact worker productivity or retention. So, in most of HR, it is still a common practice to propose and implement these new “soft wellness benefits.” Without any data proving that they produce the desired results and have a positive ROI (the dollars of business impacts outweigh the program’s costs). And because these programs can be costly, the HR cost area that used to be called “fringe benefits.” Have now reached 30% of the average worker’s paycheck. \nConsider this new data a benefit’s wake-up call\n – unfortunately, the benefits function has done little to prove the business impacts of each of its offerings. But that omission is about to change. Fortunately, one major university recently concluded a comprehensive analysis covering the measurable impacts of 90 of these new “soft” benefit programs. The 90 different benefits that were analyzed include sleep apps and digital wellness solutions. Courses/seminars that cover coaching, mindfulness, massage, resilience, relaxation, time management, and financial health. \nAnd if you have time to read this eye-opening study, you can find it by clicking \nhere\n. Fortunately, \nthe New York Times has summarized its results\n. The NYT reported that employees who participated in these 90 different programs \nwere no better off\n than colleagues who did not use them. As a result of this startling discovery, I recommend that every major corporation begin researching the employee saved, scheduled impacts, and the ROI of each existing or proposed HR benefit program.\nHR failure #2 –\n \nHR has still not been rated as strategic \n– HR has continually failed even to get a majority of our business leaders to rate HR as strategic. And \nnew survey data reveals\n that HR’s strategic rating has risen only a mere 1% since 2018. And our 46% strategic rating is, unfortunately, a full 21 points behind finance.\nHR failure #3 –\n HR is still not trusted by our employees… despite all of our efforts\n – being fully trusted by your employees is a major goal of every HR function. However, a survey of major tech companies found \nthat 70% of employees don’t trust HR\n. And not a single one of these 18 top tech companies had a majority of its own employees say that they trusted HR at their company. And that “don’t trust” percentage rose to a whopping 83% at Intel.\nHR failure #4 –\n \nHiring, our most impactful sub-function, has a painfully high failure rate\n – unfortunately, for years. The Conference Board has rated hiring as a top executive challenge in its annual \nC-suite survey\n. The fact that hiring has remained a top challenge for so many years is by itself an indication of the failure of recruiting. The failure rate of new hires is a second failure area. Extensive research by Leadership IQ has revealed that \nthe average hiring failure rate\n is an astonishingly high 46%. And only 19 percent of new hires actually achieve unequivocal success. The third major failure area in recruiting has been the consistent “overhiring” over the last few years without effective workforce planning. As a consequence of this overhiring, many companies have been forced to initiate painful, large-scale, costly layoffs. The most essential remedial action for recruiting leadership is to begin measuring the on-the-job performance of new hires and the factors that accurately predict it for each job.\nHR failure #5 –\n Training and development produce expensive failures\n – this function is among the largest spenders in the HR budget. However, research shows that an amazing 90% of individual training programs \nfail to reach their targeted outcomes\n. This is partly because 90% of the provided content doesn’t significantly change employee behavior. Therefore, 75% of \nmanagers report that they are dissatisfied\n with their L&D function. Instead, L&D must learn to calculate the ROI of each of its programs. Then, keep only the programs that have a direct, sustained, measurable impact on participant productivity.\nHR failure #6 –\n Our diversity results have been embarrassing –\n one DEI expert concluded, “Researchers have studied the effects of diversity training for years, and they’ve found a resounding theme: \nmost DEI programs don’t work\n.” Other research supports this conclusion. Less than 2% of HR leaders reported that they were confident that they were \nactually achieving their DE&I goals\n. Employees also support that conclusion because 62% of workers rated their \nDEI programs to be ineffective\n. Today, with the increasing level of pushback on DEI programs, Now is an ideal time to make DEI a 100% data-driven function.\nHR failure #7 –\n Turnover has skyrocketed, but HR still has no answer \n– HR’s haphazard, mostly intuitive approach to stopping the great resignation has had little effect. Employee retention has remained the \nnumber one operational priority\n. And perhaps the costliest turnover area is new-hire turnover. Research by BambooHR \nfound that as many as 33% of new hires leave in the first month\n. And after three months, 68% of your new hires will have left. Instead, what is needed is a data-driven approach that identifies the major causes of turnover and the most effective tool for minimizing each cause. Employees also need to be prioritized for retention so that the highest-impact employees receive the most attention.\nHR failure #8 –\n The execution within HR also frequently fails\n – unfortunately, HR often stumbles in its ability to execute. That problem is illustrated by the fact that 84% of HR professionals report that their \nrecent HR Projects have been unsuccessful\n. And with such a high failure rate of new programs. Every HR function needs to research the” critical success factors” in successful HR operations.\n“The difference between average people and achieving people\n                   is their perception of and response to failure.”\n – John C. Maxwell\nFinal Thoughts\nHR needs to learn from other innovators if it wants to become an innovative function. And that lesson is “rather than treating failure as an enemy, embrace it as a powerful learning and motivation tool.” So, in that light, I find that the beginning of each year is the ideal time to examine and learn from last year’s failures. A good starting place is to require each subprogram within HR to begin measuring and reporting its failure rate. The subfunctions to target include hiring, retention, onboarding, L&D, performance management, diversity, and internal movement. In my experience, HR can’t become strategic until it first systematically identifies each of its major failure areas. And then, after each failure, it conducts “\nfailure analysis\n” in order to identify which factors contributed to each failure.\n“I have not failed. I have found 10,000 ways that don’t work.”\n ― Thomas Edison\nAuthor’s Note\nPlease spread these ideas\n by sharing this article with your team/network\n and by posting it on your favorite media. \nAlso, join the well over 20,000+ that follow or have connected with Dr. Sullivan’s community on \nLinkedIn\n.\nAnd, if you don’t already subscribe to Dr. Sullivan’s Aggressive Talent Management articles, you can do that \nhere\n.\nMOST RECENT ARTICLES\n8 Ugly Numbers… That Highlight HR’s Failures\nThe Most Read Talent Management Articles (Dr. Sullivan highlights 6 simple recruiting tools)\nA Decision Filter… A Simple Tool For Making Fast Objective Program Approval Decisions\nNew Year’s Resolutions For Progressive Recruiters (Simple but effective recruiting tools)\nRESOURCES\n \nStay Interviews and Other Powerful Retention Tools\nIn this brand new eBook, learn how to implement Stay Interviews, the highest ROI activity that any manager can utilize which has been proven effective in keeping top performers.\nPURCHASE HERE\n \n \nOnboarding & Orientation Toolkit\nHave you been frustrated that it takes new hires/transfers longer than it should to get up-to-speed and become productive faster? If so, then this Guide is the essential must-have, must-read, must-do resource for you!\nPURCHASE HERE\n \nIf my article stimulated your thinking and provided you with actionable tips, please follow or connect with me.\n \n \n \n \n \nPROFESSOR, SPEAKER, ADVISOR, AUTHOR\nDr. Sullivan has written over 1300 articles and a dozen white papers, conducted over 50 different webinars, and dozens of workshops. He is an engaging corporate speaker who has excited audiences at over 300 corporations/organizations in 30 countries on six continents.\nDr. John Sullivan is a noted author, speaker, and educator. He leverages his 30+ years of guidance to Fortune 500 and Global 1000 firms.\nIf you need advice or a speaker, contact us at john@drjohnsullivan.com \nCopyright © 2024 \nDr John Sullivan\n, All rights reserved.\nYou are receiving this email because you opted in for updates on DrJohnSullivan.com\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-01-23T15:11:57+00:00",
    "sent_at": "2024-01-23T15:11:45+00:00",
    "date_extracted": "2025-04-03T20:36:06.287694"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVHY7UjAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAErjcBQoMTJHvGURP-skWSU=",
    "from": "info@sietarusa.org",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@sietarusa.org",
    "in_reply_to": "N/A",
    "subject": "SIETAR USA 2024 Conference - Only 1 Month Away!",
    "body": "Join us for this virtual event! ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌\n \n \nView in Web Browser\n \n \n \n \n \n \n \n \n \n \n \n \nOnly One (1) Month from TODAY...\n \n \n \n \n The \nSIETAR USA 2024 Virtual Conference\n!\nFebruary 22 - 24, 2024\n \n \n \n \n \nBring your passion for learning to the 2024 SIETAR USA Virtual Conference! The knowledge, connections, and inspiration you'll gain from the conference will have a positive impact on your job performance, business growth, and your professional path. And who can't use more of that??\n \n \n \n \n \n \nSign Up TODAY!\n \n \n \n \n \n \nJust click the 'Register NOW' button below to sign up (ticket options are listed down the right-hand side of the page), and then check out the conference agenda and get your profile ready.\nWe hope to \"see\" you there!\nYour SIETAR USA Conference Team\n \n \n \n \n \n \n \n \nRegister NOW \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUnsubscribe\n | Sent by SIETAR USA \n4880 Lower Roswell Rd, Suite 165 • Marietta , GA • 30068",
    "received_at": "2024-01-22T17:51:29+00:00",
    "sent_at": "2024-01-22T17:51:14+00:00",
    "date_extracted": "2025-04-03T20:36:06.686031"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVHY7UiAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAG5mTyThpvNGi34trf2Go9U=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "The hidden price of credit-card perks",
    "body": "Plus: Community revitalization, customers’ minds, and prescription drug markets.\n \nJanuary 21, 2024\nView in Browser\n \n \n \n \nThe latest research and ideas from the Kellogg School of Management at Northwestern University\n \n \nWho Pays for All Those Generous Credit-Card Rewards?\n \nA new study investigates where this “free” money is coming from—and why credit-card companies are so keen to dole it out.\n \n \nCommunity Revitalization Is Hard to Get Right. Here’s How It Can Succeed.\n \n“The basic amenities people want are pretty universal, but every community has its own priorities and ideals.”\n \n \nPodcast: Get Inside Your Customer’s Mind\n \nOn this episode of The Insightful Leader: how understanding consumer mindsets can help you make the sale.\n \n \nWebinar\n \nThe Insightful Leader Live: Making Sense of America’s Prescription Drug Market\n \nIn this complimentary webinar, Amanda Starc will answer your questions about all things prescription drugs, and offer her take on how to build a healthier market. \nJoin us, Thursday, February 11 at 12pm CST.\nRegister\n \n \nFrom the Archive\n \nDoes Immigration Help or Hurt Local Economies?\n \nHistorically, where immigrants cluster in the U.S., prosperity follows.\n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-21T12:05:18+00:00",
    "sent_at": "2024-01-21T12:05:12+00:00",
    "date_extracted": "2025-04-03T20:36:07.030413"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVFG4fGAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAC0uGSL7PABErcwVpyVI5GM=",
    "from": "awards@canneslions.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "awards@canneslions.com",
    "in_reply_to": "N/A",
    "subject": "Make history. Cannes Lions Awards 2024 now open.",
    "body": "You don't often get email from awards@canneslions.com. \nLearn why this is important\nThis is your moment. Have your work recognised. Grow your business. Drive progress. Enter the Cannes Lions Awards 2024\n | \nView in browser\n \n \n \nYour moment is here. The 2024 Cannes Lions Awards are now open for entry. Find all the details you need to get started below, alongside this year’s Jury Presidents, who will define the global benchmark for the most creative and effective work. \n \nHave your team’s finest work recognised. \nDemonstrate the power of creativity. Make history.\nBEGIN YOUR AWARDS JOURNEY\n \n• \nBEFORE YOU SUBMIT YOUR WORK\n \nMeet the \nJury Presidents\n \nExperts in their fields, our Jurors are tasked with shortlisting and awarding the industry’s best creative work. Discover what inspires and excites our Juries in order to put your best work forward.\n \nDISCOVER THE JURY PRESIDENTS\n \nDownload the \nEntry Kits\n \nWhether you're a first timer or a seasoned pro, our Entry Kits have all of the information you need about the Lions, the changes to the categories for 2024 and details about submitting your work.\n \nDOWNLOAD HERE\n \nSee what’s new and what’s changed\n \nWe’re dedicated to always refining and evolving our Awards to ensure they reflect the landscape of our industry and pave the way forward. See what’s in store for 2024 – including a brand new Lion and a host of changes for a more inclusive and sustainable Awards.\n \nWHAT’S NEW\nWe’re here to help.\n \nNo matter where you are on your Awards journey, our team of Experts are on hand to answer any questions you might have. Give us a call, send us an email or book a complimentary introduction chat with an Awards Expert.\nAWARDS SUPPORT\n \n \n \n \n \n \n \n \n \n \n \nThis email was sent to felicia@lcwmail.com. You can \nmanage your preferences\n or unsubscribe \nhere\n.\nLIONS, Ascential Events (Europe) Limited, 33 Kingsway, London WC2B 6UF\n \n© Copyright Ascential Events (Europe) Limited",
    "received_at": "2024-01-18T16:24:14+00:00",
    "sent_at": "2024-01-18T16:24:07+00:00",
    "date_extracted": "2025-04-03T20:36:07.477874"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVBIsO2AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAIy9-ilaomRKohPvL90D_Ls=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "The recession that wasn't",
    "body": "Plus: family businesses and crypto ETFs. \nThe recession that wasn't  ·  \nView in browser\n \nThe Insightful Leader\nBY \nKELLOGG INSIGHT\nLeadership advice from the Kellogg School of Management at Northwestern University\nGood morning,\nFor much of 2023, the word on (nearly) every U.S. economist’s lips was “recession.” But here we are in 2024, and the widely prognosticated downturn has yet to materialize. What happened? Are we really in the clear?\nThis week, we’ll hear from Kellogg’s \nJanice Eberly\n on the recession that wasn’t and the general state of the economy. We’ll also share some advice on managing the succession challenge in family businesses.\nWhat’s going on with the U.S. economy?\nCast your mind back to late 2022 and early 2023: supply chains were still a mess from the pandemic. Immigration and labor-force participation were down, sending wages skyrocketing. Inflation was sitting at an eye-popping 6.5 percent. \nNo wonder economists were worried.\n \nBut, \nas Eberly told \nThe Wall Street Journal\n, “the U.S. economy was in a very different place than it is now.” Those struggles—with supply chains, hiring, and inflation—all lessened over the course of 2023. \nThe \nJournal\n was covering the American Economic Association’s annual meeting in San Antonio, TX. Among the experts there, the consensus was now that the U.S. is headed for a “soft landing”—that is, decreased inflation without a recession. \nBut while a temporary sigh of relief may be warranted, there’s reason for concern about longer-term economic prospects. In a presentation at the conference, Eberly argued that just getting back to business-as-usual won’t be enough to jolt the U.S. economy out of the sluggish growth trajectory it had been on pre-pandemic. The U.S.’s aging population, as well as global conflicts and changes to trade patterns, pose serious challenges to productivity that must be overcome to boost long-term growth. Top candidates for increasing productivity in the long term include AI, increased levels of immigration, and hybrid or remote work arrangements that keep people in the workforce.\nYou can read the whole article in \nThe Wall Street Journal\n.\nFamily matters\nBy some estimates, 90 percent of businesses are family-owned. And while few are as consistently Shakespearean as the fictional Roy family of HBO’s \nSuccession\n, many have to navigate complex family dynamics in the immediate term to set themselves up for success in the distant future.\n“Family businesses need to focus on long-term resilience, which means preparing the next generation,” says \nMatt Allen\n, a clinical professor at Kellogg and executive director of the \nJohn L. Ward Center for Family Enterprises\n. “That’s a different time horizon than quarterly earnings.”\nIn \na recent \nKellogg Insight\n article\n, Allen offered some tips on how family enterprises can build and preserve multigenerational resilience. \nFor example: don’t delay planning for a leadership transition. \nIf everyone knows a decade in advance who will take the helm, the entire organization can prepare accordingly. “What works terribly is saying, ‘We’ve got three kids and we’re not quite sure who will be taking over,’” Allen says.\nIn addition to transparency and a measure of continuity, the value of choosing early is that the new leader will have time to build their own relationship with employees and customers, Allen notes: “When you have a date already set and a ten-year window to work with, that makes everyone comfortable.”\nYou can read the rest of his advice in \nKellogg Insight\n.\n“We’re finally at the point where the regulator is willing to give us clear guidance in terms of what’s legal and what’s not.”\n— Clinical professor of strategy \nSarit Markovich\n, on \nNPR\n, on the Security and Exchange Commission’s approval of exchange-traded funds that will track bitcoin prices.\nSee you next week!\nSusie Allen, senior research editor\nKellogg Insight\n  \nYou should follow us on \nTwitter\n or \nLinkedIn\n.\nAnd listen to our \npodcasts\n.\nFeedback\n  ·  \nUnsubscribe\n  ·  \nAbout Us\n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-17T12:04:38+00:00",
    "sent_at": "2024-01-17T12:04:32+00:00",
    "date_extracted": "2025-04-03T20:36:08.233206"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVBIsO1AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQALmQY-JZPdhHlQFzmoY8Ijo=",
    "from": "johns@drjohnsullivan.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "johns@drjohnsullivan.com",
    "in_reply_to": "N/A",
    "subject": "The Most Read Talent Management Articles (Dr. Sullivan highlights 6 simple recruiting tools)",
    "body": "You don't often get email from johns@drjohnsullivan.com. \nLearn why this is important\nDuring tough times, a recruiter’s knowledge of best practices is the key to job security.\n \n \nShare\n \n \nShare\n \n \nTweet\n \nLATEST ARTICLE\n \nThe Most Read Talent Management Articles\n(Dr. Sullivan highlights 6 simple recruiting tools)\nDescriptors – recruiting/tools – how to – 3 m. read\nDuring tough times, a recruiter’s knowledge of best practices is the key to job security.\nAs the most prolific author in the field of recruiting tools (I have written over 700 articles and a book on recruiting tools). To me, the beginning of the new year is the ideal time to update your current recruiting practices and add a few new simple tools that require little training and no budget. To support the updating effort of recruiters and hiring managers, below, you will find my top five recruiting tools articles from last year. Each of the ranked articles has a short summary covering why you should use it and a hyperlink to the complete article.\nDr. Sullivan’s Must-Read Recruiting Tool Articles From 2023\nOf the more than 50 articles that I published last year, here are the top five most often read recruiting tools articles (ranked by LinkedIn impressions). \nThe 5 worst candidate assessment tools that you should stop using \n– this powerful article lists and describes the five worst candidate screening tools that are still commonly used. It utilizes data to question common screening approaches like Myers-Briggs and candidate fit. So, if you want to stop the premature screening out of top candidates and improve your overall recruiting results. Click on this link to learn more about \nthe worst screening tools\n that you should no longer be using.\nShift to “professional conversations” to reduce the stress that occurs in traditional\n \ninterviews\n – this article highlights how excessive stress can dramatically reduce the interview performance of even the best candidates. And it suggests you should instead shift to professional conversations. These are less threatening because they strive to reduce it by turning an interview into a more informal conversation between two professionals. So, if you want to see more of the “real candidate” during your interviews. Click here to learn more about these proven \nprofessional conversations\n.\nDocumenting your interviews will improve your recruiting results\n – few realize how this simple effort to more completely document your interviews can dramatically improve your hiring. This easy-to-scan article highlights how simple actions (like documenting each interviewer’s numerical score) can help you identify your strongest interviewers. And how, over time, this documentation will help you to continually improve your hiring results. Click here to learn more about \nthe value of better interview documentation\n.\nEncourage interview screeners to stop initially searching for weaknesses in candidate resumes –\n this article highlights how many resume screeners overly focus on finding candidate weaknesses so that they can quickly reduce their intimidating stack of resumes. However, that search for weaknesses can be delayed or moderated. You will find that most excellent candidates and all innovators have made missteps along the way in their careers. This means that it is better to first focus on finding “points of excellence” in a resume. In order to avoid hiring only vanilla candidates who have avoided mistakes by doing little. Click here to learn more about the problem of \noverly focusing on weaknesses in resumes\n.\nWhy “how will you solve this real problem” is the most revealing interview\n \nquestion\n – it seems like everyone is constantly searching for the one “magic interview question.” Well, if there is one. Fortunately, the data and my own experience reveal that the single most effective assessment tool is to put the candidate “in the job.” Unfortunately, that is difficult to do prior to hiring. However, you can come very close to “putting them in the job” during their interview by verbally giving the candidate “a real problem that they will face in their job” to solve during the interview. Fortunately, by asking them “to walk you through the steps” on how they will solve this problem.” You can better determine if they will take the right steps and which important ones they will omit when they actually face this real problem. These “real problem-solving type of questions” will by far give the interviewer the most insight into whether the candidate can actually do this job. Click here to learn more about the value of \ngiving the interviewee “a real problem.”\n—————————\nMy Personal Selection… The Most Impactful Recruiting Tool For 2023\nAmong the dozens of articles on recruiting tools that I published in 2023, I have selected the one article that I consider to be the most impactful. Therefore, in my view, this is the most important article that all progressive hiring managers and recruiters should both read and follow. It is:\nTime your hiring when the competition is low –\n my research has revealed that the most ignored but highest impact area in recruiting is timing. Because almost everyone begins recruiting immediately after a job comes open, that can be a major mistake. Obviously, you have a better chance of recruiting top candidates when you recruit during the times of year when the hiring competition is extremely low. For example, few major talent competitors actively recruit during Christmas or August when their hiring managers are mostly distracted or are on vacation. So this article highlights how to identify the times during the year when even companies with tiny recruiting budgets and a weak employer brand can successfully recruit top talent during times when this talent has fewer choices. Simply because the major recruiting companies were doing little or no recruiting during that time. Click here to learn more about \nthe importance of timing your hiring\n when the competition is low.\nMy Editor’s Selection… The Most Impactful Recruiting Tool For 2023\nAmong the dozens of articles on recruiting tools that I published during 2023, my wickedly smart editor, Michael Cox, selected this article as the most impactful. \nA simple “what worked survey” quickly improves sourcing \n– this article highlights the importance of applying a “what worked survey” of applicants and candidates. In order to learn the most effective job posting channels, the most powerful attraction factors and the strongest employer brand factors. Once you have applicant feedback data revealing these factors, you can quickly and easily improve your candidate sourcing. Click here to learn more about \nthis simple survey for identifying what worked\n and what didn’t work during sourcing. \nFinal Thoughts\nIn a fast-changing world, where AI and Quantum Computing will literally change everything that we do in business and recruiting. Continuous, self-directed, rapid learning will be the key to survival in almost every professional job. So rather than fight it, prepare for it by developing a plan for continuously learning about emerging recruiting tools and best practices.\nThe remainder of my fifty-plus 2023 articles and over 1,300 additional articles covering strategic talent management and aggressive recruiting 155’s tools can be found at \nwww.drjohnsullivan.com\n. In addition, if you are not among the thousands of current readers, you can subscribe to Dr. Sullivan’s weekly Aggressive Talent Newsletter \nhere\n.\nAuthor’s Note\n \nPlease spread these ideas\n by sharing this article with your team/network\n and by posting it on your favorite media.\nAlso, join the well over 20,000+ that follow or have connected with Dr. Sullivan’s community on \nLinkedIn\n.\nMOST RECENT ARTICLES\nThe Most Read Talent Management Articles (Dr. Sullivan highlights 6 simple recruiting tools)\nA Decision Filter… A Simple Tool For Making Fast Objective Program Approval Decisions\nNew Year’s Resolutions For Progressive Recruiters (Simple but effective recruiting tools)\nAll Turnover Isn’t Bad… Encouraging “Good Turnover” (The positive impacts of good turnover)\nRESOURCES\n \nStay Interviews and Other Powerful Retention Tools\nIn this brand new eBook, learn how to implement Stay Interviews, the highest ROI activity that any manager can utilize which has been proven effective in keeping top performers.\nPURCHASE HERE\n \n \nOnboarding & Orientation Toolkit\nHave you been frustrated that it takes new hires/transfers longer than it should to get up-to-speed and become productive faster? If so, then this Guide is the essential must-have, must-read, must-do resource for you!\nPURCHASE HERE\n \nIf my article stimulated your thinking and provided you with actionable tips, please follow or connect with me.\n \n \n \n \n \nPROFESSOR, SPEAKER, ADVISOR, AUTHOR\nDr. Sullivan has written over 1300 articles and a dozen white papers, conducted over 50 different webinars, and dozens of workshops. He is an engaging corporate speaker who has excited audiences at over 300 corporations/organizations in 30 countries on six continents.\nDr. John Sullivan is a noted author, speaker, and educator. He leverages his 30+ years of guidance to Fortune 500 and Global 1000 firms.\nIf you need advice or a speaker, contact us at john@drjohnsullivan.com \nCopyright © 2024 \nDr John Sullivan\n, All rights reserved.\nYou are receiving this email because you opted in for updates on DrJohnSullivan.com\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.",
    "received_at": "2024-01-16T15:07:36+00:00",
    "sent_at": "2024-01-16T15:07:25+00:00",
    "date_extracted": "2025-04-03T20:36:08.251806"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAVBIsO0AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAHjv5Om2zLdErzAvzWN1NFo=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "How wealthy expats are changing cities",
    "body": "Plus: Succession challenges, diverse hiring committees, and China’s economic slowdown.\n \nJanuary 14, 2024\nView in Browser\n \n \n \n \nThe latest research and ideas from the Kellogg School of Management at Northwestern University\n \n \nHow Should Global Cities Manage an Influx of Wealthy Foreign Residents?\n \nIn an age of remote work, the trend will only continue. So how can governments take advantage of the benefits while mitigating the harms?\n \n \n4 Tips for Managing the Succession Challenge\n \nGenerational transitions can be bumpy for family firms. They can also be an opportunity to grow.\n \n \nWhy Are So Many Young Chinese Depressed?\n \nIt’s not just the economic slowdown. The country’s education system and social policies have created a disillusioned generation.\n \n \nFrom the Archive\n \nDo Diverse Hiring Committees Choose More Diverse Leaders?\n \nThe answer comes down to organizational culture.\n \nFrom the Archive\n \nWhy Do You See the World as More Fair Than I Do?\n \nThe amount of racism or classism you perceive likely depends on how much you favor social hierarchies.\n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-14T12:04:50+00:00",
    "sent_at": "2024-01-14T12:04:42+00:00",
    "date_extracted": "2025-04-03T20:36:09.005861"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU-4tU8AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAP_JLdwq3BNArAWj2rnFd1c=",
    "from": "newsletter@canneslions.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "newsletter@canneslions.com",
    "in_reply_to": "N/A",
    "subject": "One week. Endless opportunities.",
    "body": "Talks from the best creative minds. World-class Awards. Unmissable networking. See how you can make your time at Cannes Lions bespoke to you\n | \nView in browser\n \n \n \nDrive progress. Invest in your skillset. Witness history in the making.\nNo matter why you come to Cannes Lions – whether you're looking for your next creative spark or simply to network with the industry's best minds – there's no one way to be part of the Festival. Here's how our delegates turn one week of world-class creativity into skills, lessons and connections that last a lifetime.\n \nBe part of Cannes Lions 2024 – passes on sale now.\nFIND YOUR PERFECT PASS\n \n \n  \nThe Festival brings together the industry’s biggest names, most inspiring figures and key decision makers. You can meet them. Get exclusive perks when you become a delegate with the Cannes Lions App, complimentary meeting spaces, networking events and more.\nEXPLORE THE DELEGATE GUIDE\n \n \n  \nCreativity can come from anywhere. That’s why Cannes Lions has hosted Talks from international icons to unique problem solvers. No two Speakers are the same, but they’ll all help you challenge your thinking, improve your work, and inspire your own creativity.\nABOUT THE FESTIVAL\n \n• \nCAN’T WAIT? GET SET FOR 2024 AT MOST CONTAGIOUS NYC \n \nLIONS, WARC and Contagious are coming together to help bring the creative impact debate to the USA at Most Contagious NYC – and new speakers and sessions have just been announced. Join us to set the agenda for your marketing and hear from thought leaders on the trends we can expect to see in 2024 and beyond.\n \nMost Contagious NYC is happening on 24 January – tickets still available.\n \nGET TICKETS\n \n  \nThe Cannes Lions Awards celebrate the very best creativity – from every sector and specialism of the industry, and from every corner of the globe. Winning a Lion is a career-defining achievement – and now’s your chance to get ahead of the game. Awards open 18 January.\nBOOK A CALL WITH AN AWARDS EXPERT\n \n \n  \nFrom pop-ups on the French Riviera to unmissable surprise gigs, the world’s most creative brands make Cannes Lions their home too. Take a look at the Partners who’ll be coming to Cannes Lions 2024 – and discover the opportunities for your business.\nDISCOVER OUR PARTNERSHIPS\n \n \nA week at Cannes Lions leaves you with insights, connections, and skills for life. With new ways to access the Festival and upskill for less – like \ndiscounted access\n for new creatives, \nLIONS Academies\n for learning from the best, to \nspecialist passes\n open to any growing Brand Marketer or Creative – there’s a pass for you for Cannes Lions 2024. All you have to do is decide the perfect pass for you. Buy now for the best choice of accommodation in June.\n \nEXPLORE ALL PASSES\n \n \n \n \n \n \n \n \n \n \nPlease do not reply to this email. This email was sent to felicia@lcwmail.com. You can \nmanage your preferences\n or unsubscribe \nhere\n.\nCannes Lions, Ascential Events (Europe) Limited, 33 Kingsway, London WC2B 6UF\n \n© Copyright Ascential Events (Europe) Limited",
    "received_at": "2024-01-11T17:33:58+00:00",
    "sent_at": "2024-01-11T17:33:51+00:00",
    "date_extracted": "2025-04-03T20:36:09.019070"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU-4tU7AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAG_3BUyvbs1Bqyegu3xtet4=",
    "from": "info@e.graduatehotels.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@graduatehotels.com",
    "in_reply_to": "N/A",
    "subject": "Share your top Graduate travel moments for a chance to win",
    "body": "You don't often get email from info@e.graduatehotels.com. \nLearn why this is important\nPlus, up to 30% OFF your next adventure.\nView In Browser\n \n \n \n \nOffer valid at participating Graduate Hotels, for new reservations only. Offer must be mentioned at time of reservation and based on 2024 standard rates. Blackout dates may apply. \n \n \n \n \n \nUnsubscribe\n \nfrom our marketing emails.\nPrivacy Policy\n \n|\n \nTerms & Conditions",
    "received_at": "2024-01-11T15:20:15+00:00",
    "sent_at": "2024-01-11T15:20:07+00:00",
    "date_extracted": "2025-04-03T20:36:09.990112"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU-4tU6AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAHeAqVwf1uBFtof7L_Vm4N8=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "The virtue of having fewer opinions",
    "body": "Plus: the cost of hiring difficulties and the value of teaching empathy. \nThe virtue of having fewer opinions  ·  \nView in browser\n \nThe Insightful Leader\nBY \nKELLOGG INSIGHT\nLeadership advice from the Kellogg School of Management at Northwestern University\nGood morning,\nPineapple on pizza: innovation or abomination? Coffee or tea? Bears or Packers? Heck, I don’t even follow football, and I kind of have an opinion on that last one (which I will \nnot\n share, because I’m not out here trying to lose half my readers in the first paragraph).\nPoint is, modern life forces us into a funny corner where we’re all reflexively forming opinions—even about things that don’t matter much to us. This week, we’ll hear about the virtues of having fewer opinions. Then we’ll explore some new research that quantifies the impact of job vacancies on a company.\nA matter of opinion\nOver on \nLinkedIn\n, \nAdam Waytz\n, a professor of management and organizations at Kellogg, had an idea for an unexpected New Year’s resolution: try to develop fewer opinions. Once a position is formed, Waytz writes, “it can become an unwanted responsibility, an annoyance, or worse, a stimulus for conflict with those who hold different opinions.” In fact, after quitting Facebook and Twitter, Waytz found that the biggest upside was not having more time, but rather having fewer judgments to manage. When you don’t know about the latest tempests in teapots, you don’t have to decide how to feel about them.\n \nAnd the real problem with opinions, Waytz explains, is that we form them really easily—and then start fighting about them. His own research has shown that our brains process seemingly trivial opinions (e.g., “waffle cones make ice cream taste better”) and politically charged moral beliefs (e.g., “buying clothing made with sweatshop labor is morally unacceptable” or “Americans are ethically obligated to buy American cars”) in similar ways.\n“Processing these pure opinions and moral beliefs (compared to considering factual statements) recruited brain regions involved in thinking about the self and the social world,” he writes. This suggests that opinions are powerful in part “because they reflect something about the self and what others think about us.”\nAnd sure, debating some opinions can be fun. (To return to our very first question, I do, personally, \nlove\n pineapple on pizza and have engaged in many enthusiastic discussions about the overall merits of savory/sweet combos. Dip a fry into a milkshake and tell me I’m wrong!) \nBut often, Waytz argues, such back-and-forth turns divisive and downright exhausting: “That so much of modern life is spent on digital platforms that ask us to upvote, downvote, subscribe, cancel, and provide a rating has further pushed us into a collective state of \nopinion fatigue\n.” His advice? “Surrender some of your likes and dislikes, and experience the freedom that comes with it.”\nYou can read his \nentire post here\n.\nHow vacancies affect the bottom line\nWe all know that job vacancies cause headaches—your remaining workers are covering someone else’s responsibilities, your managers are spending their days sorting through a big stack of résumés instead of taking care of everything else they’re supposed to be doing, and productivity suffers. But quantifying precisely how much empty positions hurt firms financially is surprisingly tricky. That’s because most data about recruiting difficulties come from small-scale surveys, which researchers can’t easily match with information about the health of individual firms.\nA new study by \nMaddalena Ronchi\n, an assistant professor of finance, tackles this challenge by analyzing job-posting data from the French government. Ronchi and her coauthors found that doubling the time it takes to fill a job vacancy results in a 3 percent drop in profits; a company facing the average amount of hiring difficulty can expect a 5 percent drop in sales. And it’s not just already-ailing companies that are vulnerable to these effects. “Even productive, large, growing firms are negatively affected by this type of [hiring] friction,” Ronchi says. “If anything, even more so.”\nYou can read more about the study in \nKellogg Insight\n.\n“Disagreement means richness of point of view, a wealth of ideas. So we want to keep that. But we want to prepare people to listen to different points of view.”\n— Kellogg dean \nFrancesca Cornelli\n, on \nLinkedIn’s This Is Working podcast\n, on the importance of teaching empathy.\nSee you next week!\nSusie Allen, senior research editor\nKellogg Insight\n  \nYou should follow us on \nTwitter\n or \nLinkedIn\n.\nAnd listen to our \npodcasts\n.\nFeedback\n  ·  \nUnsubscribe\n  ·  \nAbout Us\n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-10T12:07:35+00:00",
    "sent_at": "2024-01-10T12:07:29+00:00",
    "date_extracted": "2025-04-03T20:36:09.864667"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU_xevBAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAJbD_xjQdwdDuFM2jduQfNs=",
    "from": "info@sietarusa.org",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@sietarusa.org",
    "in_reply_to": "N/A",
    "subject": "SIETAR USA's Emotion Labor Webinar: There Is Still Time To Register!",
    "body": "Emotion Labor Webinar ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌\n \n \nView in Web Browser\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nWebinar:\n'\n Emotion Labor '\nPresenters: Kris Acheson-Clair and Annette Benson\n \n \n \n \nJanuary 10th, 2023 @ 11:30 AM (Eastern)\n \n \n \n \n \n \nIn this 90-minute session, Kris and Annette will give insight as to how the theory of emotion labor plays out in the workplace, especially in education; how supervisors can use knowledge of this theory to create an inclusive environment; how faculty and staff can avoid burnout from emotion labor through their healthy responses to it; and why the theory of emotion labor might have shortcomings for some populations. Along the way, participants will be given the opportunity to examine their own experiences with emotion labor and reflect on their own more and less effective strategies for managing emotion labor. Participants might be interested in reading \nThe Burnout Spiral: The Emotion Labor of Five Rural U.S. Foreign Language Teachers\n \n \nand/or listen to this \n \npodcast\n \non emotion labor in preparation for the webinar; however, it is not required in order to fully benefit from the webinar.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nKris Acheson-Clair\nFormerly Georgia State University faculty and Fulbright Scholar to Honduras, Kris is a well-published scholar on intercultural competence, transformative learning theory, emotion labor, and assessment. Kris currently serves as director of Purdue University’s Center for Intercultural Learning, Mentorship, Assessment, and Research (CILMAR). Under her leadership, CILMAR works with the university’s faculty and staff both to put intercultural learning at the heart of study abroad and virtual exchange programs and to embed intercultural learning across the curriculum and student life in order to reach the entire campus. Kris and CILMAR also serve the field of international education by creating scalable experiential and reflective teaching materials, producing cutting-edge scholarship, offering professional development opportunities, and connecting people and resources in the Intercultural Learning Hub (\nhubicl.org\n).\n \n \n \n \nAnnette Benson\nSince 2003, Annette Benson has served in a variety of administrative roles at Purdue University, including oversight of an ESOL program, HR training in diversity and inclusion, creation of integration and intercultural learning programs, management of the Intercultural Learning Hub, and public relations for the burgeoning CILMAR. Annette holds a Master of Science degree in strategic communication from Purdue’s Brian Lamb School of Communication. She comments that one of the kindest things a supervisor ever did for her was to discuss emotion labor with her.\n \n \n \n \n \n \n \n \n \n \n \n \nNon-member Register \n \n \n \n \n \n \nUnsubscribe\n | Sent by SIETAR USA \n4880 Lower Roswell Rd, Suite 165 • Marietta , GA • 30068",
    "received_at": "2024-01-09T21:59:21+00:00",
    "sent_at": "2024-01-09T21:59:11+00:00",
    "date_extracted": "2025-04-03T20:36:10.700747"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU_xevAAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAHYh8WBLb2FJmERq1zEOpXA=",
    "from": "dan.cook@cbrealty.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "dan.cook@cbrealty.com",
    "in_reply_to": "N/A",
    "subject": "You're invited to the 2024 Economic Summit",
    "body": "You don't often get email from dan.cook@cbrealty.com. \nLearn why this is important\nIt's time once again for Coldwell Banker Realty's Economic Summit, one of our most valuable and high\nView in Browser\nColdwell Banker and the Coldwell Banker logo are trademarks of Coldwell Banker Real Estate LLC. The Coldwell Banker® System is comprised of company owned offices which are owned by a subsidiary of Anywhere Advisors LLC and franchised offices which are independently owned and operated. The Coldwell Banker System fully supports the principles of the Fair Housing Act and the Equal Opportunity Act.\n‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ \nYou Are Invited\nCompliments of Daniel Cook\nThe State of the Economy:\nWhat Might We Anticipate?\nWith \nElliot Eisenberg, Ph.D.\nInternationally Acclaimed Economist,\nPublic Speaker and Author\nTuesday, January 30\n2 pm EST / 12 pm MST / 11 am PST | Via Video Stream\nor\n7 pm EST / 5 pm MST / 4 pm PST | Via Video Stream\nClick to RSVP\nDaniel Cook\nMobile: 313-585-4765\ndan.cook@cbrealty.com\nCalRE: CA-02133566\nAgent Website\nSearch Properties \nAffiliated real estate agents are independent contractor sales associates, not employees. ©2024 Coldwell Banker. All Rights Reserved. Coldwell Banker and the Coldwell Banker logo are trademarks of Coldwell Banker Real Estate LLC. The Coldwell Banker® System is comprised of company owned offices which are owned by a subsidiary of Anywhere Advisors LLC and franchised offices which are independently owned and operated. The Coldwell Banker System fully supports the principles of the Fair Housing Act and the Equal Opportunity Act. \n 23C1T1_NAT_12/23 CalRE #00616212 CalRE #01908304\nUnsubscribe",
    "received_at": "2024-01-09T14:40:03+00:00",
    "sent_at": "2024-01-09T14:39:58+00:00",
    "date_extracted": "2025-04-03T20:36:10.709832"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU_xeu-AAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAPwSv6sTZLJOnpfvDOIFiSE=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "THIS WEEK: Your Journey to the Boardroom",
    "body": "Join us this Thursday, January 11, at 12:00 Central, where we'll discuss board entry with Victoria Medvec\n \nJanuary 09, 2024\nView in Browser\n \n \n \n \n \nThursday, January 11, 12:00 p.m.-1:00 p.m. Central\n \nThe Insightful Leader Live: Your Journey to the Boardroom\n \nAn organization’s board of directors provides critical oversight and a strategic vision. But what does it take to become a part of this influential group? Whether you’re well on your way to board membership or just getting started, Professor \nVictoria Medvec\n will explain how you can prepare yourself to become “board-ready,” pitch yourself to others, and evaluate opportunities that come your way. She also offers specific tips for women and others who have historically been underrepresented on boards.\n \nRegister\n \n \nFaculty Speaker\n \nVictoria Medvec\n is the Adeline Barry Davee Professor of Management and Organizations at Kellogg, as well as the Co-founder and Executive Director of the Center for Executive Women and the best-selling author of Negotiate Without Fear. She leads the Kellogg Women’s Director Development Program, which has helped prepare more than 800 women for board opportunities. More than one-third of these women have been offered a board role, with many of them now serving on multiple boards.\n \n \nFor more on Victoria Medvec's research and insights, explore some of her contributions to \nKellogg Insight\n:\n \nNow’s the Time to Negotiate for the Job—or Salary or Flexibility—You Want\nWhat Will It Take to Get More Women on Boards?\n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-09T13:05:37+00:00",
    "sent_at": "2024-01-09T13:05:27+00:00",
    "date_extracted": "2025-04-03T20:36:11.466641"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU_LvUfAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAI6zTWLEb_hJsOz8VmTRjnY=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "How non-Fortune 500 firms attract top talent",
    "body": "Plus: Consumer mindsets, workplace stress, and board entry.\n \nJanuary 07, 2024\nView in Browser\n \n \n \n \nThe latest research and ideas from the Kellogg School of Management at Northwestern University\n \n \n5 Mindsets That Drive Consumer Behavior\n \nA Kellogg marketing professor explains the surprising ways that our mental states can influence what we buy.\n \n \nYoga Classes? On-Site Childcare? Firms Just Outside the Fortune 500 Work Hard to Attract Talent.\n \nTo compete with their prestigious peers, these organizations invest more in employees, research shows.\n \n \nPodcast: Using AI Comes with a Trade-off. Now Multiply That by 8 Billion.\n \nOn this episode of The Insightful Leader: what happens when everyone uses the same generative AI tools?\n \n \n \n \nWebinar\n \nThe Insightful Leader Live: Your Journey to the Boardroom\n \nIn this complimentary webinar Victoria Medvec will explain how you can prepare yourself to become “board-ready,” pitch yourself to others, and evaluate opportunities that come your way. \nJoin us, Thursday, January 11 at 12pm CST.\nRegister\n \n \n \n \n \nFrom the Archive\n \nDon’t Panic! Tools for Dialing Down Workplace Stress\n \nBeyond taking a personal toll, stress can reduce productivity. Here’s what managers can do.\n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-07T12:05:58+00:00",
    "sent_at": "2024-01-07T12:05:50+00:00",
    "date_extracted": "2025-04-03T20:36:11.559312"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU9nSBbAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQACzi7yg0OHxAn9Cr3kr-SaI=",
    "from": "info@godfreyhotelchicago.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "u38a3993bh3bu32d33m32937j36e3893b337s32k00@u.zmaildirect.com",
    "in_reply_to": "N/A",
    "subject": "January News",
    "body": "Stay More, Save More. \n \n \n \n \nJAN 2024\n \nStart the new year with a stay at The Godfrey Hotel Chicago in River North. Escape the ordinary and discover your element with us. Our hotel isn't just a place to stay; it's a sanctuary designed for comfort and individuality. Enjoy January rates starting at $99 per night for\n \nmembers\n. \nSign up now and plan a stay that's all about your comfort and style.\nBOOK NOW\nStay More, Save More\nTREAT YOURSELF TO THE SUITE LIFE\n \nGet 30% off suites when you book for three nights or more. Add up to three enhancements to your stay, like discounted spa services. Book our King Suite and save - it comes with a king bed, living room, sleeper sofa, and workspace. Experience luxury in River North with great accommodations and amenities\nBOOK NOW\n \nMore than just a place to stay. The Godfrey Chicago is a relaxing retreat. Perfect for business or leisure.\nEXPLORE OUR ROOMS & SUITES\nWarm Up Inside an Igloo\nOPEN TUESDAY - SUNDAY\n \nCozy up this winter in our heated igloos at IO Godfrey! ? Book your unique urban retreat now and elevate your experience with unforgettable rooftop views and warm comfort.\nTAP TO EXPLORE AND BOOK YOUR IGLOO\n \nHAPPY HOUR\nTuesday-Friday at I|O Godfrey\nGrab your friends and co-workers and join us for great deals on food and drinks. Tues-Thur: 2pm-5pm; Fri: 12pm-3pm.\nVIEW THE MENU \n \nGODFREY WINE FEST\nSaturday, April 27, 1pm-5pm\nWine lovers rejoice! Our Wine Fest is returning, bigger and better. Enjoy four hours of wine tastings and more!\nBUY TICKETS \nCorporate Events that STAND OUT! \n \nNamed \"America's Coolest Rooftop Bar\" by Travel & Leisure Magazine\nOpen Year Round • High-Design Ambiance\nRetractable Roof • Unique Indoor|Outdoor Capability • Waterfall\nGarden Oasis • Customizable Video Wall • Hors D'Oeuvres\nBar Packages • Groups 20-750\nElevate your next corporate event into a memorable experience. Contact Sandi Robinson to begin the planning process!\nSTART PLANNING\n \nTAKE A LOOK AT OUR OTHER LOCATIONS\n \nTHE GODFREY HOTEL HOLLYWOOD\n \nTHE GODFREY HOTEL BOSTON\n \nTHE GODFREY HOTEL DETROIT\n \nNEED TO RESCHEDULE?\nWe are amending our standard cancellation policy for the time being. You can reschedule or cancel your stay if booked direct up to 24 hours prior. Please contact us at (312) 649-2000 or \nFrontDesk@godfreyhotelchicago.com\n for more information.\n \n \n1\n27 West Huron at LaSalle, Chicago, IL 60654\nMain Line: \n(312) 649-2000\nFrontDesk@godfreyhotelchicago.com\n \n \n \n \n \nView in browser\n | \nUnsubscribe",
    "received_at": "2024-01-06T15:23:16+00:00",
    "sent_at": "2024-01-06T15:23:09+00:00",
    "date_extracted": "2025-04-03T20:36:12.821338"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU8K46WAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAGKtpFJctQlKuN7MzbZ0YM8=",
    "from": "concierge@expensify.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Updated Terms of Service",
    "body": "You don't often get email from concierge@expensify.com. \nLearn why this is important\nHi there,\nWe've made some updates to our \nTerms of Service\n for new members of our Expensify Card program.\nAs always, we're sending this notification to everyone with an Expensify account. Continued use of Expensify following the update constitutes acceptance of our updated Terms of Service. \nThanks,\nConcierge\nPS: This is a one-time required legal notice sent to all Expensify members, even those who have unsubscribed from optional announcements. If you would like to never receive this again, please follow \nthese\n instructions to close your account. Thank you for your understanding.\nSent by: Expensify, Inc - 548 Market St #61434 - San Francisco, CA 94103",
    "received_at": "2024-01-05T13:00:58+00:00",
    "sent_at": "2024-01-05T13:00:53+00:00",
    "date_extracted": "2025-04-03T20:36:12.924243"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU8K46VAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAPCRWNrANQZHldpcl2_Dt58=",
    "from": "info@sietarusa.org",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@sietarusa.org",
    "in_reply_to": "N/A",
    "subject": "REMINDER: Registration for SIETAR USA's January 10 Webinar Is Still Open!",
    "body": "Emotion Labor Webinar ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌\n \n \nView in Web Browser\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nWEBINAR: \n' \nEmotion Labor\n '\nYour Presenters:\nKris Acheson-Clair and Annette Benson\n \n \n \n \n \n \nJANUARY 10th, 2024 @ 11:30 AM (Eastern)\n \n \n \n \n \n \n In this 90-minute session, Kris and Annette will give insight as to how the theory of emotion labor plays out in the workplace, especially in education; how supervisors can use knowledge of this theory to create an inclusive environment; how faculty and staff can avoid burnout from emotion labor through their healthy responses to it; and why the theory of emotion labor might have shortcomings for some populations. Along the way, participants will be given the opportunity to examine their own experiences with emotion labor and reflect on their own more and less effective strategies for managing emotion labor. Participants might be interested in reading \nThe Burnout Spiral: The Emotion Labor of Five Rural U.S. Foreign Language Teachers\n \n \nand/or listen to this \n \npodcast\n \non emotion labor in preparation for the webinar; however, it is not required in order to fully benefit from the webinar.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAbout Your Presenters\nKris Acheson-Clair\nFormerly Georgia State University faculty and Fulbright Scholar to Honduras, Kris is a well-published scholar on intercultural competence, transformative learning theory, emotion labor, and assessment. Kris currently serves as director of Purdue University’s Center for Intercultural Learning, Mentorship, Assessment, and Research (CILMAR). Under her leadership, CILMAR works with the university’s faculty and staff both to put intercultural learning at the heart of study abroad and virtual exchange programs and to embed intercultural learning across the curriculum and student life in order to reach the entire campus. Kris and CILMAR also serve the field of international education by creating scalable experiential and reflective teaching materials, producing cutting-edge scholarship, offering professional development opportunities, and connecting people and resources in the Intercultural Learning Hub (\nhubicl.org\n).\n \n \n \nAbout Your Presenters\nKris Acheson-Clair\nFormerly Georgia State University faculty and Fulbright Scholar to Honduras, Kris is a well-published scholar on intercultural competence, transformative learning theory, emotion labor, and assessment. Kris currently serves as director of Purdue University’s Center for Intercultural Learning, Mentorship, Assessment, and Research (CILMAR). Under her leadership, CILMAR works with the university’s faculty and staff both to put intercultural learning at the heart of study abroad and virtual exchange programs and to embed intercultural learning across the curriculum and student life in order to reach the entire campus. Kris and CILMAR also serve the field of international education by creating scalable experiential and reflective teaching materials, producing cutting-edge scholarship, offering professional development opportunities, and connecting people and resources in the Intercultural Learning Hub (\nhubicl.org\n).\n \n \n \n \n \n \n \n \n \n \nAbout Your Presenters\nAnnette Benson\nSince 2003, Annette Benson has served in a variety of administrative roles at Purdue University, including oversight of an ESOL program, HR training in diversity and inclusion, creation of integration and intercultural learning programs, management of the Intercultural Learning Hub, and public relations for the burgeoning CILMAR. Annette holds a Master of Science degree in strategic communication from Purdue’s Brian Lamb School of Communication. She comments that one of the kindest things a supervisor ever did for her was to discuss emotion labor with her.\n \n \n \nAbout Your Presenters\nAnnette Benson\nSince 2003, Annette Benson has served in a variety of administrative roles at Purdue University, including oversight of an ESOL program, HR training in diversity and inclusion, creation of integration and intercultural learning programs, management of the Intercultural Learning Hub, and public relations for the burgeoning CILMAR. Annette holds a Master of Science degree in strategic communication from Purdue’s Brian Lamb School of Communication. She comments that one of the kindest things a supervisor ever did for her was to discuss emotion labor with her.\n \n \n \n \n \n \n \n \nNon-Member Registration \n \n \n \n \n \n \n \nMember-Register \n \n \n \n \n \n \nUnsubscribe\n | Sent by SIETAR USA \n4880 Lower Roswell Rd, Suite 165 • Marietta , GA • 30068",
    "received_at": "2024-01-04T18:04:04+00:00",
    "sent_at": "2024-01-04T18:00:14+00:00",
    "date_extracted": "2025-04-03T20:36:13.824192"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU6lO7nAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAJjFZiE9FeRCqUsFA1gXhRk=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "When perks come with a price",
    "body": "Plus: accepting advice and measuring ad efficacy. \nWhen perks come with a price  ·  \nView in browser\n \nThe Insightful Leader\nBY \nKELLOGG INSIGHT\nLeadership advice from the Kellogg School of Management at Northwestern University\nHappy New Year!\nI did some traveling over the holidays. Naturally, the minute I got back, I started thinking about my \nnext\n vacation. Destination: anywhere warmer and sunnier than Chicago right now. \nAnd like a lot of us, I wondered whether I could somehow game my credit-card rewards to snag a free trip. \nBut new research from \nLulu Wang\n, an assistant professor of finance, shows that these kinds of credit-card perks are actually costing us all. This week, we’ll explain where all the freebies are coming from and why they aren’t actually free. We’ll also share some advice from Kellogg’s associate dean of digital innovation, \nMohanbir Sawhney\n, on the art of accepting advice.\nNot so rewarding?\nWhy is it that credit-card companies seem so eager to give certain customers airline miles and cash back?\n \nWang’s research shows that rewards are one of the best ways for credit-card companies to compete for customers. After all, as consumers, we have lots of choices about how to pay; rewards help companies achieve that coveted “top of wallet” status. \nThe difficulty, however, is that credit-card companies fund rewards through the fees they charge to merchants. And in the U.S., those fees have gotten very high: about 2.2 percent of the total transaction cost, on average.\nFaced with higher fees, merchants can either raise prices, which affects customers directly. Or they simply eat the cost—which makes them more likely to struggle and close. “Consumers also take a hit from that, even if it isn’t in the prices of goods that they’re buying,” Wang says. “There’s one fewer coffee shop to go to or one fewer nice seller of clarinets.”\nIt’s also worth remembering that lots of Americans don’t have incomes or credit scores that provide access to the most desirable credit cards. This means that debit-card and cash users, who tend to be lower income, are essentially paying for the credit rewards enjoyed by wealthier Americans.\nSo, can the system be improved?\nWang’s study uses mathematical modeling to test several commonly proposed methods of doing just that. Capping merchant fees, as well as encouraging more debit-card usage, would be “the most robust policy,” he says.\nMeanwhile, for consumers trying to decide how to feel about using rewards credit cards, Wang says there are no easy answers.\n“The rational consumer response is, do whatever makes sense for your own financial health and get the rewards if you want,” he says. “The ethicist might say something like, would you be willing to put $100 in your pocket by stealing a penny from 10,000 people?”\nYou can read more about Wang’s research \nhere\n.\nWords of wisdom\nOver on \nLinkedIn\n, Mohanbir Sawhney, who is also a clinical professor of marketing, had some great tips on receiving “the gift of advice.” (Psst, you can \nfollow \nKellogg Insight\n on LinkedIn\n, too. That’s \nmy\n advice for today.) \nHere are a few of his recommendations:\n“Would you be open to changing your course of action based on the advice you might get? If the answer is a firm no, then don’t take advice! Readiness to embrace advice means taking advice with the intent to understand and possibly act upon it.\n“Get enough advice so that you have a variety of perspectives and diversity of opinions, but not so much advice from so many people that you get confused and overwhelmed. More advice is not always better.\n“After collecting advice, spend time to reflect. Synthesize the advice with your knowledge and values. Then, listen to your gut to decide the course of action. This will ensure that your actions combine the perspectives of advisors with your values and your goals.”\nYou can read the whole post \nhere\n.\n“Advertisers fundamentally want to know what happens to somebody who sees the ad compared to somebody who doesn’t.”\n— Professor of marketing \nFlorian Zettelmeyer\n, in \nKellogg Insight\n, on the challenge of measuring digital ad efficacy.\nSee you next week!\nSusie Allen, senior research editor\nKellogg Insight\n  \nYou should follow us on \nTwitter\n or \nLinkedIn\n.\nAnd listen to our \npodcasts\n.\nFeedback\n  ·  \nUnsubscribe\n  ·  \nAbout Us\n© Kellogg School of Management, Northwestern University.",
    "received_at": "2024-01-03T12:03:47+00:00",
    "sent_at": "2024-01-03T12:03:41+00:00",
    "date_extracted": "2025-04-03T20:36:13.689056"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU6lO7mAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQANcV6MYYEv1IstFaaJAvrzc=",
    "from": "info@godfreyhotelchicago.com",
    "to": "felicia@lcwmail.com",
    "reply_to": "210l0ab0bu12i0cv0bn0am0fd0e112p0e80bl0af00@u.zmaildirect.com",
    "in_reply_to": "N/A",
    "subject": "January News",
    "body": "Stay More, Save More. \n \n \n \n \nJAN 2024\n \nStart the new year with a stay at The Godfrey Hotel Chicago in River North. Escape the ordinary and discover your element with us. Our hotel isn't just a place to stay; it's a sanctuary designed for comfort and individuality. Enjoy January rates starting at $99 per night for\n \nmembers\n. \nSign up now and plan a stay that's all about your comfort and style.\nBOOK NOW\nStay More, Save More\nTREAT YOURSELF TO THE SUITE LIFE\n \nGet 30% off suites when you book for three nights or more. Add up to three enhancements to your stay, like discounted spa services. Book our King Suite and save - it comes with a king bed, living room, sleeper sofa, and workspace. Experience luxury in River North with great accommodations and amenities\nBOOK NOW\n \nMore than just a place to stay. The Godfrey Chicago is a relaxing retreat. Perfect for business or leisure.\nEXPLORE OUR ROOMS & SUITES\nWarm Up Inside an Igloo\nOPEN TUESDAY - SUNDAY\n \nCozy up this winter in our heated igloos at IO Godfrey! ? Book your unique urban retreat now and elevate your experience with unforgettable rooftop views and warm comfort.\nTAP TO EXPLORE AND BOOK YOUR IGLOO\n \nHAPPY HOUR\nTuesday-Friday at I|O Godfrey\nGrab your friends and co-workers and join us for great deals on food and drinks. Tues-Thur: 2pm-5pm; Fri: 12pm-3pm.\nVIEW THE MENU \n \nGODFREY WINE FEST\nSaturday, April 27, 1pm-5pm\nWine lovers rejoice! Our Wine Fest is returning, bigger and better. Enjoy four hours of wine tastings and more!\nBUY TICKETS \nCorporate Events that STAND OUT! \n \nNamed \"America's Coolest Rooftop Bar\" by Travel & Leisure Magazine\nOpen Year Round • High-Design Ambiance\nRetractable Roof • Unique Indoor|Outdoor Capability • Waterfall\nGarden Oasis • Customizable Video Wall • Hors D'Oeuvres\nBar Packages • Groups 20-750\nElevate your next corporate event into a memorable experience. Contact Sandi Robinson to begin the planning process!\nSTART PLANNING\n \nTAKE A LOOK AT OUR OTHER LOCATIONS\n \nTHE GODFREY HOTEL HOLLYWOOD\n \nTHE GODFREY HOTEL BOSTON\n \nTHE GODFREY HOTEL DETROIT\n \nNEED TO RESCHEDULE?\nWe are amending our standard cancellation policy for the time being. You can reschedule or cancel your stay if booked direct up to 24 hours prior. Please contact us at (312) 649-2000 or \nFrontDesk@godfreyhotelchicago.com\n for more information.\n \n \n1\n27 West Huron at LaSalle, Chicago, IL 60654\nMain Line: \n(312) 649-2000\nFrontDesk@godfreyhotelchicago.com\n \n \n \n \n \nView in browser\n | \nUnsubscribe",
    "received_at": "2024-01-02T15:03:47+00:00",
    "sent_at": "2024-01-02T15:03:35+00:00",
    "date_extracted": "2025-04-03T20:36:14.400433"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU5PYaUAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAPjMyO9gK-5MhYfsHlJtrtk=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Best of 2023",
    "body": "Enjoy some of Insight's favorite stories from the past year.\n \nDecember 31, 2023\nView in Browser\n \n \n \n \n \n \nAs we head into 2024, we are so grateful to you, our subscribers, for your continued readership. Please enjoy some of \nKellogg Insight's\n favorite stories from 2023. \n \nJess Love\nEditor in Chief,\n \nKellogg Insight\n \n \n \n \nAI\n \n \nChatGPT Has Arrived. What’s a Manager to Do?\n \n4 tips for leading a team in an age of generative AI.\n \n \n2 Factors Will Determine How Much AI Transforms Our Economy\n \nThey’ll also dictate how workers stand to fare.\n \n \nWill AI Eventually Replace Doctors?\n \nMaybe not entirely. But the doctor–patient relationship is likely to change dramatically.\n \n \n \n \nLEADERSHIP\n \n \nLeaders, Don’t Be Afraid to Admit Your Flaws\n \nWe prefer to work for people who can make themselves vulnerable, a study finds. But there are limits.\n \n \n5 Tips for Growing as a Leader without Burning Yourself Out\n \nA leadership coach and former CEO on how to take a holistic approach to your career.\n \n \n \n \nFINANCE & ACCOUNTING\n \n \nWhat Went Wrong at Silicon Valley Bank?\n \nAnd how can it be avoided next time? Analysis sheds light on vulnerabilities within the U.S. banking industry.\n \n \nWhat Is the Purpose of a Corporation Today?\n \nHas anything changed since the Business Roundtable declared firms should prioritize more than shareholders?\n \n \nThe More Investors Know, the More Executives Disclose\n \nCEOs are likelier to volunteer bad news when the public better understands their personal motives for maximizing short-term stock prices.\n \n \nOne Key to a Happy Marriage? A Joint Bank Account.\n \nMerging finances helps newlyweds align their financial goals and avoid scorekeeping.\n \n \n \n \nMARKETING\n \n \nHow Much Do Boycotts Affect a Company’s Bottom Line?\n \nThere’s often an opposing camp pushing for a “buycott” to support the company. Research shows which group has more sway.\n \n \nA Better Way to Measure Customers’ Willingness to Pay\n \nDetermining what customers will spend on your product is one of marketing’s oldest challenges. But “current methods don’t consider context and competition the way they should.”\n \n \n \n \nCAREERS\n \n \nKnowing Your Boss’s Salary Can Make You Work Harder—or Slack Off\n \nYour level of motivation depends on whether you have a fair shot at getting promoted yourself.\n \n \n3 Tips for Reinventing Your Career After a Layoff\n \nIt’s crucial to reassess what you want to be doing instead of jumping at the first opportunity.\n \n \n \n \nWebinar\n \nThe Insightful Leader Live: Your Journey to the Boardroom\n \nIn this complimentary webinar Victoria Medvec will explain how you can prepare yourself to become “board-ready,” pitch yourself to others, and evaluate opportunities that come your way. \nJoin us, Thursday, January 11 at 12pm CST.\nRegister\n \n \n \n \n \nLooking for more?\n Browse our \nlatest articles on our site\n. And a recap of our podcasts from 2023 in last week's newsletter.\n \nShare this email!\n Forward \nKellogg Insight \nnewsletters to friends and colleagues. \n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2023-12-31T12:07:45+00:00",
    "sent_at": "2023-12-31T12:07:37+00:00",
    "date_extracted": "2025-04-03T20:36:14.700565"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU2G5RBAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQABlhHGotAKNCmrLGYALl3cw=",
    "from": "info@sietarusa.org",
    "to": "felicia@lcwmail.com",
    "reply_to": "info@sietarusa.org",
    "in_reply_to": "N/A",
    "subject": "SIETAR USA 2024 Conference - Register TODAY!",
    "body": "Join us for this virtual event - February 2024! ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌\n \n \nView in Web Browser\n \n \n \n \n \n \n \n \n \n \n \n \nStart 2024 by Investing in Yourself: \nRegister Today!\n \n \n \n \nSIETAR USA 2024 Virtual Conference\nFebruary 22 - 24, 2024\n \n \n \n \n \n\"An investment in self-development pays the highest dividends.\"\nDebasish Mridha\nWe never hesitate to spend money on others, but when it comes to ourselves? It seems like there's always something else that takes precedence.\nBreak that habit in 2024 and invest in yourself by signing up to attend the SIETAR USA Virtual Conference! The knowledge, connections, and inspiration you'll gain from the conference will have a positive impact on your job performance, business growth, or professional path. Who can't use more of that?\n \n \n \n \n \n \n \nJust click the 'Register NOW' button below to sign up (ticket options are listed down the right-hand side of the page), and then check out the conference agenda and get your profile ready.\nWe hope to \"see\" you there!\nYour SIETAR USA Conference Team\n \n \n \n \n \n \n \n \nRegister NOW \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUnsubscribe\n | Sent by SIETAR USA \n4880 Lower Roswell Rd, Suite 165 • Marietta , GA • 30068",
    "received_at": "2023-12-27T15:01:07+00:00",
    "sent_at": "2023-12-27T15:00:25+00:00",
    "date_extracted": "2025-04-03T20:36:15.129042"
  },
  {
    "email_id": "AAMkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMABGAAAAAAC63xyYg2U4Q6edqRSKrNHwBwDjTcf_1E96SI8mNxbJLDuwAAAAAAEMAADjTcf_1E96SI8mNxbJLDuwAAU0TDBCAAA=",
    "conversation_id": "AAQkAGRjYjg3ZWUxLWZjNTEtNGEzNy05MTgzLWIxZDY3ZWE2Y2NhMAAQAKKc6qKnaHpMh2q47sVli7M=",
    "from": "insight@kellogg.northwestern.edu",
    "to": "felicia@lcwmail.com",
    "reply_to": "insight@kellogg.northwestern.edu",
    "in_reply_to": "N/A",
    "subject": "Podcasts. Wrapped.",
    "body": "A few of our favorite podcasts from 2023.\n \nDecember 24, 2023\nView in Browser\n \n \n \n \n \n \nTraveling. Cooking. Gift-wrapping. These are all great times to connect with family—or pop in the headphones and listen to \nThe Insightful Leader\n.\n We've picked a few episodes from our archives that we think you might find pretty relevant right now.\n \nLaura Marie Pavin\nMultimedia Editor,\n \nKellogg Insight\n \n \n \n \nREFLECTION\n \n \nDoes Your Life Reflect What You Value?\n \nA former CEO explains how to organize your life around what really matters—instead of trying to do it all.\n \nRead the full transcript\n | \nListen on Apple Podcasts\n | \nListen on Spotify\n \n \n \nThe Case for Admitting (Some) Flaws at Work\n \nNext year, consider showing some vulnerability.\n \nRead the full transcript\n | \nListen on Apple Podcasts\n | \nListen on Spotify\n \n \n \n \n \nSTRESS\n \n \nWorkers Are Stressed Out. Here’s How Leaders Can Help.\n \nStill fretting about work? Reframing setbacks, and instituting some serious calendar discipline, can go a long way toward reducing stress.\n \nRead the full transcript\n | \nListen on Apple Podcasts\n | \nListen on Spotify\n \n \n \n \n \nLUXURY GIFTS\n \n \nSo You Want to Be a Luxury Brand\n \nYour mom wants an Hermès scarf for Christmas. Why is it 600$? On this episode, we explore how luxury works its magic on us.\n \nRead the full transcript\n | \nListen on Apple Podcasts\n | \nListen on Spotify\n \n \n \nWhy Canada Goose Soared and Shinola Sputtered\n \nLuxury is dominated by older brands. So what happens when newer entrants try to break through?\n \nRead the full transcript\n | \nListen on Apple Podcasts\n | \nListen on Spotify\n \n \n \n \n \nAWKWARD CONVERSATIONS\n \n \nHow to Discuss Politics When You Disagree\n \nTalking politics in this polarized climate is a dicey proposition. An expert in the psychology of persuasion offers tips on how to approach the topic constructively.\n \nRead the full transcript\n | \nListen on Apple Podcasts\n | \nListen on Spotify\n \n \n \n \n \n \n \nFeedback\nUnsubscribe\nAbout Us\n \n© Kellogg School of Management, Northwestern University.",
    "received_at": "2023-12-24T12:07:46+00:00",
    "sent_at": "2023-12-24T12:07:38+00:00",
    "date_extracted": "2025-04-03T20:36:15.454228"
  }
]