[
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAQ4WWtoAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAJ0yjtbDxYVBldP0QOdxuss=",
    "from": "info@advancingjustice-chicago.org",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "info@advancingjustice-chicago.org",
    "in_reply_to": "N/A",
    "subject": "Navigating Uncertainty",
    "body": "March 2025 Newsletter    |      \nView this email in your browser\n \n \nDear friend,  \nThe times we are living in are deeply unsettling. As we approach the milestone of President Trump's first 100 days in office, many of our community members are feeling fear, worry, and overwhelm amid a whirlwind of executive orders and multiple reports of arbitrary green card and visa revocations.  The looming threat of a travel ban and troubling detainments of tourists and valid visa holders at airports have only intensified these anxieties. \nThe recent ICE arrests and detainments of Mahmoud Khalil and Rumeysa Ozturk – and the attempted arrest of Yunseo Chung – are stark reminders that activists, organizers, and anyone speaking out could face similar consequences. With each new arbitrary arrest, the Trump administration is curtailing freedom of speech and violating the core tenets of our democracy. We must fight back against each new injustice and the rising tide of authoritarianism.\nAt Advancing Justice | Chicago, we are joining together with our allies to reject the Trump administration’s cruel agenda. Earlier this week, I stood alongside the Illinois Coalition for Immigrant and Refugee Rights in\n condemning the rumored travel ban\n, which will restrict travel from more than 40 countries across Africa, Asia, and the Middle East. Our members will be joining a \nmass mobilization on April 5th\n to send a clear message that Chicagoans reject President Trump and Elon Musk’s attacks on our communities. And we continue to organize concerned community members to advocate for local policy change to strengthen immigrant rights in Illinois.\nJoin us in making Illinois welcoming for all by attending Asian American Action Day on April 30th! Every year, the Pan-Asian Voter Empowerment Coalition mobilizes 300 Asian American community members to flood the state capitol in Springfield and advocate for our shared legislative agenda. This year, our priorities include: \nStrengthening the Illinois TRUST Act, which prohibits collaboration between ICE and local police; \nIncreasing funding for immigrant-serving organizations to provide language access, legal services, citizenship classes, and other critical services; \nFunding inclusive history implementation at the K-12 level; and \nEstablishing a cultural and religious calendar for K-12 schools. \nAs we transition into spring, I hope you can join us in taking action and find ways to stay resilient. Although the challenges we face may feel overwhelming, we can find strength in community and work together to get through these trying times. \nWith gratitude, \n \n \nGrace Pai\nExecutive Director\nAsian Americans Advancing Justice | Chicago\n \nNewsletter at a glance:\n \nPress Conference Condemning Rumored \nTravel Ban  \nRemembering Tuyet Le\nSave the Date: AAA Day! April 30th, 2025 \nPartner with us for AAPI Heritage Month!\nIn the News\nI Speak Power Updates\nKINETIC Updates\nA Just Chi Updates\nMonthly Donor Raffle Winner!\n Chicago’s Immigrant Leaders Hold\nPress Conference  \nAhead of the Anticipated Trump Travel Ban\n \nPhoto Credit: Max Herman/Borderless Magazine\nOn March 26, 2025, Advancing Justice | Chicago joined Chicago’s immigrant community leaders to address the escalating situation at airports across the country. Describing it as an effective travel ban, the leaders highlighted numerous reports that foreign nationals and permanent residents are being singled out, detained, denied entry, and deported to third countries against their will. Speaking at the press conference, Advancing Justice | Chicago’s executive director Grace Pai described these incidents as “authoritarian and unjust.” \nPresident Trump's leaked travel ban would restrict entry from 43 countries in the Middle East, Africa, and Asia. The draft, which has not yet been officially enacted, would impose a near-total ban on travel from countries such as Afghanistan, Iran, and Syria, while heavily restricting travel from 32 other nations. Because more than half of all Asian Americans immigrated to the U.S. from another country, Asian Americans would be particularly impacted by the proposed travel ban. Not only would family members lose the ability to visit each other for weddings, graduations, and funerals, but countless family visa and employment visa applications would also be put on indefinite hold. \nThe press conference received extensive media coverage, with 10 outlets present. Please visit our website to view all media coverage from the event.   \nChicago's Immigrant Leaders Rally Against Trump's Travel Ban Plans\nFederal Plaza rally targets proposed Trump travel ban 2.0 | WGN-TV\n Remembering Tuyet Le\n \nThe Chicago Tribune published an obituary for former executive director of Advancing Justice | Chicago, \nTuyet Le\n, celebrating her life’s work and her enduring impact on the fight for immigrant rights. Though Tuyet is no longer with us, her legacy continues through the work she inspired at Advancing Justice | Chicago and in the hearts of those she touched.  \n \nSave the Date: AAA Day!\nApril 30th, 2025\n \nWe are getting closer to the Pan-Asian Voter Empowerment (PAVE) Coalition’s 12th annual Asian American Action Day (AAA Day) on April 30th in Springfield, Illinois! \nThe PAVE Coalition consists of 19 Asian American advocacy and direct service organizations in the Chicagoland area. Founded in 2011, the PAVE Coalition focuses on increasing voter turnout and civic participation among Asian Americans and improving the lives of Asian Americans through advocacy and policy change.  \nIn 2012, PAVE held the first Asian American Advocacy Day and launched the Asian American Caucus in Springfield. Policy is passed through stories. AAA Day gives us the opportunity to share our personal stories with elected officials and bring our demands to the forefront! \n \nWe are excited to announce registration is now open to join us in Springfield! Please take a moment to use this \nlink\n to join us. \n \nPartner with us for\nAAPI Heritage Month!\nGet ready to celebrate AAPI Heritage Month with us this May! Every year, Asian Americans Advancing Justice | Chicago partners with local restaurants, bars, shops, and businesses to bring awareness to and fundraise for our work.  \nWe are looking to use AAPI Heritage Month as a time for our community members and local businesses to come together, give back, and make a difference.  \n \nPictured Above: Chef Sherrie Tan speaks to attendees of the AANHPI Chef Collaboration Dinner. Hosted at BiXi Beer last year, proceeds from the dinner went to Advancing Justice | Chicago for AAPI Heritage Month. Other participating chefs included: Bo Fowler, Thai Dang, Margaret Pak, and Won Kim.  Photo credit: Kristen Mendiola\nWe invite local businesses based in Chicago and beyond to partner with Asian Americans Advancing Justice | Chicago this May. Businesses can participate in the following ways: \n \nShare a portion of proceeds from an item  \nHost a small fundraising event \nProvide an in-kind donation \nPlease help us expand our partnerships by: \n \nReferring any local business, you know to our partner pledge form below \nAttending AAPI Heritage Month fundraisers in May (be on the lookout for more information!) \nPatronizing the local businesses that are supporting us, once the list is announced! \nIf you are a business interested in partnering with us this spring, please fill out our pledge form at \nbit.ly/HM25chi\n or click the button below by \nMonday, April 21st\n. Please contact \nfundraising@advancingjustice-chicago.org\n if you have any questions. \n \nHeritage Month Partner Form\n \n In the News\n \nOur Executive Director, Grace Pai, was featured on WBBM's weekly radio show, \"At Issue,\" on Sunday, March 9th, 2025, to discuss the recent anti-immigrant executive orders and their impact on Asian American communities. \nHosted by award-winning journalist Craig Dellimore, the episode explored President Trump’s executive order establishing English as the official language of the U.S., the historical scapegoating of Asian Americans, and the effects of mass deportations on immigrant communities. Grace also took a moment to reflect on the legacy of Tuyet Le, Advancing Justice | Chicago's former executive director, who passed away last month. \nWe invite you to listen to Grace’s thoughtful and impactful interview! Here is the link: \nImmigration's Impact on Asian American Communities\n \n I Speak Power \nAs the challenges of 2025 continue, ISP members and core leaders have remained focused on critical topics such as Know Your Rights/Know Your Power, Language Justice, and Immigration Justice.  During the holy month of Ramadan, many of our participants observe fasting and prayer, which has affected the scheduling of our weekly group meetings and workshops. However, we’ve stayed committed by offering individual sessions to each participant, allowing for personalized mentorship. Looking ahead, we are preparing for an immigration justice workshop set for April 5th.\nKINETIC Updates\n \nIn March, KINETIC leaders hosted a workshop exploring the intersection of mutual aid and Know Your Rights (KYR) work. The event featured discussions on what mutual aid is—and what it is not—highlighting various examples of the practice both in Chicago and beyond. A central focus was how Know Your Rights initiatives align with the broader framework of mutual aid. \nAfter the workshop, KINETIC youth led a Know Your Rights canvass in Chinatown with ORIGIN, the Coalition for a Better Chinese American Community's youth group. Together, they talked to community members and local businesses about their experiences with immigration enforcement and distributed KYR materials in Chinese, English, and Spanish. \nOur April general meeting will be held on April 17th from 5:00–7:00 PM. Stay tuned for updates on social media and please email \njwang@advancingjustice-chicago.org \nfor the sign-up form. \nKINETIC is a space for Asian Pacific Islander Desi high school youth, including multi-racial folks, to build community with other progressive Asian American students and develop as youth leaders and organizers. Drawing on their lived experiences and learning through political education, KINETIC leaders will participate in and lead issue campaigns on policies impacting their communities. Youth can sign up through the interest form below.\nKINETIC Interest Form!\n \nA Just Chi Updates\nIn March, A Just Chi welcomed community organizer Zhang Mazi to facilitate “China: A Radical Re-Introduction.” Given ongoing US-China rivalry and the Trump administration’s new tariffs, this workshop offered timely insights and context. Zhang shared a brief history of modern China, answered common questions to provide a more nuanced understanding, and shared resources to help members think more critically about the US-China relationship.  \nA Just Chi’s April General Meeting is on Wednesday, April 16th from 6-7:30. Please check our social media for updates! You can register at \nbit.ly/AJustChi2025\n. \n \nA Just Chi is a space for Asian American grassroots activists, organizers, and volunteers. We have a general meeting every third Wednesday of the month for political education, workshops, moving our issue-based campaigns, and planning upcoming events. A Just Chi is specifically for Asian/Asian American community members, including multi-racial people. New folks are always welcome! \n \nBecome a monthly donor!\n  \nOur March donor of the month is \nDesiree Bote\n! Congratulations! You win a 10-pass gift certificate to any \nFirst Ascent\n location. Thank you for your continued support!  \nEach month, Asian Americans Advancing Justice | Chicago selects a recurring donor for a special raffle prize. If you’d like a chance to win while supporting us, \nsign up to be a recurring donor today!\n \nDONATE TODAY! \n \n \n \n \n \n \nCopyright © *|2025|* *|Advancing Justice | Chicago|*, All rights reserved.\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.\ninfo@advancingjustice-chicago.org \n ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏",
    "received_at": "2025-03-28T21:38:30+00:00",
    "sent_at": "2025-03-28T21:38:03+00:00",
    "date_extracted": "2025-04-01T20:33:45.512208"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAQyG5a9AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQABO59UE-hENFjGdTgnFBzew=",
    "from": "postmaster@lcwmail.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "postmaster@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "You have new held messages",
    "body": "You have new held messages\nYou can release all of your held messages and permit or block future emails from the senders, or manage messages individually.\nRelease all\n   \nPermit all\n   \nBlock all\n   \n \nYou can also manage held messages in your \nPersonal Portal\n.\n \nGraymail\ndavidb@expensify.com\n[Expensify] ¡Ahora en español! (Now with full Spanish support!)\n2025-03-18 15:58\nRelease\n   \nPermit\n   \nBlock\n   \n \n \nRelease all\n   \nPermit all\n   \nBlock all\n   \n \n \n \n \n© 2025 Mimecast Services Limited and affiliates.",
    "received_at": "2025-03-18T21:07:46+00:00",
    "sent_at": "2025-03-18T21:07:39+00:00",
    "date_extracted": "2025-04-01T20:33:45.623002"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAQkk7LJAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKAQtOlhjnxEtVYVojzGsy0=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Travel and expense, at the speed of chat",
    "body": "tl;dr - Introducing Expensify Travel: fully managed corporate travel via web, app, or chat – now available to every Expensify member\n \nTravel and expense should go hand in hand… and now they can! We've long been asked by customers big and small for the ability to: \nBook flights, hotels, rail, and car rentals from inside the app.\nLimit what inventory employees see to only what is in the authorized travel policy.\nPay for these bookings using a central virtual card.\nCapture the travel receipts into an automatic expense report.\nCut travel costs\nIn \nNew Expensify\n, press the green + button \n> Book travel\n (or in \nExpensify Classic\n, click the \nTravel\n button along the left side of the screen). It does all the things you expect (in-policy booking results, travel-based spend analysis, out-of-policy notices, approvals before booking, duty-of-care reporting), plus a few tricks you don't – courtesy of the realtime chat framework of the New Expensify superapp: \nRealtime duty of care\n, which lets you know where all your employees are at all times. We even connect the traveler and travel manager in a dedicated chat room to discuss all bookings and changes the instant they happen, rather than whenever you get around to checking your inbox.\nRealtime expense management,\n where every booking receipt and change fee is recorded as an expense that's submitted up through Expensify's realtime approval and next-day reimbursement engine: book today, get paid tomorrow!\nRealtime collaboration\n, where shared trip chat rooms are automatically created in New Expensify so that everyone is on the same page. From employees to managers, everything you need to know about your trip, all in one place. \nThe instant, chat-first design of New Expensify is why we like to say that Expensify does:\nTravel and expense at the speed of chat.\nTo check it out, open your Expensify app and click \nTravel\n, or take a peek below!\nIt's one of the most exciting times to be at Expensify that I can ever remember. We have a \nlot\n going on, and it's energizing to be sharing it with you after so long in development. Keep an eye out for a ton more on the way!\n-david\nFounder and CEO of Expensify\nQuestions? Ask me in the \n#new-expensify-feedback\n room! \nPS: Check out OpenAI's work on building an \nartificial engineer\n to solve Expensify App open source projects!\nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2025-02-26T08:04:04+00:00",
    "sent_at": "2025-02-26T08:03:56+00:00",
    "date_extracted": "2025-04-01T20:33:46.350399"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAPHCktKAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAN5xG2etp2JJi1SNhPcJsmg=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "Quick question about Expensify",
    "body": "Hello,\nConsidering your experience with us so far, how likely are you to recommend Expensify to someone in your personal or professional network?\n0\n   \n1\n   \n2\n   \n3\n   \n4\n   \n5\n   \n6\n   \n7\n   \n8\n   \n9\n   \n10\n0 = not likely\n10 = very likely\nWe look forward to hearing from you!\nTo unsubscribe, click \nhere\n.",
    "received_at": "2024-10-07T19:19:23+00:00",
    "sent_at": "2024-10-07T19:19:14+00:00",
    "date_extracted": "2025-04-01T20:34:02.694104"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAOat6muAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKMOL7BxNHNNqFmAzJqi1dY=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Updated Terms of Service and Privacy Policy",
    "body": "Hi there,\nWe’ve updated our Terms of Service and Privacy Policy. As always, we’re sending this notification to everyone with an Expensify account. Continued use of Expensify following the update constitutes acceptance of our updated Terms of Service and Privacy Policy.\nReview updated Terms of Service\nReview updated Privacy Policy\nThanks,\nExpensify Team \nPS: This is a one-time required legal notice sent to all Expensify members, even those who have unsubscribed from optional announcements. If you would like to never receive this again, please follow \nthese\n instructions to close your account. Thank you for your understanding. \nSent by: Expensify, Inc - 401 Southwest 5th Avenue Portland, OR 97204",
    "received_at": "2024-08-05T04:13:20+00:00",
    "sent_at": "2024-08-05T04:13:12+00:00",
    "date_extracted": "2025-04-01T20:34:19.958209"
  }
]