[
  {
    "email_id": "AAMkADRlMGQ0Mzc5LTMyMzQtNGEwOC1iZDY0LTc4YjkyZTU2NmQxYwBGAAAAAAAMUS8dAZ0jTbDgCHG1GO1DBwBq7-ubPq5yQala0glsYuWYAAAAAAEMAABq7-ubPq5yQala0glsYuWYAARKx0CJAAA=",
    "conversation_id": "AAQkADRlMGQ0Mzc5LTMyMzQtNGEwOC1iZDY0LTc4YjkyZTU2NmQxYwAQAMDE4JhEqc5KsnTfKjVwmD8=",
    "from": "JJBrandHelp@its.jnj.com",
    "to": "d.gough@lcwmail.com",
    "reply_to": "JJBrandHelp@its.jnj.com",
    "in_reply_to": "N/A",
    "subject": "REMINDER: 2FA coming to brand center",
    "body": "Hello brand partners,\nTo continuously improve our security, on April 9th we will be introducing a two-factor authentication (2FA) step to access the brand center.\nAll external J&J partners will be required to enter a 6-digit identification code via the Google Authenticator app in addition to their password.\nPlease enable this feature now for uninterrupted access to the \nbrand center\n. \nInstructions to set up two-factor authentication\n1. Download Google Authenticator\nIf you haven't already, download Google\nAuthenticator for free from the Apple App\nStore or Google Play Store.\n \n2. Access your account profile in the brand center \nOnce logged in to the brand center, navigate to the bottom left of your screen to find the Frontify nook logo, click on the logo\n \nClick your avatar on the bottom left corner \n(A)\nThen, click on the pencil icon next to your name to edit profile \n(B)\n﻿\n \nIn the side panel, scroll to the Security section\nUnder password, navigate to two-factor authentication and select enable\n \n3. Set up two-factor authentication\nA pop-up window will appear with set up instructions\nImportant note: the QR code is unique each time you enable two-factor authentication.\n﻿\n \n4. Link Google Authenticator to your account\nOpen the Google Authenticator app on your phone\nTap the plus sign [+] on the bottom right \n(A)\nSelect \"Scan a QR code\" \n(B)\n and scan the QR code from your computer screen in the pop-up window\n﻿\n \n5. Enter the verification code\nGoogle Authenticator app will generate a 6-digit code labeled Frontify\nEnter the 6-digit code shown in the set up window\nNote: This code refreshes every 30 seconds.\nYou will also be provided a confirmation window containing 10 unique recovery codes. Copy and store these codes somewhere safe.\nYou'll need these codes if you lose access to your phone or switch devices.\n \n6. Confirm two-factor authentication is enabled\nOnce enabled, a green circle will appear next to two-factor authentication, confirming activation\n \nTo download these instructions for future reference, you can find the PDF \nhere\n*\n.\n*This document is only accessible through the brand center. If it is not downloaded before two-factor authentication is turned on, it will not be available.\nIf you have any questions, email us at \nJJbrandhelp@its.jnj.com\n.",
    "received_at": "2025-04-02T11:12:51+00:00",
    "sent_at": "2025-04-02T11:12:34+00:00",
    "date_extracted": "2025-04-02T20:03:26.381224"
  }
]