[
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAQ4WWtoAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAJ0yjtbDxYVBldP0QOdxuss=",
    "from": "info@advancingjustice-chicago.org",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "info@advancingjustice-chicago.org",
    "in_reply_to": "N/A",
    "subject": "Navigating Uncertainty",
    "body": "March 2025 Newsletter    |      \nView this email in your browser\n \n \nDear friend,  \nThe times we are living in are deeply unsettling. As we approach the milestone of President Trump's first 100 days in office, many of our community members are feeling fear, worry, and overwhelm amid a whirlwind of executive orders and multiple reports of arbitrary green card and visa revocations.  The looming threat of a travel ban and troubling detainments of tourists and valid visa holders at airports have only intensified these anxieties. \nThe recent ICE arrests and detainments of Mahmoud Khalil and Rumeysa Ozturk – and the attempted arrest of Yunseo Chung – are stark reminders that activists, organizers, and anyone speaking out could face similar consequences. With each new arbitrary arrest, the Trump administration is curtailing freedom of speech and violating the core tenets of our democracy. We must fight back against each new injustice and the rising tide of authoritarianism.\nAt Advancing Justice | Chicago, we are joining together with our allies to reject the Trump administration’s cruel agenda. Earlier this week, I stood alongside the Illinois Coalition for Immigrant and Refugee Rights in\n condemning the rumored travel ban\n, which will restrict travel from more than 40 countries across Africa, Asia, and the Middle East. Our members will be joining a \nmass mobilization on April 5th\n to send a clear message that Chicagoans reject President Trump and Elon Musk’s attacks on our communities. And we continue to organize concerned community members to advocate for local policy change to strengthen immigrant rights in Illinois.\nJoin us in making Illinois welcoming for all by attending Asian American Action Day on April 30th! Every year, the Pan-Asian Voter Empowerment Coalition mobilizes 300 Asian American community members to flood the state capitol in Springfield and advocate for our shared legislative agenda. This year, our priorities include: \nStrengthening the Illinois TRUST Act, which prohibits collaboration between ICE and local police; \nIncreasing funding for immigrant-serving organizations to provide language access, legal services, citizenship classes, and other critical services; \nFunding inclusive history implementation at the K-12 level; and \nEstablishing a cultural and religious calendar for K-12 schools. \nAs we transition into spring, I hope you can join us in taking action and find ways to stay resilient. Although the challenges we face may feel overwhelming, we can find strength in community and work together to get through these trying times. \nWith gratitude, \n \n \nGrace Pai\nExecutive Director\nAsian Americans Advancing Justice | Chicago\n \nNewsletter at a glance:\n \nPress Conference Condemning Rumored \nTravel Ban  \nRemembering Tuyet Le\nSave the Date: AAA Day! April 30th, 2025 \nPartner with us for AAPI Heritage Month!\nIn the News\nI Speak Power Updates\nKINETIC Updates\nA Just Chi Updates\nMonthly Donor Raffle Winner!\n Chicago’s Immigrant Leaders Hold\nPress Conference  \nAhead of the Anticipated Trump Travel Ban\n \nPhoto Credit: Max Herman/Borderless Magazine\nOn March 26, 2025, Advancing Justice | Chicago joined Chicago’s immigrant community leaders to address the escalating situation at airports across the country. Describing it as an effective travel ban, the leaders highlighted numerous reports that foreign nationals and permanent residents are being singled out, detained, denied entry, and deported to third countries against their will. Speaking at the press conference, Advancing Justice | Chicago’s executive director Grace Pai described these incidents as “authoritarian and unjust.” \nPresident Trump's leaked travel ban would restrict entry from 43 countries in the Middle East, Africa, and Asia. The draft, which has not yet been officially enacted, would impose a near-total ban on travel from countries such as Afghanistan, Iran, and Syria, while heavily restricting travel from 32 other nations. Because more than half of all Asian Americans immigrated to the U.S. from another country, Asian Americans would be particularly impacted by the proposed travel ban. Not only would family members lose the ability to visit each other for weddings, graduations, and funerals, but countless family visa and employment visa applications would also be put on indefinite hold. \nThe press conference received extensive media coverage, with 10 outlets present. Please visit our website to view all media coverage from the event.   \nChicago's Immigrant Leaders Rally Against Trump's Travel Ban Plans\nFederal Plaza rally targets proposed Trump travel ban 2.0 | WGN-TV\n Remembering Tuyet Le\n \nThe Chicago Tribune published an obituary for former executive director of Advancing Justice | Chicago, \nTuyet Le\n, celebrating her life’s work and her enduring impact on the fight for immigrant rights. Though Tuyet is no longer with us, her legacy continues through the work she inspired at Advancing Justice | Chicago and in the hearts of those she touched.  \n \nSave the Date: AAA Day!\nApril 30th, 2025\n \nWe are getting closer to the Pan-Asian Voter Empowerment (PAVE) Coalition’s 12th annual Asian American Action Day (AAA Day) on April 30th in Springfield, Illinois! \nThe PAVE Coalition consists of 19 Asian American advocacy and direct service organizations in the Chicagoland area. Founded in 2011, the PAVE Coalition focuses on increasing voter turnout and civic participation among Asian Americans and improving the lives of Asian Americans through advocacy and policy change.  \nIn 2012, PAVE held the first Asian American Advocacy Day and launched the Asian American Caucus in Springfield. Policy is passed through stories. AAA Day gives us the opportunity to share our personal stories with elected officials and bring our demands to the forefront! \n \nWe are excited to announce registration is now open to join us in Springfield! Please take a moment to use this \nlink\n to join us. \n \nPartner with us for\nAAPI Heritage Month!\nGet ready to celebrate AAPI Heritage Month with us this May! Every year, Asian Americans Advancing Justice | Chicago partners with local restaurants, bars, shops, and businesses to bring awareness to and fundraise for our work.  \nWe are looking to use AAPI Heritage Month as a time for our community members and local businesses to come together, give back, and make a difference.  \n \nPictured Above: Chef Sherrie Tan speaks to attendees of the AANHPI Chef Collaboration Dinner. Hosted at BiXi Beer last year, proceeds from the dinner went to Advancing Justice | Chicago for AAPI Heritage Month. Other participating chefs included: Bo Fowler, Thai Dang, Margaret Pak, and Won Kim.  Photo credit: Kristen Mendiola\nWe invite local businesses based in Chicago and beyond to partner with Asian Americans Advancing Justice | Chicago this May. Businesses can participate in the following ways: \n \nShare a portion of proceeds from an item  \nHost a small fundraising event \nProvide an in-kind donation \nPlease help us expand our partnerships by: \n \nReferring any local business, you know to our partner pledge form below \nAttending AAPI Heritage Month fundraisers in May (be on the lookout for more information!) \nPatronizing the local businesses that are supporting us, once the list is announced! \nIf you are a business interested in partnering with us this spring, please fill out our pledge form at \nbit.ly/HM25chi\n or click the button below by \nMonday, April 21st\n. Please contact \nfundraising@advancingjustice-chicago.org\n if you have any questions. \n \nHeritage Month Partner Form\n \n In the News\n \nOur Executive Director, Grace Pai, was featured on WBBM's weekly radio show, \"At Issue,\" on Sunday, March 9th, 2025, to discuss the recent anti-immigrant executive orders and their impact on Asian American communities. \nHosted by award-winning journalist Craig Dellimore, the episode explored President Trump’s executive order establishing English as the official language of the U.S., the historical scapegoating of Asian Americans, and the effects of mass deportations on immigrant communities. Grace also took a moment to reflect on the legacy of Tuyet Le, Advancing Justice | Chicago's former executive director, who passed away last month. \nWe invite you to listen to Grace’s thoughtful and impactful interview! Here is the link: \nImmigration's Impact on Asian American Communities\n \n I Speak Power \nAs the challenges of 2025 continue, ISP members and core leaders have remained focused on critical topics such as Know Your Rights/Know Your Power, Language Justice, and Immigration Justice.  During the holy month of Ramadan, many of our participants observe fasting and prayer, which has affected the scheduling of our weekly group meetings and workshops. However, we’ve stayed committed by offering individual sessions to each participant, allowing for personalized mentorship. Looking ahead, we are preparing for an immigration justice workshop set for April 5th.\nKINETIC Updates\n \nIn March, KINETIC leaders hosted a workshop exploring the intersection of mutual aid and Know Your Rights (KYR) work. The event featured discussions on what mutual aid is—and what it is not—highlighting various examples of the practice both in Chicago and beyond. A central focus was how Know Your Rights initiatives align with the broader framework of mutual aid. \nAfter the workshop, KINETIC youth led a Know Your Rights canvass in Chinatown with ORIGIN, the Coalition for a Better Chinese American Community's youth group. Together, they talked to community members and local businesses about their experiences with immigration enforcement and distributed KYR materials in Chinese, English, and Spanish. \nOur April general meeting will be held on April 17th from 5:00–7:00 PM. Stay tuned for updates on social media and please email \njwang@advancingjustice-chicago.org \nfor the sign-up form. \nKINETIC is a space for Asian Pacific Islander Desi high school youth, including multi-racial folks, to build community with other progressive Asian American students and develop as youth leaders and organizers. Drawing on their lived experiences and learning through political education, KINETIC leaders will participate in and lead issue campaigns on policies impacting their communities. Youth can sign up through the interest form below.\nKINETIC Interest Form!\n \nA Just Chi Updates\nIn March, A Just Chi welcomed community organizer Zhang Mazi to facilitate “China: A Radical Re-Introduction.” Given ongoing US-China rivalry and the Trump administration’s new tariffs, this workshop offered timely insights and context. Zhang shared a brief history of modern China, answered common questions to provide a more nuanced understanding, and shared resources to help members think more critically about the US-China relationship.  \nA Just Chi’s April General Meeting is on Wednesday, April 16th from 6-7:30. Please check our social media for updates! You can register at \nbit.ly/AJustChi2025\n. \n \nA Just Chi is a space for Asian American grassroots activists, organizers, and volunteers. We have a general meeting every third Wednesday of the month for political education, workshops, moving our issue-based campaigns, and planning upcoming events. A Just Chi is specifically for Asian/Asian American community members, including multi-racial people. New folks are always welcome! \n \nBecome a monthly donor!\n  \nOur March donor of the month is \nDesiree Bote\n! Congratulations! You win a 10-pass gift certificate to any \nFirst Ascent\n location. Thank you for your continued support!  \nEach month, Asian Americans Advancing Justice | Chicago selects a recurring donor for a special raffle prize. If you’d like a chance to win while supporting us, \nsign up to be a recurring donor today!\n \nDONATE TODAY! \n \n \n \n \n \n \nCopyright © *|2025|* *|Advancing Justice | Chicago|*, All rights reserved.\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\n.\ninfo@advancingjustice-chicago.org \n ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏",
    "received_at": "2025-03-28T21:38:30+00:00",
    "sent_at": "2025-03-28T21:38:03+00:00",
    "date_extracted": "2025-04-04T19:35:32.987249"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAQyG5a9AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQABO59UE-hENFjGdTgnFBzew=",
    "from": "postmaster@lcwmail.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "postmaster@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "You have new held messages",
    "body": "You have new held messages\nYou can release all of your held messages and permit or block future emails from the senders, or manage messages individually.\nRelease all\n   \nPermit all\n   \nBlock all\n   \n \nYou can also manage held messages in your \nPersonal Portal\n.\n \nGraymail\ndavidb@expensify.com\n[Expensify] ¡Ahora en español! (Now with full Spanish support!)\n2025-03-18 15:58\nRelease\n   \nPermit\n   \nBlock\n   \n \n \nRelease all\n   \nPermit all\n   \nBlock all\n   \n \n \n \n \n© 2025 Mimecast Services Limited and affiliates.",
    "received_at": "2025-03-18T21:07:46+00:00",
    "sent_at": "2025-03-18T21:07:39+00:00",
    "date_extracted": "2025-04-04T19:35:31.961080"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAQkk7LJAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKAQtOlhjnxEtVYVojzGsy0=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Travel and expense, at the speed of chat",
    "body": "tl;dr - Introducing Expensify Travel: fully managed corporate travel via web, app, or chat – now available to every Expensify member\n \nTravel and expense should go hand in hand… and now they can! We've long been asked by customers big and small for the ability to: \nBook flights, hotels, rail, and car rentals from inside the app.\nLimit what inventory employees see to only what is in the authorized travel policy.\nPay for these bookings using a central virtual card.\nCapture the travel receipts into an automatic expense report.\nCut travel costs\nIn \nNew Expensify\n, press the green + button \n> Book travel\n (or in \nExpensify Classic\n, click the \nTravel\n button along the left side of the screen). It does all the things you expect (in-policy booking results, travel-based spend analysis, out-of-policy notices, approvals before booking, duty-of-care reporting), plus a few tricks you don't – courtesy of the realtime chat framework of the New Expensify superapp: \nRealtime duty of care\n, which lets you know where all your employees are at all times. We even connect the traveler and travel manager in a dedicated chat room to discuss all bookings and changes the instant they happen, rather than whenever you get around to checking your inbox.\nRealtime expense management,\n where every booking receipt and change fee is recorded as an expense that's submitted up through Expensify's realtime approval and next-day reimbursement engine: book today, get paid tomorrow!\nRealtime collaboration\n, where shared trip chat rooms are automatically created in New Expensify so that everyone is on the same page. From employees to managers, everything you need to know about your trip, all in one place. \nThe instant, chat-first design of New Expensify is why we like to say that Expensify does:\nTravel and expense at the speed of chat.\nTo check it out, open your Expensify app and click \nTravel\n, or take a peek below!\nIt's one of the most exciting times to be at Expensify that I can ever remember. We have a \nlot\n going on, and it's energizing to be sharing it with you after so long in development. Keep an eye out for a ton more on the way!\n-david\nFounder and CEO of Expensify\nQuestions? Ask me in the \n#new-expensify-feedback\n room! \nPS: Check out OpenAI's work on building an \nartificial engineer\n to solve Expensify App open source projects!\nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2025-02-26T08:04:04+00:00",
    "sent_at": "2025-02-26T08:03:56+00:00",
    "date_extracted": "2025-04-04T19:35:32.554897"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAPHCktKAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAN5xG2etp2JJi1SNhPcJsmg=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "Quick question about Expensify",
    "body": "Hello,\nConsidering your experience with us so far, how likely are you to recommend Expensify to someone in your personal or professional network?\n0\n   \n1\n   \n2\n   \n3\n   \n4\n   \n5\n   \n6\n   \n7\n   \n8\n   \n9\n   \n10\n0 = not likely\n10 = very likely\nWe look forward to hearing from you!\nTo unsubscribe, click \nhere\n.",
    "received_at": "2024-10-07T19:19:23+00:00",
    "sent_at": "2024-10-07T19:19:14+00:00",
    "date_extracted": "2025-04-04T19:58:53.825578"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAOat6muAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKMOL7BxNHNNqFmAzJqi1dY=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Updated Terms of Service and Privacy Policy",
    "body": "Hi there,\nWe’ve updated our Terms of Service and Privacy Policy. As always, we’re sending this notification to everyone with an Expensify account. Continued use of Expensify following the update constitutes acceptance of our updated Terms of Service and Privacy Policy.\nReview updated Terms of Service\nReview updated Privacy Policy\nThanks,\nExpensify Team \nPS: This is a one-time required legal notice sent to all Expensify members, even those who have unsubscribed from optional announcements. If you would like to never receive this again, please follow \nthese\n instructions to close your account. Thank you for your understanding. \nSent by: Expensify, Inc - 401 Southwest 5th Avenue Portland, OR 97204",
    "received_at": "2024-08-05T04:13:20+00:00",
    "sent_at": "2024-08-05T04:13:12+00:00",
    "date_extracted": "2025-04-04T20:09:04.400092"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAN_BHIhAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAPbyjZFS1QxOjTu6zwR-JKQ=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-fef71c76776206-346_HTML-73101489-536002764-658262@account.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nJUNE 09 - 15\nHere's how your team did last week\nTOP\nWorkday Calendar ▪ Timeline 2024 by Miriam Pörings\n1 editor last week! \nNEW\nCalendario 2024 by Elizabeth Taranto\nPatrick Bach created on Monday Jun, 10. \nINACTIVE\nUntitled\nBoard became inactive when a new was created on Monday Jun, 10. \nGo to dashboard\n \nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nP\nPatrick Bach\n2 boards created\nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2024-06-18T16:18:29+00:00",
    "sent_at": "2024-06-18T16:18:16+00:00",
    "date_extracted": "2025-04-04T20:09:15.416928"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAN6hc7lAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAJyR2FwvpDxCrKBn6XGqCsc=",
    "from": "quarantine@messaging.microsoft.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "quarantine@messaging.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Microsoft 365 security: You have messages in quarantine",
    "body": "Review These Messages\n2 messages\n are being held for you to review as of \n6/13/2024 4:22:27 AM (UTC)\n. \nReview them within \n15 days of the received date\n by going to the \nQuarantine page\n in the Security Center. \nPrevented spam messages \nSender: \nconcierge@expensify.com \n \n \nSubject: \n[Expensify] Updated Terms of Service \n \n \nDate: \n6/7/2024 2:53:50 PM \n \n \nReview Message \nRelease \n \n \n \n \nSender: \ndavidb@expensify.com \n \n \nSubject: \n[Expensify] Unlimited centrally-issued virtual cards are here \n \n \nDate: \n6/11/2024 8:22:25 AM \n \n \nReview Message \nRelease \n \n \n \n \n© 2024 Microsoft Corporation. All rights reserved. \nPrivacy Statement\n \nAcceptable Use Policy\n \n((SignedCardPayload))",
    "received_at": "2024-06-13T07:22:07+00:00",
    "sent_at": "2024-06-13T07:22:04+00:00",
    "date_extracted": "2025-04-04T20:09:16.382727"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAN5RZfHAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAEsbBEYpPipEiAxepiuC8PY=",
    "from": "quarantine@messaging.microsoft.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "quarantine@messaging.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Microsoft 365 security: You have messages in quarantine",
    "body": "Review These Messages\n1 messages\n are being held for you to review as of \n6/11/2024 9:22:26 AM (UTC)\n. \nReview them within \n15 days of the received date\n by going to the \nQuarantine page\n in the Security Center. \nPrevented spam messages \nSender: \ndavidb@expensify.com \n \n \nSubject: \n[Expensify] Unlimited centrally-issued virtual cards are here \n \n \nDate: \n6/11/2024 8:22:25 AM \n \n \nReview Message \nRelease \n \n \n \n \n© 2024 Microsoft Corporation. All rights reserved. \nPrivacy Statement\n \nAcceptable Use Policy\n \n((SignedCardPayload))",
    "received_at": "2024-06-11T09:49:39+00:00",
    "sent_at": "2024-06-11T09:49:36+00:00",
    "date_extracted": "2025-04-04T20:09:19.084602"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAN0djH6AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAH23QcH5qEZOhHgezHZnxnI=",
    "from": "quarantine@messaging.microsoft.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "quarantine@messaging.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Microsoft 365 security: You have messages in quarantine",
    "body": "Review These Messages\n1 messages\n are being held for you to review as of \n6/7/2024 9:20:46 PM (UTC)\n. \nReview them within \n15 days of the received date\n by going to the \nQuarantine page\n in the Security Center. \nPrevented spam messages \nSender: \nconcierge@expensify.com \n \n \nSubject: \n[Expensify] Updated Terms of Service \n \n \nDate: \n6/7/2024 2:53:50 PM \n \n \nReview Message \nRelease \n \n \n \n \n© 2024 Microsoft Corporation. All rights reserved. \nPrivacy Statement\n \nAcceptable Use Policy\n \n((SignedCardPayload))",
    "received_at": "2024-06-07T21:54:37+00:00",
    "sent_at": "2024-06-07T21:54:35+00:00",
    "date_extracted": "2025-04-04T20:09:18.377289"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAANqmokKAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKDNLHZZT8dOmZ9TvMLJqXM=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-fef71c76776206-346_HTML-73101489-536002764-555622@account.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nMAY 12 - 18\nHere's how your team did last week\nTOP\nUntitled\n1 editor last week! \nINACTIVE\nCohort 8: Advancing Inclusion Leaders Session\nBoard became inactive when a new was created on Thursday May, 16. \nGo to dashboard\n \nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nM\nMatthew Dober\n1 board created\nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2024-05-21T15:59:44+00:00",
    "sent_at": "2024-05-21T15:59:38+00:00",
    "date_extracted": "2025-04-04T20:09:21.116866"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAANeuih6AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAF1mzXr-XyxLh0JBF5eeP5g=",
    "from": "quarantine@messaging.microsoft.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "quarantine@messaging.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Microsoft 365 security: You have messages in quarantine",
    "body": "Review These Messages\n1 messages\n are being held for you to review as of \n5/3/2024 1:21:02 AM (UTC)\n. \nReview them within \n15 days of the received date\n by going to the \nQuarantine page\n in the Security Center. \nPrevented spam messages \nSender: \ndavidb@expensify.com \n \n \nSubject: \n[Expensify] Unlimited receipt and distance tracking for sole proprietors and individuals, now free on New Expensify. \n \n \nDate: \n5/2/2024 9:20:20 PM \n \n \nReview Message \nRelease \n \n \n \n \n© 2024 Microsoft Corporation. All rights reserved. \nPrivacy Statement\n \nAcceptable Use Policy\n \n((SignedCardPayload))",
    "received_at": "2024-05-03T01:50:17+00:00",
    "sent_at": "2024-05-03T01:50:12+00:00",
    "date_extracted": "2025-04-04T20:09:25.005607"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAANXNDuFAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQABuRilIsPVNFhcnZbl77UrM=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-fef71c76776206-346_HTML-73101489-536002764-441978@account.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nAPRIL 14 - 20\nHere's how your team did last week\nTOP\nUntitled\n1 editor last week! \nNEW\nUntitled\nMatthew Dober created on Friday Apr, 19. \nINACTIVE\nMind Map\nBoard became inactive when a new was created on Friday Apr, 19. \nGo to dashboard\n \nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nM\nMatthew Dober\n2 boards created\nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2024-04-23T14:05:02+00:00",
    "sent_at": "2024-04-23T14:04:52+00:00",
    "date_extracted": "2025-04-04T20:09:30.660440"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAANLJm_LAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAOMsdyEqz4BGmsl3Yq3FZk0=",
    "from": "no-reply@canva.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "no-reply@canva.com",
    "in_reply_to": "N/A",
    "subject": "You've been removed from Nicole Barile′s team",
    "body": "You don't often get email from no-reply@canva.com. \nLearn why this is important\nYou've been removed from Nicole Barile′s team\n͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ \n \n \nYou've been removed from Nicole Barile′s team\nHey there,\nYour team administrator has removed you from \nNicole Barile′s team\n on Canva. Because of this, you no longer have access to its designs and will need to log back in to your account.\nIf this was a mistake, let your administrator know.\n \n \nLog back in\n \n \n \n  \n \nYou are receiving this email because your team administrator removed you from a team on Canva.\n \nIf this was sent to you by mistake, please contact \nsupport\n.\n \n \n \n  \nMade for you with\n \n \nfrom\n Canva\nCanva®, \n110 Kippax St, NSW 2010, Australia",
    "received_at": "2024-04-04T14:03:59+00:00",
    "sent_at": "2024-04-04T14:03:50+00:00",
    "date_extracted": "2025-04-04T20:34:23.333805"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAMyzzSdAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAAmIzxnh91VAopeWrmHbxFU=",
    "from": "EndoBankruptcyNoticing@noticing.ra.kroll.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "endoinquiries@ra.kroll.com",
    "in_reply_to": "N/A",
    "subject": "In re Endo International plc, et al., Case No. 22-22549 (JLG) US Bankruptcy Court for the SDNY",
    "body": "You don't often get email from endobankruptcynoticing@noticing.ra.kroll.com. \nLearn why this is important\nPlease find below a link to the following important document, related to the bankruptcy proceedings of Endo International plc, \net al.\n, Case No. 22-22549 (JLG), United States Bankruptcy Court for the Southern District of New York:\nNotice of Filing of Agreements with United States Department of Justice (Related Document: 3118)\n [Docket No. 3756]\nFor additional information, and to download all documents filed in the Debtors’ chapter 11 cases free of charge, please visit \nhttps://restructuring.ra.kroll.com/endo\n.\nEndo Bankruptcy Noticing\nKroll Restructuring Administration LLC, 55 East 52nd Street, 17th Floor\n, \nNew York\n, \nNY\n \n10055\nUnsubscribe",
    "received_at": "2024-03-02T00:28:21+00:00",
    "sent_at": "2024-03-02T00:28:14+00:00",
    "date_extracted": "2025-04-04T20:34:40.932515"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAMTBv9DAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAGxgkGSJcTBAnR0_1uI8sqQ=",
    "from": "community@e.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-fef81d70706d04-51_HTML-7835658-536001475-522@e.miro.com",
    "in_reply_to": "N/A",
    "subject": "Event: How Leaders Prioritize Their Lives",
    "body": "You don't often get email from community@e.miro.com. \nLearn why this is important\nLearn to prioritize what's important in your life in this online event. \n͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \n \nJanuary 11\nThe 20-10-10 Exercise: How Leaders Prioritize Their Lives\n8am PST / 5pm CET\nDiscover what interests motivate and inspire you, and the critical tools to use to prioritize them in your personal and professional life.\nSave your spot\n \nBenefits of attending:\n•\nA free self-inventory of passions and interests to serve as a guide on what to say 'no' to\n•\nThe ability to help mentor or advise others in times of transition\n•\nA unique interviewing and evaluation method to explore with potential candidates\nMeet the host\nAdam Paulisick\n is the \nCEO of Skillbuilder.io\n and an \nAdjunct Professor of Entrepreneurship at Carnegie Mellon\n. He is the \nfounder of maad labs\n, a do tank, not a think tank, that conducts digital experiments on design thinking.\nLearn more →\n \nSee you there!\nThe Miro Community Team\n \n \n \n \n \nBlog\n \nEvents\n \nAcademy\n \nCommunity\n \nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2024-01-08T15:36:38+00:00",
    "sent_at": "2024-01-08T15:36:28+00:00",
    "date_extracted": "2025-04-04T20:35:27.170208"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAMQ9RTHAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAK8Q10CSKahDujtRh9UQTNc=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Updated Terms of Service",
    "body": "You don't often get email from concierge@expensify.com. \nLearn why this is important\nHi there,\nWe've made some updates to our \nTerms of Service\n for new members of our Expensify Card program.\nAs always, we're sending this notification to everyone with an Expensify account. Continued use of Expensify following the update constitutes acceptance of our updated Terms of Service. \nThanks,\nConcierge\nPS: This is a one-time required legal notice sent to all Expensify members, even those who have unsubscribed from optional announcements. If you would like to never receive this again, please follow \nthese\n instructions to close your account. Thank you for your understanding.\nSent by: Expensify, Inc - 548 Market St #61434 - San Francisco, CA 94103",
    "received_at": "2024-01-05T14:27:18+00:00",
    "sent_at": "2024-01-05T14:27:12+00:00",
    "date_extracted": "2025-04-04T20:35:26.634815"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAMPG-PTAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAGgWV3wNjhhHsrvhIxPWe7c=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] New for 2024: Budgets to keep your expenses in check",
    "body": "You don't often get email from davidb@expensify.com. \nLearn why this is important\nIt's the season for reflecting on how last year went, and what can be done to make this year better.  One common refrain is asking \"how did I end up spending so much on that?\"  The answer is generally pretty simple: one small purchase at a time, with a steady trickle that added up faster than expected.  With that in mind, \nwe're very happy to announce \"tag and category budgets\"\n – the easiest way to catch these financial leaks before they flood your basement.   \n \nThe feature works exactly as its name implies:\nEdit an \nexpense category or tag\n (like, \"Travel expenses\" or \"Project X\"). \nPick a \nbudget period\n (such as \"monthly\", or \"yearly\"). \nAssign a \ntotal workspace budget\n, summed across all workspace members (in case you have multiple, though this works great for sole-proprietors with no employees as well). \nAssign a \nper-member budget\n, to regulate each individual member's spend. \nHit Save, and we'll let you know:\nWhenever anyone spends over 50% (or whatever threshold you pick) of the budget for the first time this period. \nAnd again once the budget has been 100% used.\nThe notification is delivered via email, as well as in New Expensify to your workspace's #admins room, with a link taking you straight to the spend so you can update your forecast.  It's an easy solution to a hard problem, and you can set it up three different ways:\nAsk your account manager to set up a call to walk you through it.\nRead more about \ntag and category budgets online\n. \nOr just hit \nedit\n on your favorite tag or category and set it up. \nAs the old saying goes: \nThe best time to \nplant a tree\n \ncreate a budget was a long time ago.  The next best time is right now.  \n \nGive budgets a shot and make 2024 your best year yet!\n-david\nFounder and CEO of Expensify\nQuestions?  Ask me on \nTwitter\n X! \n@dbarrett\n \nPS: \nNew Expensify\n is starting to get really good.  It's already great at settling friend-to-friend debts, splitting bills between groups of friends, and chatting in groups across platforms (Android, iOS, web, with both your email and SMS contacts).  But coming real soon here is full blown multi-organization enterprise chat and task management – not to mention a truly realtime take on financial collaboration inside and between companies.  2024 is going to be a big year for the Expensify community.  Get ready! \nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2024-01-04T02:47:57+00:00",
    "sent_at": "2024-01-04T02:47:53+00:00",
    "date_extracted": "2025-04-04T20:35:28.760411"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAMENlVRAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAEj1J9SmfXFNtQ2mF_x1Jhs=",
    "from": "account-services@legal.bill.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "no-reply@legal.bill.com",
    "in_reply_to": "N/A",
    "subject": "We’re Updating Our Privacy Notice and Terms of Service",
    "body": "You don't often get email from account-services@legal.bill.com. \nLearn why this is important\n  ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌ \nSkip to main content\n \n \nBILL Terms of Service and Privacy Notice Email \nGreetings from BILL, \nWe’re writing to let you know that we’re updating our Privacy Notice and Terms of Service, effective January 22, 2024. We are making these updates to reflect and support our evolving business and to provide additional helpful information about our services and your privacy rights. \nPlease take a moment to review the updated \nPrivacy Notice \nand \nTerms of Service\n. For your convenience, a summary of the highlights may be found \nhere\n.\nNo further action is required from you. By continuing to use our services after January 22, 2024, you agree to the updated Privacy Notice and Terms of Service. \nAs always, we thank you for using BILL!\nThe BILL Team \nYou're receiving this transactional notification because you have (currently or in the past) accessed BILL services.",
    "received_at": "2023-12-17T00:37:40+00:00",
    "sent_at": "2023-12-17T00:37:34+00:00",
    "date_extracted": "2025-04-04T20:35:32.827769"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALlfzDDAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAB8gFgFe-PZCvZbTsZBjM9A=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-feed11787d6203-346_HTML-73101489-536002764-197208@account.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nOCTOBER 22 - 28\nHere's how your team did last week\nTOP\nCohort 8: Advancing Inclusion Leaders Session\n1 editor last week! \nINACTIVE\nCohort 5: Advancing Inclusion Leaders Session\nBoard became inactive when a new was created on Saturday Oct, 28. \nGo to dashboard\n \nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nC\nConner\n1 board created\nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2023-10-31T15:37:27+00:00",
    "sent_at": "2023-10-31T15:37:18+00:00",
    "date_extracted": "2025-04-04T20:36:13.869000"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALa5FdkAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAAok96snJONGtydiJa7CZPY=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Know any teachers? Let Expensify.org help them help their students",
    "body": "tl;dr - \nRefer a K-12 teacher to Expensify.org\n so we can reimburse 50% of any purchase they make to help underprivileged students in their classrooms.\nAs fall begins, countless kids around the world have eagerly (or sullenly) returned to school. Many of them are very prepared. But not all are, and nobody is more qualified to know which kids need help than the teachers responsible for their care. One such teacher is Doug Bird, who thirty years ago (omg, how did I get so old) taught my drama class at Swan Valley High School (Go Vikings!) in Saginaw, Michigan. \nDoug (aka, Mr. Bird) had a huge impact upon my time in school, like countless millions of other teachers around the globe – and thirty years later, is still there, helping kids like me find their place in the world. But not all kids were as lucky as me, and able to show up to school with a backpack of books, a lunchbox of food, and the basic supplies to learn the basics of growing up in this world. \nThat's why it is depressingly common for extraordinary teachers like Mr. Bird to dip into their own pockets to help out the students in their classroom who are less fortunate. This can be as simple as a blank notebook and a handful of markers, as serious as a pair of clean socks and a winter coat that fits, or as sad as \npaying off a kid's lunch debt\n so they can have possibly the only hot meal of their day. \nIn fact, it's so common for teachers to spend their own money on the kids in their care, that here in the US the IRS has a special tax break just for teachers: the \nEducator Expense Deduction\n. It allows teachers to deduct up to $250 from their income tax as thanks for helping their kids out. \nBut it's not nearly enough\n, and Expensify.org wants to help them help their students. \nYou might have heard of New Expensify, our highly-simplified, chat-centric, from-scratch rewrite of Expensify Classic, that we've been working on for years as the foundation for the next generation of the product going forward. One feature of New Expensify is what we call, quite modestly, \"Save The World\". This isn't us saving the world. It's you saving the world. And the latest way you can do it, works like this: \nClick \nnew.expensify.com/teachersunite\n and sign in (or if you're already signed into Expensify Classic, click the green chat bubble in the bottom-right).\nClick the big green + button and choose \nSave The World\n.\nClick \nI know a teacher\n.\nThink of your favorite teacher. It could be someone who taught you, or someone who teaches your kids.\nEnter their email address or phone number, and we'll take it from there.\nSpecifically, we will split their classroom bill with them in 3 steps:\nThey scan the receipt of the next purchase they make on behalf of their kids.\nWe will confirm with their principal (ie, their boss) that it was in fact for kids in their classroom.\nWe reimburse them 50% (up to $50) from donations made to Expensify.org.\n \nIt's really that simple: you invite the teacher, and we'll pay them to help their kids. There's no catch – it doesn't cost you or them anything. We've got the money (a slice of every Expensify Card purchase goes to Expensify.org via our \nKarma Points program\n, in addition to our Corporate Karma and Personal Karma programs, as well as our network of incredible monthly donors – \njoin today!\n). We just need your help deciding who to give it to. \nSo please take a moment to help us help your favorite teacher, so they can help the students in their classroom who need it the most. These problems shouldn't exist. But they do, and kids are suffering as a result. Let's give them a hand, and bit by bit, let's save this world together. \nCheck out \nExpensify.org/teachersunite\n to learn more!\nThank you.\n-david\nFounder and CEO of Expensify\nQuestions? Ask me on \nTwitter\n X! \n@dbarrett\n \nPS: In case it wasn't already clear, Expensify.org is reimbursing teachers who are spending their own money, helping someone else's kids. These are true heroes, in every sense of the word. Accordingly, we feel very confident that the money is being well spent, because it's their money – we are only reimbursing half. Furthermore, we ask their principal (ie, their boss) to confirm every receipt is in fact going to help kids in their classroom, increasing our confidence further. This is the special and unique model of Expensify.org, which uses the power of modern expense management to laser target donor funds precisely to specific individuals in need, verified to the penny by receipt, and multiple layers of human review. \nPPS: To support the launch of Teachers Unite, we are sunsetting our SNAP campaign, which provided over $324,076.66 of groceries for over 6356 families since the onset of the pandemic. Though food insecurity is hardly a thing of the past, the pandemic thankfully is. Going forward we are moving away from emergency subsidies from Expensify.org to individual users, and towards campaigns like Teachers Unite that seek out and supercharge existing heroes who help people in need out of their own pockets. Expensify.org’s mission is to \"empower individuals and communities to eliminate injustice around the world by making giving and volunteering more convenient, meaningful, and collaborative\". This is an incredibly exciting transition for us, and we've got lots more ideas in store! \nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2023-10-18T00:11:33+00:00",
    "sent_at": "2023-10-18T00:11:25+00:00",
    "date_extracted": "2025-04-04T20:36:25.146613"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALUzJJTAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAPPWWGEvQgZFhPpWLIZdAzM=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "replies+65643336@expensify.com",
    "in_reply_to": "N/A",
    "subject": "Expensify Chat between Concierge and zoe@lcwmail.com",
    "body": "Concierge \nIf you want the Expensify mobile app, I'll send you a link to download it. Just enter your number \nhere.\n For questions, just reply to this message.\nSwitch to \nnew.expensify.com\n or reply directly to this message.",
    "received_at": "2023-10-08T08:31:36+00:00",
    "sent_at": "2023-10-08T08:31:25+00:00",
    "date_extracted": "2025-04-04T20:36:38.749799"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALUzJJSAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAJtO4EVohDJMr_MPyvXJ3Vc=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "Quick question about Expensify",
    "body": "Hey,\nConsidering your experience with us so far, how likely are you to recommend Expensify to someone in your personal or professional network?\n0\n   \n1\n   \n2\n   \n3\n   \n4\n   \n5\n   \n6\n   \n7\n   \n8\n   \n9\n   \n10\n0 = not likely\n10 = very likely\nWe look forward to hearing from you!",
    "received_at": "2023-10-07T19:19:12+00:00",
    "sent_at": "2023-10-07T19:19:07+00:00",
    "date_extracted": "2025-04-04T20:36:38.206872"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALR8G26AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAP3fY8ChBY5IrrpivzCj6ak=",
    "from": "team@e.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-fefe1274726404-51_HTML-7835658-536001475-2682@e.miro.com",
    "in_reply_to": "N/A",
    "subject": "I hope you can make it",
    "body": "We can't wait to see you at our online annual event, Distributed '23.\n͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \nHi Zoe Allerding,\nEleanor here, Head of Community at Miro. 👋\nI see you haven't registered yet, so I wanted to extend a personal invite to \nDistributed '23\n, our annual online community event!\nIt's completely free and full of over 30 inspiring expert-led sessions, including talks and workshops featuring leads from companies like \nAWS\n, \nCisco\n, and \nSalesforce\n.\nSave your spot\n today to get an exclusive first look at our newest releases on October 18, and access to newly built frameworks to help you work and innovate faster.\n \nSee you there!\nEleanor Hooker\nHead of Miro Community\nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2023-10-04T15:12:18+00:00",
    "sent_at": "2023-10-04T15:12:00+00:00",
    "date_extracted": "2025-04-04T20:36:40.367764"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALR8G25AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKM5givbOQlHn4uGfQKvuSI=",
    "from": "team@e.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-fefb1274736004-51_HTML-7835658-536001475-1977@e.miro.com",
    "in_reply_to": "N/A",
    "subject": "Learn From These 6 Experts",
    "body": "Register for Distributed '23 to gain insights and ideas from industry leaders. \n͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nRegister to learn from experts at Distributed '23\nOctober 18 — Online\nJoin us for 30+ inspiring sessions from industry leaders, and for a first look at product announcements, at our free annual community event.\nSave your spot\n \n \nZoe Allerding\n \nVarun Parmar\nChief Operating Officer\n \n \nSandra Heinzen\nDesign Lead\n \n \nBrian Ciccotelli\nTechnologist\n \nBecky Priebe\nLeader, Product Design\n \n \nMohammed Fazalullah\nSenior Developer Advocate\n \n \nCharlie Rowat\nSenior Innovation Manager\n \nJoin us for our annual online event on October 18\nRegister now\n \n \n \n \n \n \nBlog\n \nEvents\n \nAcademy\n \nCommunity\n \nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2023-10-03T17:15:58+00:00",
    "sent_at": "2023-10-03T17:15:09+00:00",
    "date_extracted": "2025-04-04T20:36:40.386838"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALKQiriAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAB9pf_4HGnpNoEOKjAzbLhA=",
    "from": "no-reply@canva.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "no-reply@canva.com",
    "in_reply_to": "N/A",
    "subject": "Important changes to your free team in Canva",
    "body": "Here’s what you need to know about the changes to your free team in Canva\n͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ \n \n \n \n \n \n \nHi ,\nWe're making some changes to our free teams offering in Canva, so we'd love to take a minute to explain what that means for you. \nAs you've already joined a free team in Canva, we will make sure that you and your team can keep using it. However, there are some updates that you should know. \nStarting on October 31, 2023, adding new team members or replacing existing team members with new ones will require the team to upgrade to Canva for Teams.\n \nYou will still be able to use your free Canva team, including collaborating in real time with anyone else that you've shared your designs with, or who has shared designs with you.\nYou can learn more about this change \nhere\n.\nThanks for being part of the Canva community ❤️ \nHappy designing,\nThe Canva Team\n \n \n  \n \nYou’re receiving this email because you have a Canva account. This email is not a marketing or promotional email. That is why this email does not contain an unsubscribe link. You will receive this email even if you have unsubscribed from Canva’s marketing emails.\n \n \n \nMade for you with\n \n \nfrom\n Canva\nCanva®, \n110 Kippax St, NSW 2010, Australia\nABN 80 158 929 938 | \nPrivacy Policy",
    "received_at": "2023-09-26T18:42:11+00:00",
    "sent_at": "2023-09-26T18:42:07+00:00",
    "date_extracted": "2025-04-04T20:36:54.619303"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALEbvKJAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAHXA7UOfDOBBuii4RkErz74=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-feed11787d6203-346_HTML-73101489-536002764-31530@account.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nSEPTEMBER 03 - 09\nHere's how your team did last week\nTOP\nCohort 7: Advancing Inclusion Leaders Session\n1 editor last week! \nINACTIVE\nCohort 6: Advancing Inclusion Leaders Session\nBoard became inactive when a new was created on Wednesday Sep, 6. \nGo to dashboard\n \nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nC\nConner\n1 board created\nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2023-09-12T16:10:24+00:00",
    "sent_at": "2023-09-12T16:10:13+00:00",
    "date_extracted": "2025-04-04T20:37:05.015231"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAALCaUDaAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKahG5-NqUJOjjuMiI02YtE=",
    "from": "team@e.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-fef51270736c02-51_HTML-7835658-536001475-2384@e.miro.com",
    "in_reply_to": "N/A",
    "subject": "Your Distributed '23 Sneak Peek",
    "body": "Hear from Microsoft, AWS, and more at our annual event.\n͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nAT DISTRIBUTED '23\nJoin us for 3 session tracks full of new ideas\nSave your spot\n \n \nWe're busy building our final agenda for October 18, but we couldn't wait to share our \nthree session tracks\n as a preview of \nDistributed '23\n — our annual online event.\n \nCentering the customer experience\nGet inspired by new practices that \nCisco\n, \nNeat\n, and others are using to prioritize the end user.\n \nDelivering products at speed\nGain insights from industry leaders at \nAWS\n, \nMicrosoft\n, and more to do your best Agile work.\n \nDesigning a shared vision of the future\nExplore how to improve the way you approach innovation with \nSalesforce\n and \nKnowmium\n.\nThis is just a taste of what you'll get from the 20+ expert-led sessions when you join us on October 18.\nSave your spot\n \n \n \n \n \n \nBlog\n \nEvents\n \nAcademy\n \nCommunity\n \nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n. \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2023-09-08T17:10:08+00:00",
    "sent_at": "2023-09-08T17:09:58+00:00",
    "date_extracted": "2025-04-04T20:37:14.824977"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAK7xqa8AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKYChwXaxCJHtnN655GR4_E=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Analyze and control spend using Insights and Custom Reporting",
    "body": "After a company adopts Expensify to get all their spend in one place, one of the most common questions we get is: how do I make sense of this? How do I analyze where my money is going, and spend it more efficiently? The answer is simple: click the new \nInsights\n button to get realtime, interactive spend analysis, right in your browser: \n \nSlice and dice your personal, employee, or company spend – across expense reports, corporate cards, invoices, and more – broken down as simple pie charts, or sophisticated time series. Check out \nthe Insights help page\n to learn more – or even better: \nlet your account manager do it for you\n. Click \nSupport > Account Manager\n (or ask in your \n#admins\n room), and we'd be happy to help with any of the following: \nAccrual Report\nAged Approval Reports\nAttendee Reporting\nAudit Report\nCandidate Spend\nCategory Spend Report\nDepartment/Project Spend Report\nDuplication Report\nDuty of Care\nEfficiency\nEmployee Bank Account Status\nEmployee Details\nEmployee Roles\nExpense Authorizations by Country\nExpense Reports by Country\nExpense Reports not posted to finance system\nForeign Currency Transaction\nFringe Benefit Tax Report\nHR Report\nInvoice Billed Transaction Reconciliation\nMileage Reports\nOut of Pocket Expenses for Reimbursement\nPer Diem Report\nReconciliation: Accounting, Bank Statement, Billed Transaction\nRejected Report\nTravel Rule Class\nTravel Spend\nUnposted Cash Advance Report\nUnposted Procurement Aging Report\nUnposted Travel Aging Report\nVendor Spend\n… or anything you can imagine.\nSo get reporting, whether on your own or with our help. It's all included in your base subscription, at no additional cost. Don't just manage expenses, manage spend by transforming realtime data into realtime insights to power your company forward! \n-david\nFounder and CEO of Expensify\nQuestions? Ask me on Twitter! \n@dbarrett\n \nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2023-08-31T22:46:52+00:00",
    "sent_at": "2023-08-31T22:46:48+00:00",
    "date_extracted": "2025-04-04T20:37:14.329418"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAK2fdwDAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAGnIguSEo0WslfgCVeSgbOs=",
    "from": "RA-JJCUS-APStatement@ITS.JNJ.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "RA-JJCUS-APStatement@ITS.JNJ.com",
    "in_reply_to": "N/A",
    "subject": "Johnson & Johnson Account Statement Request -  JNJAA32000285501L ",
    "body": "Date:                            Tuesday, August 22, 2023\n \nSubject:                        Johnson & Johnson Services, Inc. –Vendor Account Review\n \n \nDear Valued Supplier,\n \n \nJohnson & Johnson Services, Inc. (paying agent for the Johnson & Johnson Family of Companies) has enlisted the services of APEX Analytix, a third-party service provider, to review our vendor accounts with \nLANGUAGE AND CULTURE WORLDWIDE LLC\n.  \n \nTo enable this review, Johnson & Johnson Services, Inc. has authorized APEX Analytix to\n·\n      \nRequest and collect the suppliers’ current accounts receivable aging statements showing all open invoices and open credits for transactions such as returns, rebates, debits, unapplied cash, offsets, overpayments, unused deposits, pre-payments, etc. \n·\n      \nPerform a review of these statements and, \n·\n      \nRequest refund payments on behalf of Johnson & Johnson Services, Inc. and its subsidiaries, where applicable.\n \nWe therefore ask that you provide APEX Analytix your full cooperation in the event they have questions regarding your Johnson & Johnson Services, Inc. account.  The information (which should be provided for the companies listed at the bottom of the email) will not be shared with other parties nor used for any other purpose. \n \nPlease reply to \nRA-JJCUS-APStatement@its.jnj.com\n with reference \nJNJAA32000285501L\n included in the email subject.\n \n \nShould APEX Analytix identify any payment errors that require you to return funds to Johnson & Johnson Services, Inc. or any of its affiliates, we ask that you send a check for payment to our address below:\n \n \nJohnson & Johnson Services, Inc. \nc/o APEX Analytix \nP.O. Box 16571\nNew Brunswick, NJ 08906-6571\n \n \nAll checks \nmust\n be made payable to “\nJohnson & Johnson Services, Inc.\n” and should include a reference to “\nAPEX\n” on the check.\n \nAny payments and refunds will be posted to your Johnson & Johnson Global Services vendor account.  \nNote:  Current invoices and credit memos should continue to follow your current process as defined with Johnson & Johnson Services, Inc. Global Services, Procurement.\nTo view your current account activity, you may visit our \nvendor portal at \nwww.ap.jnj.com\n.\n \nIf you have any questions or are not the correct contact, please reply to this email or contact Katherine Renew at \nkrenew@its.jnj.com\n so that we may update our records.  \nYour assistance in this review is greatly appreciated.\n \nSincerely,\n \n \n \nShemeika Peterkin\nRequisition-to-Pay Compliance Specialist\nGlobal Services, Procurement\n8800 Grand Oak Circle, Tampa, Florida 33637\n \n \n \nAcclarent, Inc.\nJ&J Innovation LLC\nMentor Worldwide LLC\nActelion Pharmaceuticals\nJ&J International\nMicroTyping Systems\nActelion US Holding Comp.\nJ&J MD&D Group-Latin Am.\nMicrus Endovascular Corp\nAlza Corporation\nJ&J Regenerative Ther LLC\nNeoStrata Company, Inc\nAMO Development, LLC\nJ&J Shared Services\nNeutrogena Corporation\nAMO Manufacturing USA,LLC\nJ&J Surgical Vision, Inc\nNeuWave Medical, Inc.\nAMO PR Mnfg, Inc.(Branch)\nJanssen - Cilag Mfg LLC\nNoramco, Inc.\nAMO Sales & Services,Inc.\nJanssen BioPharma, Inc.\nOMJ Pharmaceutical ShdSer\nAnimas Corporation\nJanssen Biotech, Inc\nOMJ Pharmaceuticals, Inc.\nAreus, Inc.\nJanssen Diagnostics, Inc.\nOMP Finco\nASP Services Inc.\nJanssen Global Svc LLC\nOptiMedica Corporation\nBabyCenter LLC\nJanssen Immunotherapy R&D\nOraPharma, Inc..\nBiosense Webster, Inc.\nJanssen Oncology, Inc.\nOrtho Biologics LLC\nCalibra Medical, Inc\nJanssen Ortho LLC\nOrtho Biotech Hldgs\nCentocor Research & Devel\nJanssen Pharmaceut,Inc\nOrtho McNeil Pharm\nCeptaris Therapeutics,Inc\nJanssen Products, LP\nOrtho-Clinical Diagnostic\nClosure Medical Corporati\nJanssen R&D, LLC\nPatriot Pharmaceuticals,\nCodman & Shurtleff Inc.\nJanssen Scientific Affair\nRutan Realty\nCordis LLC\nJanssen Services, LLC.\nScios Inc.\nCoTherix Inc.\nJanssen Supply Group, LLC\nSomerset Laboratories\nDepuy Mitek, LLC\nJnJ Health&Welln Sols Inc\nSymCare, Inc\nDePuy Products, Inc.\nJohnson & Johnson Vision\nSynthes USA Sales, LLC\nDePuy Spine Inc.\nJOM Pharmaceutical Svcs\nTearScience, Inc\nDePuy Synthes Instit, LLC\nJOM Primary Care Inc.\nTherakos USA\nE-Company Store\nKenvue, Inc\nTibotec, Inc. (USA)\nEthicon Endo-Surgery, Inc\nLifescan Products LLC \nTorax Medical, Inc\nEthicon US, LLC\nMcNeil Consumer Pharm Co\nTransForm Pharmaceuticals\nHuman Performance Institu\nMcNeil Healthcare LLC\nVistakon Pharmaceuticals,\nIndependence Technology,\nMcNeil Nutritionals, LLC\nVogue International LLC\nJ&J Development Corp\nMD&D Global Services LLC\nWellness & Prevention\nJ&J Enterprise Innov Inc.\nMEDCL DEVCS BUS SVS, INC.\nZarbee's, Inc.\nJ&J Health Care Systems \nMegaDyneMedicalProd, Inc.",
    "received_at": "2023-08-22T23:09:51+00:00",
    "sent_at": "2023-08-22T23:09:09+00:00",
    "date_extracted": "2025-04-04T20:37:18.557570"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAKmGy_0AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAFgYHs8_OuRKhFcDcvJO1Cc=",
    "from": "MicrosoftExchange329e71ec88ae4615bbc36ab6ce41109e@lcwmail.onmicrosoft.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "MicrosoftExchange329e71ec88ae4615bbc36ab6ce41109e@lcwmail.onmicrosoft.com",
    "in_reply_to": "N/A",
    "subject": "Undeliverable: ACHDeposit",
    "body": "Your email couldn't be forwarded from z.allerding@lcwmail.com to another email address.\nz.allerding@lcwmail.com\nThere's a problem with the recipient's mailbox. Please try resending the message. If the problem continues, please contact your email admin.\nDiagnostic information for administrators:\nGenerating server: BL1PR19MB5674.namprd19.prod.outlook.com\nTotal retry attempts: 1\nz.allerding@lcwmail.com\nRemote server returned '554 5.2.0 STOREDRV.Deliver.Exception:DuplicateObjectException.MapiExceptionDuplicateObject; Failed to process message due to a permanent exception with message [BeginDiagnosticData]Cannot complete delivery-time processing. 0.35250:0A000237, 1.36674:0A000000, 1.61250:00000000, 1.45378:02000000, 1.44866:85380000, 1.36674:0E000000, 1.61250:00000000, 1.45378:8A380000, 1.44866:24020000, 16.55847:65180000, 17.43559:0000000024020000000000000000000000000000, 20.52176:140FE7991A00103100000000, 20.50032:140FE7998A17000000000000, 0.53414:140FE799, 0.35180:03000B37, 255.23226:140FE799, 255.27962:0A000000, 255.27962:0E000000, 255.31418:1F001432, 0.35250:34030000, 1.36674:0A000000, 1.61250:00000000, 1.45378:02000000, 1.44866:24000000, 1.36674:9E000000, 1.61250:00000000, 1.45378:29000000, 1.44866:04000000, 16.55847:AA000000, 17.43559:00000000A8030000000000000000000000000000, 20.52176:140FE7991A00401080030400, 20.50032:140FE7998A1700101F000737, 0.53414:80030400, 0.35180:0A00C665, 255.23226:0300200E, 255.27962:0A000000, 255.27962:9E000000, 255.17082:79050000, 0.18273:2E000000, 4.21921:79050000, 255.27962:FA000000, 255.1494:33000000, 0.38698:05000780, 1.41134:46000000, 4.65304:0F010480, 0.40490:3A6AC400, 1.105836:21A3B100, 4.58236:79050000, 7.40748:010000022DE36CDC86000000, 7.57132:000000000000000069000100, 4.39640:79050000, 1.63016:9E000000, 8.45434:2DDEE701EA5F41419663AAC6C017555F05000780, 1.46798:04000000, 5.10786:0000000031352E32302E363633312E3032363A434832505231394D42333736373A30333837356266622D616133332D346466332D616638642D3131663337316231663562623A38393632343A2E4E455420362E302E3230001A010480, 7.51330:63246E4DAC8EDB081A010480, 0.39570:1A010480, 1.55954:0A000000, 1.33010:0A000000, 2.54258:00000000, 0.40002:12000000, 1.56562:00000000, 1.33010:0A000000, 2.54258:00000000, 0.40002:2C000000, 1.56562:00000000, 1.55954:9E000000, 0.40818:00000000, 1.33010:9E000000, 2.54258:79050000, 1.33010:9E000000, 2.54258:79050000, 255.1750:0A002037, 255.31418:83000000, 0.22753:0A005536, 255.21817:79050000, 0.52338:88000000, 4.35954:79050000[EndDiagnosticData] [Stage: DeliverMessage]'\nOriginal message headers:\nReceived: from SmtpServer.Submit by BL1PR19MB5674 with Microsoft SMTP Server\r\n id 15.20.6631.29; Thu, 27 Jul 2023 14:15:03 +0000\r\nContent-Type: multipart/mixed;\r\n\tboundary=\"_713301e3-153a-4d68-9028-e445f57eea62_\"\r\nMIME-Version: 1.0\r\nFrom: <Zoe@lcwmail.com>\r\nSubject: ACHDeposit\r\nMessage-ID: <5a23f552-7157-0a40-c70a-f61d6404f60b@lcwmail.com>\r\nTo: <z.allerding@lcwmail.com>\r\nReferences: <5a23f552-7157-0a40-c70a-f61d6404f60b@lcwmail.com>\r\nReturn-Path: Zoe@lcwmail.com\r\nDate: Thu, 27 Jul 2023 14:15:03 +0000\r\nX-MS-Exchange-Parent-Message-Id: <5a23f552-7157-0a40-c70a-f61d6404f60b@lcwmail.com>\r\nAuto-Submitted: auto-generated\r\nX-MS-Exchange-Generated-Message-Source: Antispam Quarantine Agent\r\nX-MS-TrafficTypeDiagnostic:\r\n\tBL1PR19MB5674:EE_|BL1PR19MB5674:EE_QuarantinedMessage\r\nX-MS-Exchange-AtpMessageProperties: SA|SL\r\nX-Microsoft-Antispam: BCL:0;\r\nX-Microsoft-Antispam-Message-Info:\r\n\tsUvk95o/mAuaa8cdET0POfaGDTzHADmz839sn3LC2dzJpVAeT9fpmDjilwlZqRbiobnZfp2mW9ex6zvOaKT+YdRIz7J/97nfcpW5LFjecGyDw9sv/PuB+vO7sgUl0Y0KMt3zerPZsjMwE5IAtX46+SgiD7ZXnFM2CsUNqX9MNZJ7PHAQ4QhA1OgAq4lIcthCz5BjXlqAPRLj7oNAqzZQMlstreQ7nWTcHGTaNprwmZkjJRC+uMVYpC12WK65rdUxmn83hCfv4Pp6Mb5Obm275TPd9W8i+k8ZEHW+KDUoQnA8JUMyqjUPDX2OsvzhVV0rdLbqKPFqrfMhwO1CnNBj5KFyHg6JB672X3wFeTNk5N9sictFUEe/TbqK5Jm9iKQkQ/ioqK+zfGULbj21z0ZxJLIEAi7MXfn34lOCOd8CMbEC1sne3muPNqAiVlBdDPC38T1oLTifoj05TsylKW3X2GSCiUSJNEDFhSnG7lSk7MaSG+i5c0vTfJJbgkrkZe1NEOtyDamYe1S5ulgMeT1gpAxBUb1YzSVBcbavqqASAPCs99eH1WCEBp/9CX0LAIKOv+AlysycXf8iXEftkTXgQz21bz0juf2vvzBlclq10nfnwX03cPpyQo1eKzL4YwyZy8+MYwnEXp+wOkaUq73fCNaMsQKqEW5pbAt56oE7vI/jNHCCzPzsEd9CyT40GQwe3J0kAGPb/M1AMSc5npPIuU/5S3KwtYflMPjyqStq3YUOAhTINMdO2b9uoRVRaYKg/CBMBTInUxMJHa0eCRaH+QveLyrB67DAcKOvOx8OjexkvjaySTGWeuHWVGO4yDsgZrXTUb5Wo+EZA25cVPedvPErvaGg/KPmt/8UT/3I16o+dW1RKDfAgXS6lLeKELC9/w/oZrJQXIYArQKp3iOZiXDxa7/B1oUonxhAFh33rK0MeEffYexWNK2q0hfMAC7xpC+QpZIDUfmWCW8aT1/oPA==\r\nX-Forefront-Antispam-Report:\r\n\tCIP:255.255.255.255;CTRY:;LANG:en;SCL:9;SRV:;IPV:NLI;SFV:SPM;H:;PTR:;CAT:INTOS;SFS:;DIR:INT;\r\nX-MS-PublicTrafficType: Email\r\nX-MS-Exchange-ForwardingLoop:\r\n\tz.allerding@lcwmail.com;3ca40a42-d72d-43c9-b92e-0740101d9dd3\r\nX-MS-Exchange-CrossTenant-Network-Message-Id: 31deaa6e-6e19-44ba-5502-08db8eab4707\r\nX-MS-Exchange-CrossTenant-OriginalArrivalTime: 27 Jul 2023 14:15:03.2809\r\n (UTC)\r\nX-MS-Exchange-CrossTenant-AuthSource: BL1PR19MB5674.namprd19.prod.outlook.com\r\nX-MS-Exchange-CrossTenant-AuthAs: Internal\r\nX-MS-Exchange-CrossTenant-FromEntityHeader: Hosted\r\nX-MS-Exchange-Transport-CrossTenantHeadersStamped: BL1PR19MB5674",
    "received_at": "2023-07-27T14:18:15+00:00",
    "sent_at": "2023-07-27T14:18:08+00:00",
    "date_extracted": "2025-04-04T20:37:39.174277"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAKQuX-gAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAJPn6c-R8uFAr7lyjk_FObg=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-feff1073776502-346_HTML-73101489-536002764-313859@account.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nGo to Miro →\n \nJUNE 18 - 24\nHere’s how your team did last week\nTOP\nMind Map\n1 editor last week! \nINACTIVE\nStakeholder RACI Map\nBoard became inactive when a new was created on Thursday Jun, 22. \nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nCJ\nChristele Jalady\n1 board created\nThis email was sent to \nz.allerding@lcwmail.com\n. You can update your profile settings to change \nnotifications\n, preferred \nlanguage\n, or \nunsubscribe\n.\n \n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\n \nHelp Center\n  |  \nPrivacy Policy",
    "received_at": "2023-06-27T13:35:08+00:00",
    "sent_at": "2023-06-27T13:35:01+00:00",
    "date_extracted": "2025-04-04T21:12:00.082638"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAKLqtskAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAAPEIDGao_hAoHS-NaQSS6Y=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Terms of Service and Privacy Policy Update",
    "body": "Hey there,\nWe've updated our Terms of Service and Privacy Policy. These updates support using AI technology to help moderate content in chat, such as messages shared in publicly accessible rooms at new.expensify.com, as well as Virtual Personal Assistant services. Continued use of Expensify following the update constitutes acceptance of our updated Terms of Service.\nReview Updated Terms\n \nThanks,\nConcierge\nPS: This is a one-time required legal notice sent to all Expensify users, even those who have unsubscribed from optional announcements. If you would like to never receive this again, please \nfollow these instructions\n to close your account. Thank you for your understanding.\nSent by: Expensify, Inc - 548 Market St #61434 - San Francisco, CA 94103",
    "received_at": "2023-06-17T07:22:31+00:00",
    "sent_at": "2023-06-17T07:22:26+00:00",
    "date_extracted": "2025-04-04T21:12:01.613203"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJ7ezW_AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAHyo1Du39dFDhzVgtXig5ic=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nGo to Miro →\n \nMAY 14 - 20\nHere’s how your team did last week\nCheck more news and updates from your Miro team\n \nWelcome 1 new team member:\nCyril Derouineau joined your team. Make sure you share all relevant boards with them.\nAsk your Miro Heroes how to better collaborate in Miro\nZeke Sparkes\n1 board edited\nAdam Novickas\n1 board edited\nThomas Pottkämper\n1 board edited\nCustomize\n your updates from Miro or \nunsubscribe\n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States",
    "received_at": "2023-05-23T17:52:45+00:00",
    "sent_at": "2023-05-23T17:51:47+00:00",
    "date_extracted": "2025-04-04T21:13:07.488322"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJ6k7r6AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAKGyw8x3ePJOmmsVW2HeZmg=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Let our dedicated Account Managers expand your team",
    "body": "tl;dr - Your accounting team just got bigger! Ask your dedicated account manager what they can do for you.\nYou have likely noticed that we are aiming to offer the absolute best customer support in the industry. We started with a product that is extremely simple to set up and run. Then we added an AI-powered chat Concierge that reliably responds in under 2 minutes and is available 24/7. Now we're very happy to add dedicated account managers you can get to know on a first name basis, to help complete whatever setup, reconfiguration, or ongoing management issue you might have. How do you get one?\nIf you have 10 or more active seats, odds are you already have one! Go to \nSettings > Policies\n and click \nChat with Admins\n to be taken to the #admins chat room for your policy. Your account manager is already there and eager to talk to you via chat, or set up a call – whatever you prefer!\nIf you don't have 10 annual seats, go to \nSettings > Policies > Subscriptions\n, choose \nAnnual Subscription\n, and then choose a \nSubscription Size\n of 10 or more. A dedicated account manager will reach out instantly.\nWhat can your account manager do for you? Ask and find out! But some suggestions:\nPrice check.\n Are you using the right mix of annual and pay-per-use seats? Are you aware of how the Expensify Card can not only slash your bill, but possibly earn you more in cashback than the bill itself? Let us analyze your activity, bill, and spending patterns to make the best recommendation.\nHealth check.\n When's the last time you really took a look at your Expensify settings? Let us do a quick review of your latest requirements based on how your company has changed against the latest features in our toolbox, to find the perfect blend for you.\nChange management.\n Are you thinking of switching accounting or HR systems? Switching banks (ahem, possibly in a hurry)? Adopting a corporate card program? Adding international entities? Let us know and we'll help you plan and execute a seamless migration. \nNote: Another feature coming along for the ride is \"policy change logs\" – now any change to key policy settings will be recorded in the #admins room for that policy, creating a historical audit trail of who changed what. This way if you ask your account manager to make a change for you, you'll see exactly what was done, when, and by whom.\nReporting.\n Need to download data as a CSV? Whip it into a PivotTable? Visualize it with pretty charts? Let us know your data dream, and we'll take care of it!\nCompliance.\n Are you newly public or thinking about starting the journey? As a newly public company that just got SOX compliant, we feel that pain – let us alleviate it for you. Whether you're being audited to AICPA or PCAOB, SOC or SOX, we're in your corner.\nExpensify is simple enough to be self-serviced, if you prefer (especially with our \nnewly revamped help site\n). But included in your base subscription is access to our award winning managed service, so you might as well take it for a spin!\n-david\nFounder and CEO of Expensify\nQuestions? Ask me on Twitter! \n@dbarrett\n \nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2023-05-23T10:01:00+00:00",
    "sent_at": "2023-05-23T10:00:56+00:00",
    "date_extracted": "2025-04-04T21:13:14.630445"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJ2fMy6AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAChXzmgWoztPjw4AimnA-rY=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nGo to Miro →\n \nMAY 07 - 13\nHere’s how your team did last week\nCheck more news and updates from your Miro team\n \n \n \n \n \n \n \n \nWelcome 8 new team members:\nJordi Martin, Zeke Sparkes, Amin El Kohen, Thomas Pottkämper, Adam Novickas, Amer Saleem, Deborah Papiernik and Loic Amans joined your team. Make sure you share all relevant boards with them.\nAsk your Miro Heroes how to better collaborate in Miro\nZeke Sparkes\n1 board edited\nAdam Novickas\n1 board edited\nThomas Pottkämper\n1 board edited\nCustomize\n your updates from Miro or \nunsubscribe\n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States",
    "received_at": "2023-05-16T17:03:05+00:00",
    "sent_at": "2023-05-16T17:03:01+00:00",
    "date_extracted": "2025-04-04T21:13:06.272150"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJzF0ABAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAO94nc94DI5IpQeUx4Qhx9Q=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Pay anyone, anywhere, with FREE global reimbursements",
    "body": "tl;dr - Withdraw from 24 countries, deposit to 200+ countries, \nwithout pre-funding\n.\nThis has been a long, long time coming. I am incredibly happy to announce that Expensify is now a true global financial platform, and can support making payments from bank accounts in USD, CAD, GBP, EUR, and AUD to almost any bank account anywhere in the world. At no additional charge. It's real simple:\nClick the \"Support\" button\n in the left-hand nav to talk with your dedicated Setup Specialist, Account Manager, or just straight to Concierge.\nSay you want to set up \"global reimbursements\"\n and they'll walk you through the process (the exact setup flow, security checks, and underwriting model differs based on where you are withdrawing from and depositing to, so it's best done with our white-glove support service).\nScan receipts and import expenses as normal\n – in any currency you want. Everything about the expense reporting flow itself stays unchanged.\nReimburse the report\n just like you have been doing for years with USD reports. Non-USD reports are processed exactly like USD reports have always been.\nWe will withdraw from your \nexisting\n USD, CAD, GBP, EUR, or AUD bank account\n. You don't need to create a new bank account, or pre-fund a settlement account, or any of that junk – just connect your non-USD account in the same way you connected your USD account.\nWe will contact your employee\n to set up the deposit account, in whatever country they are located.\nWe will deposit into your employee's account\n, wherever it might be in the world, just like we've been doing for USD reimbursements into US bank accounts.\nAnd that's really it. I mean, there is an unbelievable amount of complexity behind the scenes to make that happen. But don't you worry about that; to you, it's as simple as can be.\nAnd \nit doesn't cost you extra\n. This is built into your base Collect or Control subscription. So go get global reimbursing, there's no reason to wait!\n-david\nFounder and CEO of Expensify\nQuestions? Ask me on Twitter! \n@dbarrett\n \nPS - From now on, every time you bring a user into the platform who goes on to adopt an Expensify subscription, we will pay you $250 (\nfine print\n). Use your personal joining link below to refer users to Expensify and get rewarded: \nhttps://join.my.expensify.com/?thanks=zoe@lcwmail.com\nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2023-05-12T11:51:02+00:00",
    "sent_at": "2023-05-12T11:50:59+00:00",
    "date_extracted": "2025-04-04T21:13:11.247992"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJvNqe8AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAMV6uKcddVNOs3Bwae4t_VQ=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Get $250 when you refer someone to Expensify",
    "body": "tl;dr referring someone to Expensify comes with a juicy reward, submit a receipt to your boss and get $250 when they adopt Expensify\nExpensify was built by our users who love Expensify so much they tell their friends, colleagues, managers, and bosses to use it too. Word of mouth is the backbone of our business. We solve your need to transcribe receipts and input information into a spreadsheet. In return, many of you tell your friends and submit reports to a boss who ultimately adopts Expensify for the team. This is how we acquired more than 12 million users, and we are eternally grateful for that. The Expensify community would not be what it is today without our incredible champions out there. Now we want to flip the script and give you a little thank you for telling people about us.  \nFrom now on, every time you bring a user into the platform who directly (or indirectly, more below) goes on to adopt Expensify, we will pay you $250. Use your personal joining link below to refer users to Expensify and get rewarded:\nhttps://join.my.expensify.com/?thanks=zoe@lcwmail.com\nThere are terms and conditions to read and meet, but it’s basically as simple as that. \nHere’s how it works:\nShare your referral link with friends and colleagues who are spending too much time on expenses, or who work at a business that could benefit from using Expensify.\nGet $250 for any referred business that commits to an annual subscription and makes two monthly payments.\nYou can refer anyone working at any company you know. If their company goes on to become a customer of Expensify, you'll get paid. The best way to start is to submit a receipt to your boss (you'll get paid back and set yourself up for $250 if they start a subscription: win-win). You can read more about the referral program \nhere\n.\nThe world is crazy right now, not least for people in the tech industry, or those who are working on their business in general. As the most successful expense management tool in the market today, we’re seeing that every business, big and small, is working hard to track their expenses so they can keep growing despite a challenging market. If you know anyone using a tool that is not Expensify to manage expenses, it’s likely we can make their business more efficient and help with their spending. So while we have our wits about us, let’s help our peers weather the oncoming storm together.\n-david\nFounder and CEO of Expensify\nQuestions?  Ask me on Twitter!  \n@dbarrett\n \nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2023-05-04T10:15:36+00:00",
    "sent_at": "2023-05-04T10:15:33+00:00",
    "date_extracted": "2025-04-04T21:13:29.061714"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJesmizAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAHNqWJGdq7BIsmqwivTA6XA=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Magic links make signing in faster, easier, and more secure",
    "body": "Our goal is to make Expensify a little better every day in every way, and today's the day that we upgrade a very important flow: signing in.\ntl;dr - Starting today, you don't need your password to sign in.  Instead, we send a \"magic link\" to your email/phone to confirm you are you, and you are let in with a click. This is a phased roll-out so some of you will see this change sooner than others.\nThis is called a \"passwordless\" signin flow, which is widely recognized by the security industry as being a much better balance of security and convenience than the traditional password, for the following reasons:\nThe only way to remember a different password for each service is to make each password super simple, which is easy for an attacker to crack.\nThe only way to make a password hard to crack is to make it hard to memorize, which means you generally share the same password between many services.  But then when one service is hacked, the attackers get access to all the others.\nThe only way to not share secure passwords between sites is to use a password manager to store them all, which makes them \na lucrative target\n.\nThe only way to protect against mass leak of all your passwords is to change them frequently but \nchanging your password often is actually insecure too\n.\nNo matter how you slice it, passwords are a bad solution to an important problem. It's been over a century since \nspeakeasies stopped using passwords\n in the prohibition era 1920's, it's long past due we stop using them to secure our most important financial data.  So here's how Expensify's new signin process works:\nImagine you go to expensify.com, or install the Expensify app.\nYou enter your email address or phone number to sign in.\n    a. Note: If your company uses SAML or SSO for signin (either of which might prompt you for a password), those keep working – you are unaffected.\nA \"magic link\" will be emailed/texted to you – just click that link (or manually enter the \"magic code\"), and voila, you are signed in, quickly and securely, like magic!\n    a. Note: If you've \nenabled two-factor authentication (2FA) using a \"one time password\" (OTP) authenticator\n – which is a mouthful, but it's actually very easy and we strongly recommend it – you'll be asked to enter your signin code after clicking the magic link.\nYour app will stay signed in unless we need to re-confirm your access  (eg, if you change your account’s login email or phone number), at which time a new magic link will be sent to reauthenticate you.\nIt's a much better, safer, easier, and more convenient flow, and is fully rolled out for all accounts that formerly used Expensify passwords.  Other than just enjoying this new feature, you shouldn't need to do anything special.  However, it's probably a good time to:\nUpdate your mobile app, to make sure it has the latest magic signin flow.\nReview your Secondary Logins under \nSettings > Account > Account Details > Secondary Logins\n to ensure your logins listed are updated.\nSecure your account through \ntwo-factor authentication (2FA)\nThis is just one of many, many layered defenses Expensify has to protect your account data and financial flows. That now includes PCI level 1 certification, the highest level of security for businesses that manage credit card data.  If you have any questions at all about this new way to secure your account, just respond to this email and we'll help you out.  Thanks!\n-david\nFounder and CEO of Expensify\nQuestions?  Ask me on Twitter!  \n@dbarrett\n \nPS: This is probably obvious, but just in case you are wondering why we care so much about security: Expensify isn't just a place you go to talk.  We process billions of real dollars.  Accordingly, securing your account means securing your \nExpensify Card\n, your \nnext day reimbursement \nflow, your \ninvoiced income\n and \nbill payments\n.  We are a single superapp that not only handles every financial flow for your business, but with our focus on Send/Request Money in \nNew Expensify\n, also your personal payments.  So I hope you'll take the security of your account as seriously as we do!\nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2023-04-21T11:00:43+00:00",
    "sent_at": "2023-04-21T11:00:40+00:00",
    "date_extracted": "2025-04-04T21:13:32.923799"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJesmiyAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQACoL1Upyys1HnuuOW73bXnE=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Work like a boss in our San Francisco Lounge with complimentary cocktails, espresso, and more",
    "body": "tl;dr - Whether you live in San Francisco or are just passing through, come work alongside other digital nomads at our brand new \nExpensify Lounge\n! \nWhat: Indulge in \nfabulous espresso drinks, craft cocktails\n, and astonishing views\nWhere: 16th floor of \n88 Kearny St\n, San Francisco – in the heart of the financial district\nWhen: \nStarting April 24th\n, open M-F, 8 am to 6 pm\nHow: Just show up, sign in to wifi, and Concierge will \ndeliver drinks to your seat\nCapacity's limited, and we're currently admitting on a first-come-first-serve basis, so come early and stay for \nsunset champagne sabering\n! \nDoes your office look like this? Ours does! And yours can too, because our ufficio es su ufficio:\n \nDuring COVID, we went through an amazing transformation from an office space to this lounge for any Expensify member to work out of as often as they like, with complimentary drinks of all kinds. \nThink of it like \"high-end airport lounge\" meets \"co-working space\", optimized for like-minded individuals -- coffee in the morning and cocktails at night (or the reverse, no judgment) -- built into your existing Expensify membership, for as low as $9/mo. \nBecause Expensify isn't just a tool, it's a way of life. It's a community of people who want to GSD while living rich, having fun, and saving the world. Meet other members of the community in person, and not only is the first round on us, all of them are. \nIf you’re in San Francisco, come on in! If you’re somewhere else, reply to this email with the city you live in to help us choose our next lounge location. \n-david\nFounder and CEO of Expensify\nQuestions? Ask me on Twitter! \n@dbarrett\n \nPS: For a bit of backstory, we actually started this pre-COVID, in response to a strange problem. \nThough Expensify started in SF, we’ve been hiring outside of SF for over a decade, and decided to pay everyone SF wages, no matter where they lived. Bit by bit, our SF crew saw that you can succeed at Expensify from anywhere in the world, which led to people questioning if SF was the right place for them and their growing families. \nThis diaspora was aggravated further by our super high employee retention (2/3rd have been here over 4 years and 20% of folks over 8), which means people grew and their lives changed while here. They got dogs, and spouses, and kids (generally in that order), and kind of concluded they'd had enough of the \"San Francisco experience\" -- and wanted to try the PDX, NYC, MEL, or LHR experience (where we have other locations), or dozens of other cities around the world, or just become digital nomads entirely. \nSlowly but inexorably, we saw attendance in our SF office drop, risking it becoming a very, very well-appointed ghostland. We asked ourselves: \"How do we preserve the vibrancy of the office for those who do want to stay in SF?\" To answer that question, we started looking at where those who left were going to -- and we realized they were by and large going to far flung locations, and then working out of cafes. \nNow, we already have a lot of experience with the WFC (Work From Cafe) lifestyle from our \nannual trips abroad as a company\n. And we already knew firsthand that there was something magical about that tiny cafe in Hanoi that made it so much more fun to work from than even the best office in San Francisco. So after a lot of soul searching, we boiled it down to three main components: \n1) Great coffee.\n Not average coffee from some giant vat. Fresh ground, single-origin pour-over coffee. Freshly pulled espresso shots into a steamy cappuccino. Coffee so good you don't feel compelled to go to a coffee shop, because you are already in one. \n2) Great cocktails.\n We've got employees all over the world, so the sun never sets on the Expensify empire. But even when we were all in SF, the startup life doesn't end at sunset -- and at some point, you've just had too much coffee and want a change. Sometimes you want to code with a hand-mixed Old Fashioned by your side, kept cold by a giant ice cube. The Ballmer Peak is real. \n3) Great company. \nBut not your company.\n The one thing a cafe has that your office doesn't, is someone you work beside, but not with. As social media lowers barriers to meeting people online, it raises them between us in person, and the cafe is the last bastion where you can credibly meet someone new -- to hear a new perspective or discover a new opportunity. \nArmed with these epiphanies, we did what anybody would do: turn our office into the best co-working cafe in the city. We added a ridiculously over-the-top cocktail bar like you'd find tucked away in a Tokyo highrise and put in an espresso bar even us Portland coffee snobs can respect. Then we paired it with our integrated chat Concierge to offer to-your-seat delivery, powered it with our New Expensify chat system, and then dialed up the overall furnishings to 11. \nAnd you're welcome to come work here. I guarantee it's better than your office, or any office, and it's designed to be a better place to work than any cafe in the city, too. \nBut the open secret is that we didn't actually do it for you. We did it for us, to make our own lives better by having you in them. So if you come by, we don't say \"thank you\" to be polite. We mean it, we're glad to have you here. \nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2023-04-19T21:40:04+00:00",
    "sent_at": "2023-04-19T21:40:01+00:00",
    "date_extracted": "2025-04-04T21:13:54.564534"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJesmixAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAP6wpmn8b0pNleFP3u_Hd4E=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nGo to Miro →\n \nAPRIL 09 - 15\nHere’s how your team did last week\nTOP\nCohort 5: Advancing Inclusion Leaders Session\n2 editors last week!\nINACTIVE\nGlobal Dev product exercise\nBoard became inactive when a new was created on Monday Apr, 10.\nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nConner\n1 board created\nBastian Küntzel\n1 board edited\nCustomize\n your updates from Miro or \nunsubscribe\n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States",
    "received_at": "2023-04-18T18:07:11+00:00",
    "sent_at": "2023-04-18T18:06:05+00:00",
    "date_extracted": "2025-04-04T21:13:47.505540"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJW0fwsAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAErWNRN_IUs1u9paFe4JsEg=",
    "from": "e.richmond@lcwmail.com",
    "to": "l.baker@lcwmail.com, z.allerding@lcwmail.com",
    "reply_to": "e.richmond@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "Canceled: HOLD: BSC Group IDI (will expire 11/9)",
    "body": "Will delete once client confirms and official TeamUp notice comes.",
    "received_at": "2023-04-03T17:44:41+00:00",
    "sent_at": "2023-04-03T17:44:32+00:00",
    "date_extracted": "2025-04-04T21:14:14.912156"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJTDXeNAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQACLy151W-eZAmXTBy6kBhb4=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Updated Terms of Service",
    "body": "Hey there,\nWe've updated our Terms of Service and Privacy Policy. These updates support our new \nPayroll\n feature and \nMonthly Settlement\n on the \nExpensify Card\n. As always, we're sending this notification to everyone with an Expensify account. Continued use of Expensify following the update constitutes acceptance of our updated Terms of Service and Privacy Policy.\nReview Updated Terms\n \nThanks,\nConcierge\nPS: This is a one-time required legal notice sent to all Expensify users, even those who have unsubscribed from optional announcements. If you would like to never receive this again, please follow \nthese\n instructions to close your account. Thank you for your understanding.\nSent by: Expensify, Inc - 548 Market St #61434 - San Francisco, CA 94103",
    "received_at": "2023-03-23T08:37:01+00:00",
    "sent_at": "2023-03-23T08:36:57+00:00",
    "date_extracted": "2025-04-04T21:14:26.035711"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAJTDXeMAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAK1jAW6I3sZJov1B2sESCYY=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nGo to Miro →\n \nMARCH 12 - 18\nHere’s how your team did last week\nTOP\nCohort 5: Advancing Inclusion Leaders Session\n1 editor last week!\nINACTIVE\nCohort 3: Advancing Inclusion Leaders Session\nBoard became inactive when a new was created on Monday Mar, 13.\nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nTamara Thorpe\n1 board created\nCustomize\n your updates from Miro or \nunsubscribe\n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States",
    "received_at": "2023-03-21T15:43:28+00:00",
    "sent_at": "2023-03-21T15:41:34+00:00",
    "date_extracted": "2025-04-04T21:14:41.470664"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAI6t6QVAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQABcAmAKtQN1Ao0_icM9OUKw=",
    "from": "quarantine@messaging.microsoft.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "quarantine@messaging.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Microsoft 365 security: You have messages in quarantine",
    "body": "Review These Messages\n1 messages\n are being held for you to review as of \n2/23/2023 9:10:16 PM (UTC)\n. \nReview them within \n15 days of the received date\n by going to the \nQuarantine page\n in the Security Center. \nPrevented phish messages \nSender: \nmaureen@degnon.org \n \n \nSubject: \nReview Document \n \n \nDate: \n2/23/2023 8:18:26 PM \n \n \nReview Message \nRelease \nBlock Sender \n \n \n \n \n© 2023 Microsoft Corporation. All rights reserved. \nPrivacy Statement\n \nAcceptable Use Policy",
    "received_at": "2023-02-23T21:22:53+00:00",
    "sent_at": "2023-02-23T21:22:51+00:00",
    "date_extracted": "2025-04-04T21:15:21.018141"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAI6t6QUAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAHblNl_uio9Oq4Nahu1Adf8=",
    "from": "marketing@engage.canva.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "no-reply@canva.com",
    "in_reply_to": "N/A",
    "subject": "Zoe, don't  forget to register for the 'Unlock the power of Canva with your team' webinar ✨",
    "body": "Webinar: Unlock the power of Canva with your team ✨\n͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ \n \n \n \n \n \nDesign with Canva\n \n \n \n \nCollaborating on Canva? Join Rachael to learn how to work better together and discover the magic your team can create on Canva for Teams. ✨ \n \n \nRegister now\n \n \n \nWe are running \nmultiple webinars each week 🎉 \nso you can:\n \n \n \nBuild and grow your brand with Canva's brand management tools\n \n \n \nStreamline your creative workflows and collaborate with ease on presentations, whiteboards, social posts and more\n \n \n \nBoost team productivity with time-saving features\n \n \nRegistration includes live access to webinar and participation in chat!\n \n \n \n \nYou are receiving this email because you signed up to Canva.\n \n \n \n \nMade for you with \n from Canva\nCanva Pty Ltd\n, \n110 Kippax St, NSW 2010, Australia\n. \nABN 80 159 929 938\nIf you need assistance, get in touch with us via our \nHelp Center\n.\n \n \nVisit canva.com\n \nUnsubscribe\n \nManage Email Preferences",
    "received_at": "2023-02-21T18:24:15+00:00",
    "sent_at": "2023-02-21T18:24:08+00:00",
    "date_extracted": "2025-04-04T21:15:21.613633"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAI6t6QTAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAN2Yc7p8sDFGl1Zy2byaGhk=",
    "from": "marketing@engage.canva.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "no-reply@canva.com",
    "in_reply_to": "N/A",
    "subject": "Zoe, you're invited to the 'Unlock the power of Canva with your team' webinar ✨",
    "body": "Webinar: Unlock the power of Canva with your team ✨\n͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ \n \n \n \n \n \nDesign with Canva\n \n \n \n \nJoin Rachael to discover the magic your team can create on Canva for Teams!✨\n \n \nRegister now\n \n \n \nWe are running \nmultiple webinars each week 🎉 \nso you can:\n \n \n \nBuild and grow your brand with Canva's brand management tools\n \n \n \nStreamline your creative workflows and collaborate with ease on presentations, whiteboards, social posts and more\n \n \n \nBoost team productivity with time-saving features\n \n \nRegistration includes live access to webinar and participation in chat!\n \n \n \n \nYou are receiving this email because you signed up to Canva.\n \n \n \n \nMade for you with \n from Canva\nCanva Pty Ltd\n, \n110 Kippax St, NSW 2010, Australia\n. \nABN 80 159 929 938\nIf you need assistance, get in touch with us via our \nHelp Center\n.\n \n \nVisit canva.com\n \nUnsubscribe\n \nManage Email Preferences",
    "received_at": "2023-02-14T18:24:00+00:00",
    "sent_at": "2023-02-14T18:23:53+00:00",
    "date_extracted": "2025-04-04T21:15:48.144301"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAI2XataAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAC-y1mcNWb5IlZq2X2zp58A=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Meet George Clooney at ExpensiCon",
    "body": "Every \nExpensiCon\n has been hallmarked by a keynote discussion with an interesting customer – and given our tens of thousands of customers around the world, that gives us a lot of options.\nThe first customer we picked for the first ExpensiCon was Xero, represented by its then-CEO Rod Drury, who shared insights on how to build a multinational organization from the ground up and bring modern solutions to the SMB. The second customer was Bill.com, represented by its CEO Rene Lacerte, who talked about the need to balance your commitments to both your professional and personal life while being an effective leader.\nThis time around, our featured customer is the Clooney Foundation for Justice, represented by its co-founder, Oscar-winning actor & filmmaker \nGeorge Clooney\n.  As a recipient of the AFI Life Achievement Award, two Academy Awards, and the Nobel Peace Laureates’ Peace Summit Award – \nwe can think of no single individual who better demonstrates our ideals of Living Rich, Having Fun, and Saving the World.\nGeorge's legendary career as a film star in iconic films such as the Oceans trilogy, O Brother, Where Art Thou? or (my personal favorite) Solaris requires no introduction.  And on top of it, his Casamigos Tequila quickly became a standard on top shelves worldwide. \nHowever, what excites me the most is to talk with George about his incredible advocacy for freedom, democracy, and human rights around the world.  In 2016, Amal and George established the Clooney Foundation for Justice to advance justice through accountability for human rights abuses around the world.  Whether defending women in unjust courtrooms, negotiating the release of detained journalists, or aiding those experiencing the horrible atrocity of violence, the Clooney Foundation for Justice is a powerful force for good that should inspire us all.\nRegardless, as incredible as that will be, he is just one of many speakers covering a wide range of topics, from accounting to… something starting with Z.  Guests at ExpensiCon will mingle with speakers, and – more importantly – with the other guests, in breakout sessions, at dinner, over drinks, or in the pool.  There is truly no event like this in the world (and it doesn't come along often) so if you haven't already signed up, please head to \nExpensiCon.com\n to register your interest today.  \nIt's all expenses paid\n, so what have you got to lose?\nI can't wait to see you there.\n-david\nFounder and CEO of Expensify\nQuestions?  Ask me on Twitter!  \n@dbarrett\n \nPS: If you’re not already in the running to \nwin your spot at ExpensiCon\n - there’s still time, so get started today! Five lucky winners will not only score an all-expenses paid trip (with a guest!) to ExpensiCon in Italy, they’ll also \nmeet George Clooney \nat an exclusive VIP event! \nPPS: Not an ExpensifyApproved! Accountant yet?  No problem, it costs nothing and you get killer perks for your firm and clients. Some notable ones include:\nPartner Manager - a dedicated point of contact for escalations, firmwide trainings, strategic goal planning, and new initiatives.\nClient Setup Specialist - an onboarding expert to help accountants implement Expensify for their clients, configure accounting integrations, and more.\nClient Account Manager - a day-to-day product specialist for any client questions that come up, with best practices in mind along the way.\nSpecial client pricing - with no annual commitment, so your firm can adapt as new clients onboard or previous clients move everything in-house.\nGet started \nhere\n. \nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103\nTo unsubscribe, please click \nhere",
    "received_at": "2023-02-08T08:40:56+00:00",
    "sent_at": "2023-02-08T08:40:39+00:00",
    "date_extracted": "2025-04-04T21:16:00.831072"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIxEblRAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAMONg8LeyHFOq4NDV46ga_c=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nGo to Miro →\n \nJANUARY 22 - 28\nHere’s how your team did last week\nCheck more news and updates from your Miro team\n \nWelcome 1 new team member:\nBastian Küntzel joined your team. Make sure you share all relevant boards with them.\nAsk your Miro Heroes how to better collaborate in Miro\nAnnelie Wambeek\n1 board edited\nBrenda Panagrossi\n1 board edited\nElizabeth Loverso\n1 board edited\nCustomize\n your updates from Miro or \nunsubscribe\n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States",
    "received_at": "2023-01-31T14:55:31+00:00",
    "sent_at": "2023-01-31T14:52:42+00:00",
    "date_extracted": "2025-04-04T21:16:34.016910"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIs-4kdAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQADF-_ayGr_1IviNrrqtt_dI=",
    "from": "noreply@tax1099.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "noreply@tax1099.com",
    "in_reply_to": "N/A",
    "subject": "Tax Document from eShares, Inc",
    "body": "Dear Language & Culture Worldwide, LLC,\nGreetings from \nTax1099.com\n ! \nYour \n1099-NEC\n was submitted by \neShares, Inc\n for \n2022\n.\n \nInstructions for opening the form:\nClick on the attachment provided with this email. You will be prompted for your password, which is 8 characters. Please enter the first 4 letters of the name listed after the word 'Dear...' at the beginning of this email, all lowercase, and the last 4 digits of the tax ID (either SSN/EIN or ITIN). \nFor example:\n \n1. If your name appears on the form as Andrew Johnson with an SSN of 711223456, then the password would be andr3456 (first 4 characters of your Full Name / Business Name + last 4 digits of your SSN/ITIN number).\n2. If your business name appears on the form as \nA & D\n with ITIN as 012847934, then the password would be ad7934 (first 2 characters without spaces and special characters of your organization name + last 4 digits of your ITIN/EIN number).  \n3. If your business name appears on the form as Andrew Johnson PLLC with ITIN as 012847934, then the password would be andr7934 (first 4 characters of your organization name + last 4 digits of your ITIN/EIN number). \n4. If your name appears on the form as Al & D with ITIN as 517223355, then the password would be ald3355 (first 3 characters (ignore special characters and spaces) of your Full Name / Business Name since the Full Name / Business Name is shorter than 4 characters + last 4 digits of your SSN/ITIN number).\n5. If your name appears on the form as Andrew Johnson without an SSN/ITIN number, then the password would be andr (first 4 characters of your Full Name / Business Name). \n6. If your name appears on the form as Al & D without SSN/ITIN number, then the password would be ald (first 3 characters (ignore special characters and spaces) of your Full Name / Business Name since the Full Name / Business Name is shorter than 4 characters). \n7. If your name or business name appears on the form as My Test with TIN as 012847934, then the password would be myte7934 (first 4 characters of your name or organization name + last 4 digits of your TIN/EIN/SSN number). \nIf you encounter any problem in opening your eForm, please check whether:\n \n1.You have entered the first 4 characters of your name/organization name (in lowercase letters).\n2.You have entered the last 4 digits of your SSN/ITIN/EIN number. \nAfter downloading, If this form's intended owner does not want the saved PDF file to keep the password requirement, please attempt the following PDF altering methods:\n \n1.Open the PDF file using Adobe reader > After entering the PDF password for the first time you can disable it using adobe options.\n2.Open the PDF in any browser > enter password > print > select the option to Save as PDF and the new PDF that is saved will not have the password. \nDepending on your personal spam filter settings, your eForms might be directed to your junk folder rather than Inbox. Please check in both places. If you have questions or need further assistance, please contact the Payer \neShares, Inc\n at Phone #\n(801) 471-4608\n or ap@carta.com. \nThanks for your business. \n \n*DO NOT REPLY TO THIS E-MAIL MESSAGE* \nCopyright © \ntax1099.com \nAll Rights Reserved.",
    "received_at": "2023-01-26T08:53:10+00:00",
    "sent_at": "2023-01-26T08:52:10+00:00",
    "date_extracted": "2025-04-04T21:16:35.703575"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIs-4kcAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAFcPWdqpPqNJhY-yvI4UngA=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nGo to Miro →\n \nJANUARY 15 - 21\nHere’s how your team did last week\nTOP\nStakeholder RACI Map\n1 editor last week!\nINACTIVE\nCopy of Advancing Inclusion Leaders Sesssion\nBoard became inactive when a new was created on Tuesday Jan, 17.\nCheck more news and updates from your Miro team\nAsk your Miro Heroes how to better collaborate in Miro\nBenedikt Grindel\n1 board created\nCustomize\n your updates from Miro or \nunsubscribe\n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States",
    "received_at": "2023-01-24T14:32:55+00:00",
    "sent_at": "2023-01-24T14:31:50+00:00",
    "date_extracted": "2025-04-04T21:16:38.043276"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIfXuDeAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAPo8avRggq9Ihl0itt2m0Hc=",
    "from": "marketing@lcwmail.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "/o=ExchangeLabs/ou=Exchange Administrative Group (FYDIBOHF23SPDLT)/cn=Recipients/cn=0fe6e892042844dd88107d86cd579f9b-Marketing20",
    "in_reply_to": "N/A",
    "subject": "📮 Don't miss out on curated DEI content!",
    "body": "Opt in to our emails by January 16.\n \nView this email in your browser\nCurate Your DEI Content\nDear Zoe,\nHappy New Year! We’d love to stay in touch about your DEI journey and the exciting LCW content we have planned for 2023. Here’s a sneak peek of what’s to come:\nA brand-new podcast season featuring personal stories about workplace inclusion\nTimely webinars designed to upskill cultural competence throughout the year\nThought leadership pieces to spark brave conversations on diverse teams\nTo opt in to curated email updates, please fill out our mailing preferences survey by \nJanuary 16\n—\nif we don’t hear from you by then, you will be removed from our mailing system.\nHow can we best meet your needs this year?\nTake Survey\nWe hope that 2023 brings you and your organization what you need and look forward to a new year of fostering connections across our culturally diverse world.\nSincerely,\nTeam LCW\nCopyright © Language & Culture Worldwide, LLC, All rights reserved.\nOur mailing address is:\nLanguage & Culture Worldwide, LLC\n100 S Saunders Rd, Suite 150\nLake Forest, IL 60045\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe",
    "received_at": "2023-01-09T18:40:51+00:00",
    "sent_at": "2023-01-09T18:40:43+00:00",
    "date_extracted": "2025-04-04T21:17:02.442941"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIarfg-AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAANRF9rbbc1CiNlg1Swa_q4=",
    "from": "marketing@lcwmail.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "/o=ExchangeLabs/ou=Exchange Administrative Group (FYDIBOHF23SPDLT)/cn=Recipients/cn=0fe6e892042844dd88107d86cd579f9b-Marketing20",
    "in_reply_to": "N/A",
    "subject": "🎁 Customized DEI content in your inbox",
    "body": "Curate your LCW experience for 2023!\n \nView this email in your browser\nWe'd love to stay in touch!\nDear Zoe,\nWith the new year quickly approaching, we wanted to reach out about the exciting culture-first content to come in 2023:\nA brand-new podcast season featuring personal stories about workplace inclusion\nTimely webinars designed to upskill cultural competence throughout the year\nThought leadership pieces to spark brave conversations on diverse teams\nWe will be launching a revamped email communications system to include curated updates based on interest, and we’d love for you to be part of the process.\nPlease fill out our mailing preferences survey by \nJanuary 16\n:\nTake Survey\nWe look forward to the exciting opportunities brought with the new year and hope to connect soon!\nSincerely,\nTeam LCW\nCopyright © Language & Culture Worldwide, LLC, All rights reserved.\nOur mailing address is:\nLanguage & Culture Worldwide, LLC\n100 S Saunders Rd, Suite 150\nLake Forest, IL 60045\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe",
    "received_at": "2022-12-28T15:09:43+00:00",
    "sent_at": "2022-12-28T15:09:36+00:00",
    "date_extracted": "2025-04-04T21:17:04.569648"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIUx1lGAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAMfg0i8vvy1EuJO0mJhAOwQ=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "Go to Miro\nDECEMBER 11 - 17\n \nHere’s how your team did last week\n \nGlobal Dev product exercise\n \nTOP\n \n \n1 editor\n last week! \n \nAdvancing Inclusion Leaders Sesssion\n \nINACTIVE\n \n \nBoard became inactive when a new was created on Thursday Dec, 15.\n \n \nCheck more news and updates from your Miro team\n \n \nAsk your Miro Heroes how to\nbetter collaborate in Miro\n \n \nGrace Vottero\n1 board created \n \nWork seamlessly no matter where you go with Miro apps for iOS, Android and desktop. \nDownload Miro apps\n \n \nBlog\n \n \n \nWe're hiring!\n \nCustomize\n your updates from Miro or \nunsubscribe\n.",
    "received_at": "2022-12-20T15:45:58+00:00",
    "sent_at": "2022-12-20T15:36:06+00:00",
    "date_extracted": "2025-04-04T21:17:19.375570"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIR8C2tAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQABqFyZA-HtZFgtk4KVtVwek=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "Go to Miro\nDECEMBER 04 - 10\n \nHere’s how your team did last week\n \n \nCheck more news and updates from your Miro team\n \n \n \nWelcome 2 new team members:\nFawzi Mesmar\n and \nCameron Lee\n joined your team. Make sure you share all relevant boards with them.\n \n \nAsk your Miro Heroes how to\nbetter collaborate in Miro\n \n \nKim Tran\n1 board edited \n \n \nMarine de la Seigliere\n1 board edited \n \n \nIstvan Tajnay\n1 board edited \n \nWork seamlessly no matter where you go with Miro apps for iOS, Android and desktop. \nDownload Miro apps\n \n \nBlog\n \n \n \nWe're hiring!\n \nCustomize\n your updates from Miro or \nunsubscribe\n.",
    "received_at": "2022-12-13T14:39:01+00:00",
    "sent_at": "2022-12-13T14:36:30+00:00",
    "date_extracted": "2025-04-04T21:17:31.404590"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIR8C2sAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAIddGVKyR_ZFh6NR6eZMhiA=",
    "from": "marketing@lcwmail.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "/o=ExchangeLabs/ou=Exchange Administrative Group (FYDIBOHF23SPDLT)/cn=Recipients/cn=0fe6e892042844dd88107d86cd579f9b-Marketing20",
    "in_reply_to": "N/A",
    "subject": "☑️ LCW Survey: Curate your DEI experience",
    "body": "We'd love your feedback as we plan for 2023!\n \nView this email in your browser\nWe'd love to stay in touch!\nDear Zoe,\nAs 2023 approaches, LCW is excited to continue providing impactful resources that inspire kindness, deepen understanding, and foster equity in our culturally diverse world.\nWe’ll be launching a quarterly newsletter along with individually curated announcements to help our community stay up to date on what matters most to them, \nand we wanted to give you a chance to be part of the process\n. \nHere’s a preview of the DEI content you can look forward to in the coming year:\nA brand-new podcast season featuring personal stories about workplace inclusion\nTimely webinars designed to upskill cultural competence throughout the year\nThought leadership pieces to help spark brave conversations on diverse teams\nFill out our mailing preferences survey to let us know how we can best meet your needs.\nTake Survey\nWe appreciate your feedback and support as a valued member of our community, whether past or present.\nSincerely,\nTeam LCW\nCopyright © Language & Culture Worldwide, LLC, All rights reserved.\nOur mailing address is:\nLanguage & Culture Worldwide, LLC\n100 S Saunders Rd, Suite 150\nLake Forest, IL 60045\nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe",
    "received_at": "2022-12-13T14:29:52+00:00",
    "sent_at": "2022-12-13T14:29:44+00:00",
    "date_extracted": "2025-04-04T21:17:25.562525"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAIE22F5AAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAERGMI3pj_pNoGUFySYaqpA=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "Go to Miro\nNOVEMBER 13 - 19\n \nHere’s how your team did last week\n \nCohort 3: Advancing Inclusion Leaders Session\n \nTOP\n \n \n1 editor\n last week! \n \nCopy of Advancing Inclusion Leaders Sesssion\n \nNEW\n \n \nAda\n created on Tuesday Nov, 15.\n \nQuick Retrospective\n \nINACTIVE\n \n \nBoard became inactive when a new was created on Tuesday Nov, 15.\n \n \nCheck more news and updates from your Miro team\n \n \nAsk your Miro Heroes how to\nbetter collaborate in Miro\n \n \nAda\n2 boards created \n \nWork seamlessly no matter where you go with Miro apps for iOS, Android and desktop. \nDownload Miro apps\n \n \nBlog\n \n \n \nWe're hiring!\n \nCustomize\n your updates from Miro or \nunsubscribe\n.",
    "received_at": "2022-11-22T14:25:09+00:00",
    "sent_at": "2022-11-22T14:23:48+00:00",
    "date_extracted": "2025-04-04T21:18:07.586878"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAH8V9kfAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAI7yRStRbpBDm5pQWjt-8f4=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "Go to Miro\nOCTOBER 30 - NOVEMBER 05\n \nHere’s how your team did last week\n \n \nCheck more news and updates from your Miro team\n \n \nAsk your Miro Heroes how to\nbetter collaborate in Miro\n \n \nAda\n1 board edited \n \nWork seamlessly no matter where you go with Miro apps for iOS, Android and desktop. \nDownload Miro apps\n \n \nBlog\n \n \n \nWe're hiring!\n \nCustomize\n your updates from Miro or \nunsubscribe\n.",
    "received_at": "2022-11-08T15:16:18+00:00",
    "sent_at": "2022-11-08T14:49:37+00:00",
    "date_extracted": "2025-04-04T21:18:28.504357"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHzBu6SAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQANyxz5G7JT1Ok9J6llIxJ38=",
    "from": "jpeterson@leaderfactor.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "support@leaderfactor.com",
    "in_reply_to": "N/A",
    "subject": "Upcoming Webinar and Giveaway: Hiring, Firing & Promotion with Psychological Safety",
    "body": "As an HR leader you have to make a lot of the tough calls, and we don’t envy you. During this live virtual event we’ll take you through some of the nuances of psychological safety as it relates to your role.\n \n \nAs an HR leader you have to make a lot of the tough calls. We don’t envy you, but we’re here to help. During this live virtual event we’ll take you through the basics (and some of the nuances) of psychological safety as it relates to your role:\nCan you really know who will help or hurt your company culture from just an interview?\nIs psychological safety a big enough deal to cause someone to lose their job?\nShould cultural impact be considered in the promotion process?\nThese are the kinds of tough questions we’ll answer during the event on Thursday, November 17th at 12pm EST. Stay tuned.\nRegister For the Event\n \n \nIn the meantime, do you want a free license to our online course? Or the chance to win a free signed copy of The 4 Stages of Psychological Safety? Share this event and invite 500 of your LinkedIn connections to attend and we’ll get you set up. That's $100 of value in under five minutes.\nLet's Do It\n \n \nBack by popular demand is another special episode talking about engagement and psychological safety. Tim and Junior talk about which is a lead measure, which is a lag measure, and which is a consequence of the other. This episode comes from a previous webinar recorded in 2021.\nListen Now\n \n \n \n \n \n \nLeaderFactor, Suite C, Alpine, UT 84004, USA \nManage preferences",
    "received_at": "2022-10-26T19:16:46+00:00",
    "sent_at": "2022-10-26T19:16:43+00:00",
    "date_extracted": "2025-04-04T21:19:13.890316"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHzBu6RAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQALbNhtCZrdBBqKaubGFFA78=",
    "from": "weekly@updates.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "weekly@updates.miro.com",
    "in_reply_to": "N/A",
    "subject": "Processes team Weekly Digest",
    "body": "Go to Miro\nOCTOBER 16 - 22\n \nHere’s how your team did last week\n \nAdvancing Inclusion Leaders Sesssion\n \nTOP\n \n \n11 editors\n last week! \n \nPairings\n \nNEW\n \n \nAda\n created and 1 other edited since Tuesday Oct, 18.\n \nUntitled\n \nINACTIVE\n \n \nBoard became inactive when a new was created on Tuesday Oct, 18.\n \n \nCheck more news and updates from your Miro team\n \n \n3+\n \n \nWelcome 12 new team members:\nHelene Juguet\n, \nFabrice Navrez\n, \nClint Hocking\n, \nJulian Gerighty\n, \nJason Schroeder\n, \nCedrick Delmas\n, \nVanessa Vignon\n, \nMiguel Paniagua\n, \nFabien Hersen\n and \n3 more\n joined your team. Make sure you share all relevant boards with them.\n \n \nAsk your Miro Heroes how to\nbetter collaborate in Miro\n \n \nAda\n2 boards created \n \n \nClint Hocking\n1 board edited \n \n \nFabien Hersen\n1 board edited \n \nWork seamlessly no matter where you go with Miro apps for iOS, Android and desktop. \nDownload Miro apps\n \n \nBlog\n \n \n \nWe're hiring!\n \nCustomize\n your updates from Miro or \nunsubscribe\n.",
    "received_at": "2022-10-25T13:13:13+00:00",
    "sent_at": "2022-10-25T13:10:28+00:00",
    "date_extracted": "2025-04-04T21:19:34.012443"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHvakEHAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAFBEjUnYPQpCqjBit70bYds=",
    "from": "jpeterson@leaderfactor.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "support@leaderfactor.com",
    "in_reply_to": "N/A",
    "subject": "[Newsletter] What is Challenger Safety?",
    "body": "Do you invite others to disagree with you? These kinds of questions will help you diagnose the levels of challenger safety in your organization.\n \n \nWhat is Challenger Safety? \n \nChallenger safety is psychological safety's culminating stage. It's where innovation takes off and team members feel the full effects of inclusion, respect, and autonomy.\n \nWhen was the last time you challenged the status quo in your organization?Are questions welcome on your team? Do you feel the risk of ridicule on your team? Do you invite others to disagree with you? These kinds of questions will help you diagnose the levels of challenger safety in your organization.\nLearn More\n \n \nWhat does it take to innovate on dynamic teams? At the end of the day, a lack of innovation is a culture issue, and knowing that is a game-changer. A culture-changer, if you will. Our hosts share their practical tips on how to do just that, and more, in this value-packed series finale.\nListen Now\n \nDon't Let Hierarchy Stifle Innovation\n \nMany non-management employees consider innovation outside the scope of their jobs. Even when they want to participate, they don’t because the organization’s tacit norms discourage it. In this Harvard Business Review article, Tim Clark gives three practical steps to neutralize authority bias, embrace cultural flatness, and unleash bottom-up innovation.\nRead the Full Article\n \n \nIn this episode of Culture by Design, Tim gives listeners behind-the-scenes insights into the theory behind his recent HBR article, Don't Let Hierarchy Stifle Innovation.\nListen Now\n \n5 Behaviors That Foster Challenger Safety\n \nWhat does challenger safety look like in practice? Here are five things to try:\n \nDownload This Note\n \n \n \n \n \n \nLeaderFactor, Suite C, Alpine, UT 84004, USA \nManage preferences",
    "received_at": "2022-10-19T19:16:55+00:00",
    "sent_at": "2022-10-19T19:16:48+00:00",
    "date_extracted": "2025-04-04T21:19:56.535581"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHvKAtWAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQALVlDNO8UUZGr7DGE0hB3_s=",
    "from": "e.richmond@lcwmail.com",
    "to": "j.cookson@lcwmail.com, z.allerding@lcwmail.com",
    "reply_to": "e.richmond@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "Canceled: HOLD: BSC Group IDI (will expire 11/9)",
    "body": "Will delete once client confirms and official TeamUp notice comes.",
    "received_at": "2022-10-18T16:36:59+00:00",
    "sent_at": "2022-10-18T16:36:54+00:00",
    "date_extracted": "2025-04-04T21:19:59.232437"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHlu8SQAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAHWNGJioWUtBjuX4FYvrQzg=",
    "from": "jpeterson@leaderfactor.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "support@leaderfactor.com",
    "in_reply_to": "N/A",
    "subject": "[Newsletter] Contributor Safety: 4 Models to Shape Your Thinking",
    "body": "Can you create value on your team? Without contributor safety, your teams will execute more than they innovate. Give them the autonomy they crave with these simple suggestions.\n \n \nWhat is Contributor Safety?\n \n \nThere’s a reason why we’ve automated so many monotonous workplace tasks as technology has advanced: Humans crave fulfillment, and work is meaningful when we can create value, not just complete tasks. Contributor safety, the third stage in The 4 Stages of Psychological Safety, protects our innate desire to do just that. \n \nSometimes we get in our own way. Sometimes we get in each other’s way.\nLearn More\n \n \nOn this week's episode of the Culture by Design podcast, Tim and Junior continue the series with Stage 3: Contributor Safety. They ask the question, why do we hate being micromanaged? And what does that have to do with psychological safety?\nListen Now\n \nContributor Safety: \n4 Models to Shape Your Thinking\n \nRead the Full Article\n \n5 Behaviors That Foster Contributor Safety\n \nWhat does contributor safety look like in practice? Here are five things to try:\n \nDownload This Note\n \n \n \n \n \n \nLeaderFactor, Suite C, Alpine, UT 84004, USA \nManage preferences",
    "received_at": "2022-10-12T19:16:47+00:00",
    "sent_at": "2022-10-12T19:16:43+00:00",
    "date_extracted": "2025-04-04T21:20:00.702195"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHlu8SPAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQADyjssCnSohPqAOC5fyfR2s=",
    "from": "replies+65643336@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "replies+65643336@expensify.com",
    "in_reply_to": "N/A",
    "subject": "Expensify Chat between Concierge and zoe@lcwmail.com",
    "body": "Just snap a photo of any receipt with the Expensify mobile app, and SmartScan automatically transcribes the details – no manual entry required! Get started with SmartScan \nhere.\n For questions, just reply to this message.\nSwitch to \nlive chat\n in Expensify for faster responses.",
    "received_at": "2022-10-08T11:13:21+00:00",
    "sent_at": "2022-10-08T11:13:15+00:00",
    "date_extracted": "2025-04-04T21:20:25.380094"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHlu8SOAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAI5LWBhjpAhBqKdkBl-Axcw=",
    "from": "concierge@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "concierge@expensify.com",
    "in_reply_to": "N/A",
    "subject": "Quick question about Expensify",
    "body": "Hi!\nConsidering your experience with us so far, how likely are you to recommend Expensify to someone in your personal or professional network?\n0\n   \n1\n   \n2\n   \n3\n   \n4\n   \n5\n   \n6\n   \n7\n   \n8\n   \n9\n   \n10\n0 = not likely\n10 = very likely\nWe look forward to hearing from you!",
    "received_at": "2022-10-07T19:19:47+00:00",
    "sent_at": "2022-10-07T19:19:41+00:00",
    "date_extracted": "2025-04-04T21:20:21.545704"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHlu8SNAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAHnYJt5SAV1KjI_qsyc7LuI=",
    "from": "team@e.miro.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "reply-fef915757d6503-51_HTML-7835658-536001475-3340@e.miro.com",
    "in_reply_to": "N/A",
    "subject": "What’s New, Atlassian on Agile and Empathy, and More",
    "body": "How You Collaborate Is Improving. Let’s See What’s New. \n͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   ͏ ‌   \n \nGo to Miro →\n \n \nFirst look: Save your spot to see what’s new for you\nSave the date\n for our What’s New product showcase featuring an in-depth walkthrough of our latest standout releases. \nJoin us October 26 at 10 am CET or 10 am PDT. \nMiro product leaders will give you the scoop on:\n•\nBoard enhancements: \nPaste content from spreadsheets directly as tables.\n•\nClearer diagramming: \nUse new alignment guides and dimensions to create a beautiful diagram.\n•\nMagical integrations: \nTap into\n Smartsheet\n and \nMiro\n to easily convert sticky notes to rows in a new or existing sheet within Smartsheet.\nSave your spot →\n \nHow Atlassian builds Agile practices and empathy with Miro\n \nLearn how Agile boosts hybrid work\nSee how product managers use Agile practices to get more done.\nWatch on demand →\n \n \nTry the Team Playbook Workshop\nBring empathy to the remote experience with this template.\nTry the template →\n \n \nPresent work where it happens\nPresentations in Miro let you create and showcase beautifully designed, engaging, and easy-to-share decks in minutes, without leaving Miro and all your project work. Check out the latest:\n•\nBulk-select frames to reorder, delete, or hide them\n•\nOrganize your frames in one click with Magic Organize\n•\nCrop your images to different shapes and sizes\n•\nKeep everything neat in a frame with alignment guides\nTry presentation mode →\n \nWork better with new Miro apps\n \nSync Smartsheet data across tools\nWith 2-way sync, convert Miro sticky notes to \nSmartsheet\n rows & add Smartsheet rows into Miro.\nAdd Smartsheet →\n \n \nTranslate easily right on the board\nSelect the content to translate and choose from 100s of languages.\nAdd Easy Translator →\n \n \nMake your work a work of art\nLeverage 1000s of hand-drawn sketches from the world’s best visual thinkers.\nAdd Drawify →\n \n \nFind and fix board content fast\nSearch and replace your Miro board content using powerful filters.\nAdd Super Search →\n \n \nHow MYOB streamlined their toolstack and increased engagement\nExplore how this leading business management platform used Miro to bring teams and projects together to achieve real, measurable results.\nRead their story →\n \nVirtual & live event\nBig Picture and Systems Design\nOctober 13 at 12pm ET / 6pm CEST \nHear from an expert panel discussing the new Strategic Design Kit from \nCarnegie Mellon University\n, and how it can benefit startups, corporations, and nonprofits.\nGrab a seat →\n \nVirtual event\nDistributed '22\nNovember 15-16 \nSave the date\n for our annual virtual event. We’ll go beyond the screen and our relentless busyness to explore ideas, creativity, and even idleness.\nRSVP →\n \n \nNew: Brand asset catalog apps, Azure x Miro sync, and line breaks in lists\nHighlights from our August releases:\n•\nBuild your brand \nasset catalog app\n: Use our Developer Platform to build an asset catalog app on Miro and connect it to your DAM.\n•\nAzure 2-way sync\n and auto-changes across platforms\n: Create and edit \nAzure\n DevOps work items from Miro and turn Miro sticky notes and cards into \nAzure\n cards.\n•\nRead easy with line breaks in lists\n: Make text easier to read by adding breakpoints across multiple lines with \nShift + Enter\n.\nSee all the new releases →\n \nHappy collaborating,\nThe Miro Team\n \n \n \n \n \nBlog\n \nEvents \nAcademy\n \nCommunity\n \nMiro, 201 Spear St., Suite 1100\nSan Francisco, CA 94105, United States\nUnsubscribe",
    "received_at": "2022-10-07T01:15:01+00:00",
    "sent_at": "2022-10-07T01:14:54+00:00",
    "date_extracted": "2025-04-04T21:20:28.909051"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHlu8SMAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAOqz6MCFVa5MspXY4KfBnK4=",
    "from": "jpeterson@leaderfactor.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "support@leaderfactor.com",
    "in_reply_to": "N/A",
    "subject": "[Newsletter] What is Learner Safety?",
    "body": "When you don’t have it, your team executes more than they innovate. They stay stagnant and lose their competitive advantage. \n \n \nWhat is Learner Safety? \n \nIt's a culture where learning is encouraged and celebrated, and where learners are protected in their efforts to push boundaries. When you don’t have it, mistakes are hidden and punished. Your team executes more than they innovate. They stay stagnant and lose their competitive advantage.\nLearn More\n \n \nOn this week's episode of the Culture by Design podcast, Tim and Junior tackle some tough, relevant questions for learners and leaders everywhere: How do you detach fear from mistakes? How do you appropriately reward failure?\nListen Now\n \nThe Secret to Building Trust in Teams\n \nTrust = Psychological Safety + Consistency. Don’t expect perfect, shatterproof trust to immediately come from day one of your culture initiative. \nTrust builds across an organization when psychological safety is met with consistency. \nHow could you ever expect a culture of trust to come from toxicity? \nRead the Full Article\n \n \nIn this episode of Culture by Design, Jeri Larsen shares her tips and tricks for being an aggressive, self-directed learner. Turns out, you can't do it alone.\nListen Now\n \n5 Behaviors That Foster Learner Safety\n \nSure, we can talk about it, but how do you really make sure your teams know that they're safe to learn? We've got your back. Check these out. \nDownload This Note\n \nHow to Increase Intellectual Bravery\n \nWatch the Webinar\n \n \n \n \n \n \nLeaderFactor, Suite C, Alpine, UT 84004, USA \nManage preferences",
    "received_at": "2022-10-05T19:16:55+00:00",
    "sent_at": "2022-10-05T19:16:50+00:00",
    "date_extracted": "2025-04-04T21:20:34.569387"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHlu8SLAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAOtXAJjsok1NmMoxi_ubl3k=",
    "from": "davidb@expensify.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "davidb@expensify.com",
    "in_reply_to": "N/A",
    "subject": "[Expensify] Win your spot at ExpensiCon",
    "body": "In May 2023, we’re hosting 100 of the world’s top accounting thought leaders at the legendary Borgo Egnazia hotel in Puglia, Italy for our premier, invite-only conference: \nExpensiCon\n. And you have a chance to win your spot at this once-in-a-lifetime experience – all expenses paid.\nIf you’re an accountant:\nSign up at \nexpensicon.com\nComplete \nExpensifyApproved! University\n with a passing score\nMake sure you’re a \npolicy admin\n and \ndomain admin\n on your clients’ accounts\nOnboard your clients onto Expensify and/or activate their Expensify Cards\nEach new active user and/or activated card increases your chance of winning. Winners will be chosen at random, so everyone has a chance to win! More details at \nhttps://expensicon.com/winyourspot\n.\nNot an accountant? No problem! I’m also going to personally pick one person from all the signups — be they an executive, employee, artist, scientist, musician, acrobat, student, or just total rando – who makes the most interesting pitch for why they should be there. Just fill out the form at \nexpensicon.com\n and make your best pitch – can't wait to see you there!\n-david\nFounder and CEO of Expensify\nQuestions? Ask me on Twitter! \n@dbarrett\n \nPS: Already working with a partner manager? You’re probably well on your way to ExpensiCon, so I suggest you continue working with them or reach out to them to learn how you can enter.\nSent by: Expensify, Inc. - 548 Market St #61434 - San Francisco, CA 94103 \nTo unsubscribe, please click \nhere",
    "received_at": "2022-10-05T02:49:01+00:00",
    "sent_at": "2022-10-05T02:48:54+00:00",
    "date_extracted": "2025-04-04T21:20:27.547428"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHjD4-RAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAH5dAXC8bkKDiNTkP5EXSvA=",
    "from": "e.richmond@lcwmail.com",
    "to": "j.cookson@lcwmail.com, z.allerding@lcwmail.com",
    "reply_to": "e.richmond@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "Canceled: HOLD: BSC Group IDI (will expire 11/9)",
    "body": "Will delete once client confirms and official TeamUp notice comes.",
    "received_at": "2022-09-30T15:10:24+00:00",
    "sent_at": "2022-09-30T15:10:18+00:00",
    "date_extracted": "2025-04-04T21:20:51.946987"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHg8UGqAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQAGomAq8kgc9Dv1L8RZRJV1g=",
    "from": "jpeterson@leaderfactor.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "support@leaderfactor.com",
    "in_reply_to": "N/A",
    "subject": "[Newsletter] What is Inclusion Safety?",
    "body": "Psychological safety can't happen without a foundation of inclusion. How can you expect people to try new things, speak up, and spark change if they don't feel safe being their authentic selves at work?\n \n \nWhat is Inclusion Safety? \n \nPsychological safety can't happen without a foundation of inclusion. How can you expect people to try new things, speak up, and spark change if they don't feel safe being their authentic selves at work? Once people feel confident that they belong on their team, they'll be ready to progress across The 4 Stages of Psychological Safety™. \nLearn More\n \n \nThis week on the Culture by Design podcast, Tim and Junior introduce the first episode of a four-part series on The 4 Stages of Psychological Safety. This week's topic? Stage One: Inclusion Safety. In this value-packed, hour-long conversation, Tim and Junior dive deep into questions like: How does inclusion relate to diversity and equity? Is interaction the same thing as connection? And what can we do to foster inclusion safety in our cultural spheres? \n \nListen to this episode of the \nCulture by Design Podcast,\n \"\nStage One: Inclusion Safety\n\" available on all channels. \nListen Now\n \n \nIn this episode of Culture by Design, Chantal le Roux, Inclusion, Diversity and Equity Program Manager at Amazon Web Services joins Timothy R. Clark to talk about how to embed inclusive strategy into workplace culture. It’s core business, something that people need to take ownership of in order to create spaces that are truly psychologically safe.\nListen Now\n \n \nPsychological Safety at Work\nDo you know if your organization has psychological safety? Learn which warning signs to look out for and best practices for measuring it on your teams.\nRead the Full Article\n \n \nBuilding Connection in a Remote Team\n \nWith intentional effort, your remote team can feel just as connected as an in-office team. Here are some LeaderFactor tried-and-true methods of remote connection:\nDownload This Note\n \nWhat Does Inclusive Behavior Look Like?\n \nDownload This Guide\n \n\"Inclusion safety is not earned but owed. Every human has title to it as a nonnegotiable right.\"\n–  Timothy R. Clark\n \n \n \n \n \nLeaderFactor, Suite C, Alpine, UT 84004, USA \nManage preferences",
    "received_at": "2022-09-28T19:16:49+00:00",
    "sent_at": "2022-09-28T19:16:46+00:00",
    "date_extracted": "2025-04-04T21:21:20.945384"
  },
  {
    "email_id": "AAMkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgBGAAAAAACsu-bUdln7QJzW_hnhbD6_BwCpOZeAU-mCTJPHXDIEse5OAAAAAAEMAACpOZeAU-mCTJPHXDIEse5OAAHdVNaiAAA=",
    "conversation_id": "AAQkADJlNjlhN2Y1LWYwOTAtNDhjZS04NGUzLTMzNTBlZTc4MjQ2MgAQACNqQ0TVn9JPslh0nTHO2Q8=",
    "from": "jpeterson@leaderfactor.com",
    "to": "z.allerding@lcwmail.com",
    "reply_to": "support@leaderfactor.com",
    "in_reply_to": "N/A",
    "subject": "[Newsletter] Does My Organization Have Psychological Safety?",
    "body": "The tools you need to uncover the pockets of toxicity in your organization, put words to what's wrong, and find out whether your teams need to increase their levels of psychological safety.\n \n \nDoes Your Organization Have Psychological Safety? \n \nSometimes it's hard to tell. Over time we become numb to the pains and discomfort of punished vulnerability and forget what it feels like to live without fear at work. But it doesn't have to be that way. In this week's newsletter we'll give you the tools you need to put words to what's wrong, uncover the pockets of toxicity in your organization, and find out whether your teams need to increase their levels of psychological safety.\nWhat is Psychological Safety?\n \n \nIn this week’s episode of the Culture by Design podcast, Timothy R. Clark is joined by Melody Wilding, author of \nTrust Yourself: Stop Overthinking and Channel Your Emotions for Success at Work. \nAs an executive coach, professor of Human Behavior, licensed social worker, and Harvard Business Review contributor, Melody has lots to say about how burnout, ambition, sensitivity and empathy.\n \nListen to this episode of the \nCulture by Design Podcast,\n \"\nInvest in Your Well-Being\n\" available on all channels. \nListen Now\n \n \nIn a previous episode of the Culture by Design podcast, Dr. Timothy R. Clark invites Nicki Eyre to talk about navigating workplace bullying from both the individual and organizational level, why encouraging a speak-up culture is not enough, and how to have both performance and cultural accountability for individual contributors and leaders.\n \nListen to this episode of the \nCulture by Design Podcast,\n \"Navigating Workplace Bullying\" available on all channels. \nListen Now\n \n \nIs Your Boss Actively Toxic\nor Passively Complicit?\nAlthough we expect it to be obvious, most toxic behavior is subtle. Subtlety is safer than blatant toxicity because it gives the perpetrator deniability. If we were to give you a menu of subtle behaviors it might include: \n \n1. Ignoring a question\n2. Neglecting a visible need\n3. Holding back feedback deliberately to maintain ambiguity\n4. Withholding time and attention\n5. Excluding someone from a meeting or conversation\n6. Piling on the work under the guise of mock appreciation.\n \nKeep reading to learn how you can identify your leader's tendencies, because teams and organizations don’t outperform their bosses, they reflect them. That’s why sources of toxicity must be identified and either removed or coached.\nRead the Full Article\n \n \nHow to Spot a Toxic Culture in a Job Interview\n \nOne of the hardest questions you can ask an interviewer is: \"Can you tell me about your organization's culture?\" They may give you vague answers about pizza parties and casual Fridays, a scripted response that is less-than-believable, or may not know how to answer the question at all. The last thing you want is to accept a job without knowing anything about the culture you're walking into. In this LeaderFactor Note we give you nine questions to help you spot a toxic culture before you sign the contract:\nDownload This Note\n \nMeasure Psychological Safety with\nThe 4 Stages™ Team Survey\n  \n \nEven with all of these self-diagnosing tools we shared today, it's hard to know how your teams are actually doing. I mean, we call them hidden problems for a reason, right?\n \nOther engagement surveys that try to account for psychological safety will fail to give you a concrete plan for action and will leave you wondering what’s next. There’s no other organizational survey in the world that will give you insight into your organization’s pockets of rewarded and punished vulnerability than The 4 Stages™ Team Survey.\nLearn More\n \n \n“Diversity is a matter of makeup and composition. Inclusion is a matter of belief and behavior.”\n \n–  Timothy R. Clark\n \n \n \n \n \n \nLeaderFactor, Suite C, Alpine, UT 84004, USA \nManage preferences",
    "received_at": "2022-09-21T19:16:57+00:00",
    "sent_at": "2022-09-21T19:16:51+00:00",
    "date_extracted": "2025-04-04T21:21:52.163802"
  }
]