[
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAHtj5YYAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAACuRS2za8NAqm8g42Tsm68=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Join us at Women In Tech DC! Coupon code inside",
    "body": "You don't often get email from hello@rallybright.com. \nLearn why this is important\nLearn about what makes women leaders so effective at building high-performing teams when you join us at Women In Tech DC from May 15-16.\n \n \nWe're proud to sponsor \nWomen in Tech DC 2024\n and would love to see you there! In fact, we have a coupon code for 25% off so you can join us.\nSimply select your ticket\n, enter the code RALLYBRIGHT25 at the checkout, and join us at our session and our booth.\n \nWomen Leaders Build Better Teams: Using Data and Technology to Improve Team Performance & Intelligence\n15 May 2024 | 15:55 - 16:25 | Digital X Human Stage\n \nWomen build better teams, according to the data. What can we learn from how they do it?\n \nJoin Mike Sweeney, Chief Strategy Officer at RallyBright for insights on building inclusive, resilient and high-performing teams.\n \nSome key takeaways are:\nHighlights from research on the positive impact women leaders have on teams\nPractical approaches to using data and technology to open the door to developing team resilience\nTop tips for addressing challenges in uncertain times based on our work with technology teams\nCheck Out Our Session\n \nDon't forget to \ngrab your ticket\n with our discount code RALLYBRIGHT25 and we'll see you there!\n \nCheers,\nYour friends at RallyBright\nwww.RallyBright.com\n \n \n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nUnsubscribe\n \nManage preferences",
    "received_at": "2024-04-17T12:01:46+00:00",
    "sent_at": "2024-04-17T12:01:38+00:00",
    "date_extracted": "2025-04-04T19:35:13.912035"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAHRO561AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAOBuZOJtvzBNrQnela_Yjok=",
    "from": "mike@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "mike@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "AI Insights: Your Shortcut to Time-Saving Team Performance with RallyBright",
    "body": "You don't often get email from mike@rallybright.com. \nLearn why this is important\nHello, Friends of RallyBright!\n \nI hope you are doing well! We’re excited to share a new (beta) feature using AI that is available to anyone with access to RallyBright. That’s right - you already have it if you partner with us!\n \nWe’ve heard from many of you that the verbatim questions are great, but wouldn’t it be cool if we could use AI to provide a summary of the themes? Well, you spoke…and we listened. 🙂\n \nYou will find the new feature on the verbatim summary tab of the Resilient Team report. Check out the GIF below (that may take a couple seconds to load).\n \nFeel free to reach out if you want to find out more. \n \nMike\n \nMike Sweeney\nChief Strategy Officer\nRallyBright\nmike@rallybright.com\nwww.rallybright.com\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nUnsubscribe\n \nManage preferences",
    "received_at": "2024-03-06T13:30:33+00:00",
    "sent_at": "2024-03-06T13:30:27+00:00",
    "date_extracted": "2025-04-04T19:35:15.534369"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAHJdP7VAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQABuDy7mQw8hFtJMqi9nMY5U=",
    "from": "marketing@scoro.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "marketing@scoro.com",
    "in_reply_to": "N/A",
    "subject": "The secret to better revenue forecasting",
    "body": "You don't often get email from marketing@scoro.com. \nLearn why this is important\nAre you still relying on multiple spreadsheets for revenue forecasting? If so, you’re not alone.\nView in browser\n \n \nHow to Build a Reliable Revenue Forecast\nAre you still relying on multiple spreadsheets for revenue forecasting?\nIf so, you’re not alone. \n \nRevenue forecasting is a complex task. \nIt requires multiple layers of data. And input from different teams. \nYou run into bottlenecks when information sits with one person. Painful manual updates.\nHowever, revenue forecasting is key to understanding potential problem areas. \n \nProblem areas such as the ones highlighted in the revenue forecast below. April needs additional resources to support a big month, and June needs a sales push.\nForeseeing this allows you to take action and plan proactively.\n \nA reliable revenue forecast combines data from your won contracts, your sales pipeline and predictions based on your previous performance:\nWon contracts\n - these are your existing projects. It should be recognized in your forecast when you expect to deliver the work. Provides accurate but short-term data for your forecast.\nSales pipeline \n- this includes proposals you have sent to your prospects that you are expecting to win. This amount should be distributed across the project span. Provides less accurate mid-term data for your forecast.\nProjections based on previous performance\n - are based on results from the past and market trends. Since this requires some guesswork, it’s less reliable but it does give you a long-term view.\nEach of these data sources forecasts revenue over different time spans - shown below:\n \nWhat’s next?\nYou’ve seen what data is needed to build a solid revenue forecast. \nNow here’s the good news. \nScoro brings together your ongoing projects and sales pipeline into one report.\nAutomatically generating your revenue forecast for you.\nYour own company-wide, real-time report, allowing you to plan ahead.\n \nHere it is:\n \nFor a detailed guide on how Scoro’s revenue report works see \nhere\n.\nIn Case You Missed It\nSee how easy it is to generate your revenue forecast with the demonstration below:\nAutomating Revenue Forecasting with Scoro\nUnderstand the importance of forecasting, its challenges and a useful framework to follow in this webinar:\nRevenue Forecasting for a Profitable Year Ahead\nTim Downs, director at Aberfield Communications, shares how he motivated his team when putting processes and policies in place in this webinar:\nAct Like a Small Agency, Think Like a Big One\n📍 Upcomin\ng\n Webinar\n \nIn a competitive world, how do you stand out? Nuevo's CEO, Jax Davey, crafted his \npurpose, got\n his team behind him and is winning clients. Learn how in this inspirational webinar. \n \nJoin us live on \nWednesday, 27 March\n, 2:00 PM GMT. Register \nhere\n. \n \nP.S. Was this content helpful?\nWe’d love to hear your thoughts.\nVery helpful\n \nIt's OK\n \nNot helpful\n \nIf you need assistance or have any questions, please contact our \nCustomer Support\n.\nYou are receiving this email because you have a Scoro account. For more information about how we process data, please see our \nPrivacy Policy\n.\nScoro Software, 81 Rivington Street, London, England EC2A 3AY, United Kingdom \nUnsubscribe\n \nManage preferences",
    "received_at": "2024-02-22T16:34:36+00:00",
    "sent_at": "2024-02-22T16:34:27+00:00",
    "date_extracted": "2025-04-04T19:35:15.181934"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAHJdP7UAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAJsU1ICisXlFgE8-NP6GaWU=",
    "from": "Louise.MacDonald@edrington.com",
    "to": "d.gough@lcwmail.com, m.neu@lcwmail.com, m.johnson@lcwmail.com",
    "reply_to": "Louise.MacDonald@edrington.com",
    "in_reply_to": "N/A",
    "subject": "RE: Edrington - DE&I Micro Learnings",
    "body": "You don't often get email from louise.macdonald@edrington.com. \nLearn why this is important\nHi Dan, \n \nWould you be able to confirm this for me please? Copying in \n@Melissa Neu\n and \n@Melonya Johnson\n in case you are out of the office. \n \nBest wishes, Louise\n \nFrom:\n MacDonald, Louise \nSent:\n Monday, February 5, 2024 11:51 AM\nTo:\n Daniel Gough <d.gough@lcwmail.com>\nSubject:\n Edrington - DE&I Micro Learnings \n \nHi Dan, \n \nConscious it has been a little while since we connected. We are still hoping to move forward with Micro-Learnings. Can I just check, for perpetual site licenses on the courses, in all 4 languages (English, Latin American Spanish, Traditional Chinese, and Simplified Chinese) would we still be $28,500/course? \n \nThanks Louise\n \nManaging Bias in Performance Reviews\n \nhttps://app.cloud.scorm.com/sc/InvitationConfirmEmail?publicInvitationId=3c9eeb1e-3d2b-4494-8163-b9ff1283b75c\n \nIn this short (10-15 minute) course\n,\n you’ll learn how to become more aware of personal biases so that we can attend to them and interrupt them while evaluating our team members’ performance and conducting performance reviews.  \nManaging Bias in Talent Reviews\n \nhttps://app.cloud.scorm.com/sc/InvitationConfirmEmail?publicInvitationId=bf8f5de8-98ae-478b-9a71-6269d1e8e9d2\n \nIn this short (10-15 minute) course\n,\n you’ll learn ways to reduce your bias in the talent review process so that you can promote diversity, inclusion, and objectivity, and mitigate unconscious bias that may be hampering your best intentions when it comes to reviewing talent.  \nManaging Bias in Hiring\n \nhttps://app.cloud.scorm.com/sc/InvitationConfirmEmail?publicInvitationId=09ace2b6-9d23-4039-981f-06c46182d5c6\n \nThis short (10-15 minute)\n \ncourse allows us to become aware of our biases so that we can attend to them and interrupt them while evaluating and selecting diverse top talent. \nManaging Bias in Interviewing\n \nhttps://app.cloud.scorm.com/sc/InvitationConfirmEmail?publicInvitationId=fe85349c-cb6a-4bf7-85dc-d99f3e912840\n \nIn this short (10-15 minute) course\n,\n you’ll learn ways to mitigate unconscious biases during job interviews, so that you can promote diversity, inclusion, and objectivity and mitigate biases that may be undermining your best intentions when it comes to interviewing job candidates.  \nManaging Bias in Recruiting\n \nhttps://app.cloud.scorm.com/sc/InvitationConfirmEmail?publicInvitationId=f1332bc6-0368-472e-a986-7fd93616f071\n \nIn this short (10-15 minute) course, you’ll learn ways to mitigate unconscious biases during the talent sourcing and recruitment process, so that you can find and recognize diverse top talent more effectively.  \n \nDisclaimer\nThis e-mail has been scanned for all viruses by Mimecast. Edrington is a private limited company registered in Scotland (Registered Number SC 36374) with its Registered Office at 100 Queen Street, Glasgow, G1 3DN. Please enjoy our brands responsibly.",
    "received_at": "2024-02-22T11:57:07+00:00",
    "sent_at": "2024-02-22T11:55:43+00:00",
    "date_extracted": "2025-04-04T19:35:15.058808"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAHH4TDWAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAOHnbCFBXrRKjsaXE8oSLjI=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Jumpstart your teams to higher performance with these exclusive RallyBright's offerings",
    "body": "You don't often get email from hello@rallybright.com. \nLearn why this is important\nThis month we're sharing news on our new RallyBright Academy workshop, as well as tactical tips on strengthening team performance.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we're unveiling a brand new interactive workshop for our RallyBright Academy lineup, designed to help leaders jumpstart their teams to higher performance. We also have a new RallyBright blog post on the importance of leveraging employee feedback to drive success, and tactical tips on the power of shared purpose for strengthening team performance.\n \n–Your friends at RallyBright\nNEW RALLYBRIGHT ACADEMY WORKSHOP - TEAM \"SPARK\" SESSION\n \nSpark Team Performance For Your Most Critical Teams\nOur \nRallyBright Academy\n offerings provide leaders and teams with customized learning and development opportunities to drive better performance and foster inclusion. We've recently added a brand new Team \"Spark\" Session!\n \nUse this workshop to learn about the five key drivers of team resilience and outperformance, including the attitudes and behaviors that drive success. Our seminar establishes a common framework for team outperformance and dynamics. The interactive workshops offer hands-on experience for defining team-wide objectives and accountability, and tracking progress over time.\n• Build connection and psychological safety\n• Create team purpose and direction\n• Develop mechanisms for accountability\n• Co-create team norms and rules of the road\n• Identify key results & critical stakeholders\nIf you'd like to spark greater performance for your teams with our latest RallyBright Academy workshop, be sure to reach out to us at \ncs@rallybright.com\n.\nLEARNING\n \nFind Out the Truth: Employee Feedback\nEmployee feedback is an incredibly powerful tool in today’s workplace, where innovation, collaboration and team sentiment are key drivers of success. Understanding the pulse of your organization is crucial to achieving optimal business outcomes. Instead of taking a random or unproven approach to feedback, leaders can use an employee feedback platform to drive change. \nRead more \nhere\n from the RallyBright blog about how leveraging the power of feedback can transform entire organizations.\n \n5 Actionable Tips on How to Create a Strong Shared Purpose For Your Teams\nStrengthening your team's sense of shared purpose strengthens their performance. Empowering your teams to not only meet their goals, but exceed them, is possible with the power and magic of shared purpose. Defining your team's mission and aligning your teams with your company's purpose are the keys to getting started.\n \nCheck out \nthese solution\ns from our RallyBright LinkedIn page on how to create a strong shared purpose for your teams at work.\n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2024-02-21T14:47:38+00:00",
    "sent_at": "2024-02-21T14:47:32+00:00",
    "date_extracted": "2025-04-04T19:35:14.290477"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAGxGf-AAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQANgsAN2sfDRJtEORH1inxHQ=",
    "from": "marketing@scoro.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "marketing@scoro.com",
    "in_reply_to": "N/A",
    "subject": "Webinar: Revenue Forecasting for a Profitable Year Ahead",
    "body": "You don't often get email from marketing@scoro.com. \nLearn why this is important\nJoin our webinar and uncover practical tips on reliable Revenue Forecasting.\n \n \nHey Melonya,\n \nCreating a \nreliable revenue forecast \ncan be tough. Uncertainties in the sales pipeline, project scopes, timelines, and market conditions make it challenging. \n \nThe result? You have either given up on forecasting revenue, or it takes a lot of manual effort. \n \nYou can never be sure if you have enough work and revenue lined up for the coming months. \n \nTo help you navigate this complexity, we are hosting a \nwebinar\n on \nrevenue forecasting best practices\n. \n \nOur hosts, Helen and Sander, will give you practical advice on:\nCreating a robust forecasting framework\nAvoiding common forecasting pitfalls\nMaintaining a realistic forecast throughout the year\nThe live Zoom webinar is on \nJanuary 31st at 3:00 PM GMT / 10:00 AM EST\n.\n \nP.S. Can’t join us live?\n Register anyway, and we’ll send you a recording after the event.\nWe look forward to seeing you at the webinar! \n \nBest wishes,\nTeam Scoro\nRegister now!\n \n \n \n \n \nScoro Software, 81 Rivington Street, London, England EC2A 3AY, United Kingdom \nUnsubscribe\n \nManage preferences\n \nWe are notifying you that we are processing your data based on legitimate interest (EU regulation 2016/679 (GDPR) Art 6 (1) (f)) as we have acquired your business contacts as you were a trialist user of Scoro or have requested a Scoro demo. You have under GDPR the right to opt-out and object against us processing your data under that ground. For more information about how we process data, please see our \nPrivacy Policy\n.",
    "received_at": "2024-01-18T11:02:48+00:00",
    "sent_at": "2024-01-18T11:02:42+00:00",
    "date_extracted": "2025-04-04T19:35:14.749690"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAGxGf_-AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAEAt4sVTQztJkV9Rlxnn1pQ=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Discover RallyBright's targeted solutions for your team's most common vulnerabilities",
    "body": "You don't often get email from hello@rallybright.com. \nLearn why this is important\nThis month we're kicking off the new year with curated solutions for the most common team problems and vulnerabilities.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we're kicking off the new year with our recently-launched RallyBright Team Accelerator Program, designed for fast-tracking and maximizing team performance. We also have expert resources to share on why hybrid work is the clear winner of the post-pandemic workplace, as well as curated solutions to the most common team problems and vulnerabilities. \n \n–Your friends at RallyBright\nRALLYBRIGHT TEAM ACCELERATOR PROGRAM\n \nFast-Track Your Teams to Success with the \nRallyBright Team Accelerator Program\nOur newly-launched RallyBright Team Accelerator Program gives you the science, software, and skills to quickly build high-performing teams. We offer expert guidance focused on expanding and accelerating your impact, ensuring your best teams will become the norm, not the exception.\n \nCheck out our proven team accelerant \nhere\n designed to fast-track and maximize team performance, all according to your group’s unique needs and challenges.\nLEARNING\n \nHybrid Work is the Clear Winner in the Workplace\nIt looks like the full Return to Office norm isn't the only work model dying out--so is Fully Remote. Today, only 1% of executives say their employees are fully remote, way down from 34% in 2022. Hybrid work is the clear winner, as 80% of business leaders are seeing gains with this strategy. This is consistent with RallyBright's findings: a hybrid approach has most often proven successful for businesses as we leave the pandemic behind us.\n \nLearn more from CNBC \nhere\n on our world's new normal with hybrid work replacing full in-office and fully remote setups.\n \nConsolidated FAQ for Leaders Working with Teams\nAre you looking for deeper insights on how to solve common problems with your teams? Check out this 12 Days of Teaming Summary: a consolidated list of distilled insights on FAQs leaders ask about working with teams. Discover solutions for successfully setting goals for your team, communicating more effectively with your team, and handling conflict between team members.\n \nFind the FAQ \nhere\n from RallyBright's Chief Strategy Officer, Mike Sweeney.\n \n4 Common Team Problems, and How to Prevent Them\nCommon team problems such as unclear priorities, lack of a common purpose, or avoiding productive conflict, can hinder team performance and diminish results. This is especially true for teams that are large or contain vastly different personality types. However, if you proactively work to prevent team problems and tackle them quickly when they arise, you’ll build stronger, more resilient, and higher-performing teams.\n \nDive into our latest RallyBright resource \nhere\n on the four problems that most commonly arise on teams, and targeted solutions to proactively prevent them.\n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2024-01-17T14:49:32+00:00",
    "sent_at": "2024-01-17T14:49:23+00:00",
    "date_extracted": "2025-04-04T19:35:15.890159"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAGcpUW2AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQANTGnUHxnx1BvJYAO_kcXT4=",
    "from": "account-services@legal.bill.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "no-reply@legal.bill.com",
    "in_reply_to": "N/A",
    "subject": "We’re Updating Our Privacy Notice and Terms of Service",
    "body": "You don't often get email from account-services@legal.bill.com. \nLearn why this is important\n  ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌   ‌ \nSkip to main content\n \n \nBILL Terms of Service and Privacy Notice Email \nGreetings from BILL, \nWe’re writing to let you know that we’re updating our Privacy Notice and Terms of Service, effective January 22, 2024. We are making these updates to reflect and support our evolving business and to provide additional helpful information about our services and your privacy rights. \nPlease take a moment to review the updated \nPrivacy Notice \nand \nTerms of Service\n. For your convenience, a summary of the highlights may be found \nhere\n.\nNo further action is required from you. By continuing to use our services after January 22, 2024, you agree to the updated Privacy Notice and Terms of Service. \nAs always, we thank you for using BILL!\nThe BILL Team \nYou're receiving this transactional notification because you have (currently or in the past) accessed BILL services.",
    "received_at": "2023-12-17T02:38:35+00:00",
    "sent_at": "2023-12-17T02:38:28+00:00",
    "date_extracted": "2025-04-04T19:35:17.222928"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAGaiI0iAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAAwUY_8QIqZLjH5AV4hAlNA=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "RallyBright's proven tools can help you drive immediate impact for your team's performance.",
    "body": "You don't often get email from hello@rallybright.com. \nLearn why this is important\nThis month we're finishing off the year strong with helpful resources designed to assist you in building exceptional teams.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we're sharing the full recording from our previous webinar on key features from the RallyBright platform - be sure to check out the discussion! We also have a new RallyBright blog post on why 2024 is poised to be the year of the team, as well as additional helpful resources for building exceptional teams at your organization.\n \nThat's a wrap on this year. From the team at RallyBright, we wish everyone a warm Season's Greetings. Until next year!\n \n–Your friends at RallyBright\n \nBuild Better Teams with the RallyBright Platform - Webinar Archive\nDid you miss the Feature Highlights webinar? You can now watch the recording to learn about key RallyBright platform features, RallyBright Academy and RallyBright Swift!\n \nOur incredible Customer Success Team shared some amazing insights on RallyBright's most powerful features for accelerating team success. During the discussion, they shared the key features from the RallyBright platform that provide game-changing insights for countless leaders around the globe.\n \nLearn more about the highlighted features in the Help Center:\nTimeshift Feature\nCompany Summary Features\nProfile Comparison Feature\nRallyBright Swift: \nStart Free Trial\n \nIf you have any questions, please contact the Customer Success Team: \ncustomer.success@rallybright.com\n \nIf you haven't already, be sure to catch the webinar in the video below!\n \nRALLYBRIGHT SWIFT\n \nA Free Lightweight Tool for Improving Team Performance\nRallyBright Swift\n is designed to help anyone jump in and get quick, actionable results straight from us.\n \nMeasure your team’s resilience with pinpoint accuracy and take the right actions. Get a personalized playbook to tackle your team’s challenges, with access to guided resources tailored for your team's unique growth opportunities. After your free 14 days, you can pick up where you left off with the full RallyBright experience!\n \nCheck out our page on RallyBright Swift \nhere\n to learn how we can help you drive immediate impact for your team's performance.\nLEARNING\n \nWhy Teams Matter More Than Ever\nIn the face of unprecedented uncertainty, teams have emerged as guiding forces for success. The upcoming year is poised to be the year of the team, emphasizing the vital role teamwork plays in achieving greater success. It's essential to recognize the power of teams, ensuring they not only survive, but also thrive through disruptions by fostering strong connections and providing clear direction for everyone on the team.\n \nRead \nhere\n on the RallyBright blog about why 2024 is the year of the team, and how embracing teamwork as a strategic priority can propel everyone forward.\n \n4 Ways to Develop a Growth-Mindset Team\nAs leaders, we know that people are our biggest assets. When we build teams that are constantly moving forward with innovative thinking and agility, our employees become even more invaluable. This is the sweet spot—the place where employees are engaged and the company sees the highest success. Success starts at the basics: building a growth-mindset team.\n \nLearn more \nhere\n from our RallyBright infographic on how you can develop a growth-mindset team for your organization.\n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-12-13T14:45:28+00:00",
    "sent_at": "2023-12-13T14:45:17+00:00",
    "date_extracted": "2025-04-04T19:35:16.708303"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAGPswIWAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQABVMVMaw58tIt-cPqxThQZQ=",
    "from": "marketing@scoro.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "marketing@scoro.com",
    "in_reply_to": "N/A",
    "subject": "Share your thoughts and we'll donate 50 euros to charity!",
    "body": "You don't often get email from marketing@scoro.com. \nLearn why this is important\nView in browser\n \n \nHi, Melonya 👋\n \nWe're working on bringing you insightful tips to keep you on top of your game. We aim to collaborate with the industry's best minds but need your help to find them!\n \nBy \nfilling out our short survey,\n we'll get to know who you follow, which forums and communities you value, and who you think gives the best advice in your industry.\n \nYour responses will help shape our direction and content, ensuring we deliver you the most relevant and impactful information.\n \nComplete our survey, and we'll \ndonate 50 euros to your chosen charity\n. Your thoughts and opinions are more than just valuable to us—they're now actively helping support a greater cause.\n \nThank you for your insights - it means a lot!\nFill out the survey\n \n \nScoro is the work management solution for managing \nsuccessful projects from quote to cash\n. We’re built for service businesses who are tired of disjointed systems, unpredictable workloads, and shrinking margins. \nScoro Software, 81 Rivington Street, London, England EC2A 3AY, United Kingdom \nUnsubscribe\n \nManage preferences",
    "received_at": "2023-11-28T11:01:41+00:00",
    "sent_at": "2023-11-28T11:01:35+00:00",
    "date_extracted": "2025-04-04T19:35:16.640117"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAF2QGXhAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAD8GHZ6C503JkzM5Pwk6PZQ=",
    "from": "SwatiShelly.Srivastava@genpact.com",
    "to": "s.nodarse@lcwmail.com, m.johnson@lcwmail.com",
    "reply_to": "SwatiShelly.Srivastava@genpact.com",
    "in_reply_to": "N/A",
    "subject": "RE: Request for the Trainings  Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)",
    "body": "Hi Sarah, \n \nI am in India and that time is past midnight – please see if the new proposed time works better.\n \nWarm Regards,\nShelly \n \nFrom:\n Sarah Nodarse <s.nodarse@lcwmail.com> \nSent:\n Monday, October 23, 2023 8:41 PM\nTo:\n Srivastava, Swati Shelly <SwatiShelly.Srivastava@genpact.com>; Melonya Johnson <m.johnson@lcwmail.com>\nCc:\n Singh, Vivek SV <vivek.singh2@genpact.com>; Sharma, Swati <Swati.Sharma5@genpact.com>; BrintonWood, Derryn <Derryn.BrintonWood@genpact.com>\nSubject:\n RE: Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \n> \nWARNING\n - This email originated outside of Genpact.\nDo \nnot\n reply\n, \nclick on links\n or \nopen attachments\n unless you recognize the sender and know the content is safe. If you believe the content of this email may be unsafe, please forward it as an attachment to \nthislooksphishy@genpact.com\n or use the 'This Looks Phishy' Outlook button.\nDone! I look forward to our conversation!\n \nFrom:\n Srivastava, Swati Shelly <\nSwatiShelly.Srivastava@genpact.com\n> \nSent:\n Monday, October 23, 2023 10:04 AM\nTo:\n Sarah Nodarse <\ns.nodarse@lcwmail.com\n>; Melonya Johnson <\nm.johnson@lcwmail.com\n>\nCc:\n Singh, Vivek SV <\nvivek.singh2@genpact.com\n>; Sharma, Swati <\nSwati.Sharma5@genpact.com\n>; BrintonWood, Derryn <\nDerryn.BrintonWood@genpact.com\n>\nSubject:\n RE: Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \nHi Sarah, \n \nThank you for your prompt response and update. Yes, please share a Teams Invite for today, it will be lovely connecting.\n \nTruly appreciate it! \n \nCheers and Warm Regards,\nShelly \n \nFrom:\n Sarah Nodarse <\ns.nodarse@lcwmail.com\n> \nSent:\n Monday, October 23, 2023 8:21 PM\nTo:\n Srivastava, Swati Shelly <\nSwatiShelly.Srivastava@genpact.com\n>; Melonya Johnson <\nm.johnson@lcwmail.com\n>\nCc:\n Singh, Vivek SV <\nvivek.singh2@genpact.com\n>; Sharma, Swati <\nSwati.Sharma5@genpact.com\n>; BrintonWood, Derryn <\nDerryn.BrintonWood@genpact.com\n>\nSubject:\n RE: Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \n> \nWARNING\n - This email originated outside of Genpact.\nDo \nnot\n reply\n, \nclick on links\n or \nopen attachments\n unless you recognize the sender and know the content is safe. If you believe the content of this email may be unsafe, please forward it as an attachment to \nthislooksphishy@genpact.com\n or use the 'This Looks Phishy' Outlook button.\nHello Shelly,\n \nMelonya is no longer with LCW, but I would be happy to meet with you to discuss your needs! I am available after 3 pm Central today, or tomorrow morning after 11 am Central time (I am located in Chicago, IL). May I send you a MS Teams invitation so that we can met “face to face”? \n \nLooking forward to speaking with you soon,\n \nSarah\n \n \nSarah Nodarse\n(she/her)\nPrincipal Consultant\nLCW\n773.474.9138\ns.nodarse@lcwmail.com\n \nWebsite | Twitter | Facebook | LinkedIn\nView our upcoming events | Sign-up for our newsletter\n \nI live and work in Chicago, IL – on the unceded territory of the Pokagon band of Potawatomi. See \nthis article\n in the Chicago History Museum Magazine for a native perspective on land acknowledgements and the City of Chicago. \n \n \n \n \nFrom:\n Srivastava, Swati Shelly <\nSwatiShelly.Srivastava@genpact.com\n> \nSent:\n Monday, October 23, 2023 7:49 AM\nTo:\n Melonya Johnson <\nm.johnson@lcwmail.com\n>\nCc:\n Singh, Vivek SV <\nvivek.singh2@genpact.com\n>; Sharma, Swati <\nSwati.Sharma5@genpact.com\n>; BrintonWood, Derryn <\nDerryn.BrintonWood@genpact.com\n>\nSubject:\n Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \nHi Melonya, \n \nHope you are doing well. \n \nI am reaching out to you with the understanding from Vivek (Genpact Sourcing team) you are an esteemed empanelled vendor partner provisioning training of behavioural skills, professional skills and growth skills for Leader, Mid-Managers and Manager personas. The target audience is Global hence the training span is across locations open to exploring the modes of facilitation too. Please do enable courses /certifications that do not have a very long duration but new can close in days and weeks and are relevant too. \n \nThis is timebound need hence reaching out to you to please share a catalogue of the trainings available thru you including technical and on digitization if that is also what your landscape encompasses. \n \nI will be happy to get on a call with you today or wed as I need to have clarity by Wednesday and not later. I am available @ 9811901027 and please feel free to call me or email me @\nSrivastava, Swati Shelly \nSwatiShelly.Srivastava@genpact.com\n \nWarm Regards,\nShelly \n \nSwati Shelly Srivastava\nProgram Manager | Program Management - Transition\n+91 9811901027\n | \nswatishelly.srivastava@genpact.com",
    "received_at": "2023-10-23T15:16:10+00:00",
    "sent_at": "2023-10-23T15:15:34+00:00",
    "date_extracted": "2025-04-04T19:37:59.521923"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAF2QGXgAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAD8GHZ6C503JkzM5Pwk6PZQ=",
    "from": "s.nodarse@lcwmail.com",
    "to": "swatishelly.srivastava@genpact.com, m.johnson@lcwmail.com",
    "reply_to": "s.nodarse@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "RE: Request for the Trainings  Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)",
    "body": "Done! I look forward to our conversation!\n \nFrom:\n Srivastava, Swati Shelly <SwatiShelly.Srivastava@genpact.com> \nSent:\n Monday, October 23, 2023 10:04 AM\nTo:\n Sarah Nodarse <s.nodarse@lcwmail.com>; Melonya Johnson <m.johnson@lcwmail.com>\nCc:\n Singh, Vivek SV <vivek.singh2@genpact.com>; Sharma, Swati <Swati.Sharma5@genpact.com>; BrintonWood, Derryn <Derryn.BrintonWood@genpact.com>\nSubject:\n RE: Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \nHi Sarah, \n \nThank you for your prompt response and update. Yes, please share a Teams Invite for today, it will be lovely connecting.\n \nTruly appreciate it! \n \nCheers and Warm Regards,\nShelly \n \nFrom:\n Sarah Nodarse <\ns.nodarse@lcwmail.com\n> \nSent:\n Monday, October 23, 2023 8:21 PM\nTo:\n Srivastava, Swati Shelly <\nSwatiShelly.Srivastava@genpact.com\n>; Melonya Johnson <\nm.johnson@lcwmail.com\n>\nCc:\n Singh, Vivek SV <\nvivek.singh2@genpact.com\n>; Sharma, Swati <\nSwati.Sharma5@genpact.com\n>; BrintonWood, Derryn <\nDerryn.BrintonWood@genpact.com\n>\nSubject:\n RE: Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \n> \nWARNING\n - This email originated outside of Genpact.\nDo \nnot\n reply\n, \nclick on links\n or \nopen attachments\n unless you recognize the sender and know the content is safe. If you believe the content of this email may be unsafe, please forward it as an attachment to \nthislooksphishy@genpact.com\n or use the 'This Looks Phishy' Outlook button.\nHello Shelly,\n \nMelonya is no longer with LCW, but I would be happy to meet with you to discuss your needs! I am available after 3 pm Central today, or tomorrow morning after 11 am Central time (I am located in Chicago, IL). May I send you a MS Teams invitation so that we can met “face to face”? \n \nLooking forward to speaking with you soon,\n \nSarah\n \n \nSarah Nodarse\n(she/her)\nPrincipal Consultant\nLCW\n773.474.9138\ns.nodarse@lcwmail.com\n \nWebsite | Twitter | Facebook | LinkedIn\nView our upcoming events | Sign-up for our newsletter\n \nI live and work in Chicago, IL – on the unceded territory of the Pokagon band of Potawatomi. See \nthis article\n in the Chicago History Museum Magazine for a native perspective on land acknowledgements and the City of Chicago. \n \n \n \n \nFrom:\n Srivastava, Swati Shelly <\nSwatiShelly.Srivastava@genpact.com\n> \nSent:\n Monday, October 23, 2023 7:49 AM\nTo:\n Melonya Johnson <\nm.johnson@lcwmail.com\n>\nCc:\n Singh, Vivek SV <\nvivek.singh2@genpact.com\n>; Sharma, Swati <\nSwati.Sharma5@genpact.com\n>; BrintonWood, Derryn <\nDerryn.BrintonWood@genpact.com\n>\nSubject:\n Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \nHi Melonya, \n \nHope you are doing well. \n \nI am reaching out to you with the understanding from Vivek (Genpact Sourcing team) you are an esteemed empanelled vendor partner provisioning training of behavioural skills, professional skills and growth skills for Leader, Mid-Managers and Manager personas. The target audience is Global hence the training span is across locations open to exploring the modes of facilitation too. Please do enable courses /certifications that do not have a very long duration but new can close in days and weeks and are relevant too. \n \nThis is timebound need hence reaching out to you to please share a catalogue of the trainings available thru you including technical and on digitization if that is also what your landscape encompasses. \n \nI will be happy to get on a call with you today or wed as I need to have clarity by Wednesday and not later. I am available @ 9811901027 and please feel free to call me or email me @\nSrivastava, Swati Shelly \nSwatiShelly.Srivastava@genpact.com\n \nWarm Regards,\nShelly \n \nSwati Shelly Srivastava\nProgram Manager | Program Management - Transition\n+91 9811901027\n | \nswatishelly.srivastava@genpact.com",
    "received_at": "2023-10-23T15:10:39+00:00",
    "sent_at": "2023-10-23T15:10:37+00:00",
    "date_extracted": "2025-04-04T19:37:59.760923"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAF2QGXfAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAD8GHZ6C503JkzM5Pwk6PZQ=",
    "from": "SwatiShelly.Srivastava@genpact.com",
    "to": "s.nodarse@lcwmail.com, m.johnson@lcwmail.com",
    "reply_to": "SwatiShelly.Srivastava@genpact.com",
    "in_reply_to": "N/A",
    "subject": "RE: Request for the Trainings  Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)",
    "body": "Hi Sarah, \n \nThank you for your prompt response and update. Yes, please share a Teams Invite for today, it will be lovely connecting.\n \nTruly appreciate it! \n \nCheers and Warm Regards,\nShelly \n \nFrom:\n Sarah Nodarse <s.nodarse@lcwmail.com> \nSent:\n Monday, October 23, 2023 8:21 PM\nTo:\n Srivastava, Swati Shelly <SwatiShelly.Srivastava@genpact.com>; Melonya Johnson <m.johnson@lcwmail.com>\nCc:\n Singh, Vivek SV <vivek.singh2@genpact.com>; Sharma, Swati <Swati.Sharma5@genpact.com>; BrintonWood, Derryn <Derryn.BrintonWood@genpact.com>\nSubject:\n RE: Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \n> \nWARNING\n - This email originated outside of Genpact.\nDo \nnot\n reply\n, \nclick on links\n or \nopen attachments\n unless you recognize the sender and know the content is safe. If you believe the content of this email may be unsafe, please forward it as an attachment to \nthislooksphishy@genpact.com\n or use the 'This Looks Phishy' Outlook button.\nHello Shelly,\n \nMelonya is no longer with LCW, but I would be happy to meet with you to discuss your needs! I am available after 3 pm Central today, or tomorrow morning after 11 am Central time (I am located in Chicago, IL). May I send you a MS Teams invitation so that we can met “face to face”? \n \nLooking forward to speaking with you soon,\n \nSarah\n \n \nSarah Nodarse\n(she/her)\nPrincipal Consultant\nLCW\n773.474.9138\ns.nodarse@lcwmail.com\n \nWebsite | Twitter | Facebook | LinkedIn\nView our upcoming events | Sign-up for our newsletter\n \nI live and work in Chicago, IL – on the unceded territory of the Pokagon band of Potawatomi. See \nthis article\n in the Chicago History Museum Magazine for a native perspective on land acknowledgements and the City of Chicago. \n \n \n \n \nFrom:\n Srivastava, Swati Shelly <\nSwatiShelly.Srivastava@genpact.com\n> \nSent:\n Monday, October 23, 2023 7:49 AM\nTo:\n Melonya Johnson <\nm.johnson@lcwmail.com\n>\nCc:\n Singh, Vivek SV <\nvivek.singh2@genpact.com\n>; Sharma, Swati <\nSwati.Sharma5@genpact.com\n>; BrintonWood, Derryn <\nDerryn.BrintonWood@genpact.com\n>\nSubject:\n Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \nHi Melonya, \n \nHope you are doing well. \n \nI am reaching out to you with the understanding from Vivek (Genpact Sourcing team) you are an esteemed empanelled vendor partner provisioning training of behavioural skills, professional skills and growth skills for Leader, Mid-Managers and Manager personas. The target audience is Global hence the training span is across locations open to exploring the modes of facilitation too. Please do enable courses /certifications that do not have a very long duration but new can close in days and weeks and are relevant too. \n \nThis is timebound need hence reaching out to you to please share a catalogue of the trainings available thru you including technical and on digitization if that is also what your landscape encompasses. \n \nI will be happy to get on a call with you today or wed as I need to have clarity by Wednesday and not later. I am available @ 9811901027 and please feel free to call me or email me @\nSrivastava, Swati Shelly \nSwatiShelly.Srivastava@genpact.com\n \nWarm Regards,\nShelly \n \nSwati Shelly Srivastava\nProgram Manager | Program Management - Transition\n+91 9811901027\n | \nswatishelly.srivastava@genpact.com",
    "received_at": "2023-10-23T15:05:29+00:00",
    "sent_at": "2023-10-23T15:03:40+00:00",
    "date_extracted": "2025-04-04T19:38:00.303585"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAF2QGXeAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAD8GHZ6C503JkzM5Pwk6PZQ=",
    "from": "s.nodarse@lcwmail.com",
    "to": "swatishelly.srivastava@genpact.com, m.johnson@lcwmail.com",
    "reply_to": "s.nodarse@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "RE: Request for the Trainings  Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)",
    "body": "Hello Shelly,\n \nMelonya is no longer with LCW, but I would be happy to meet with you to discuss your needs! I am available after 3 pm Central today, or tomorrow morning after 11 am Central time (I am located in Chicago, IL). May I send you a MS Teams invitation so that we can met “face to face”? \n \nLooking forward to speaking with you soon,\n \nSarah\n \n \nSarah Nodarse\n(she/her)\nPrincipal Consultant\nLCW\n773.474.9138\ns.nodarse@lcwmail.com\n \nWebsite | Twitter | Facebook | LinkedIn\nView our upcoming events | Sign-up for our newsletter\n \nI live and work in Chicago, IL – on the unceded territory of the Pokagon band of Potawatomi. See \nthis article\n in the Chicago History Museum Magazine for a native perspective on land acknowledgements and the City of Chicago. \n \n \n \n \nFrom:\n Srivastava, Swati Shelly <SwatiShelly.Srivastava@genpact.com> \nSent:\n Monday, October 23, 2023 7:49 AM\nTo:\n Melonya Johnson <m.johnson@lcwmail.com>\nCc:\n Singh, Vivek SV <vivek.singh2@genpact.com>; Sharma, Swati <Swati.Sharma5@genpact.com>; BrintonWood, Derryn <Derryn.BrintonWood@genpact.com>\nSubject:\n Request for the Trainings Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\n \nHi Melonya, \n \nHope you are doing well. \n \nI am reaching out to you with the understanding from Vivek (Genpact Sourcing team) you are an esteemed empanelled vendor partner provisioning training of behavioural skills, professional skills and growth skills for Leader, Mid-Managers and Manager personas. The target audience is Global hence the training span is across locations open to exploring the modes of facilitation too. Please do enable courses /certifications that do not have a very long duration but new can close in days and weeks and are relevant too. \n \nThis is timebound need hence reaching out to you to please share a catalogue of the trainings available thru you including technical and on digitization if that is also what your landscape encompasses. \n \nI will be happy to get on a call with you today or wed as I need to have clarity by Wednesday and not later. I am available @ 9811901027 and please feel free to call me or email me @\nSrivastava, Swati Shelly \nSwatiShelly.Srivastava@genpact.com\n \nWarm Regards,\nShelly \n \nSwati Shelly Srivastava\nProgram Manager | Program Management - Transition\n+91 9811901027\n | \nswatishelly.srivastava@genpact.com",
    "received_at": "2023-10-23T14:50:34+00:00",
    "sent_at": "2023-10-23T14:50:30+00:00",
    "date_extracted": "2025-04-04T19:38:00.087578"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAF2QGXdAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAD8GHZ6C503JkzM5Pwk6PZQ=",
    "from": "SwatiShelly.Srivastava@genpact.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "SwatiShelly.Srivastava@genpact.com",
    "in_reply_to": "N/A",
    "subject": "Request for the Trainings  Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)",
    "body": "Hi Melonya, \n \nHope you are doing well. \n \nI am reaching out to you with the understanding from Vivek (Genpact Sourcing team) you are an esteemed empanelled vendor partner provisioning training of behavioural skills, professional skills and growth skills for Leader, Mid-Managers and Manager personas. The target audience is Global hence the training span is across locations open to exploring the modes of facilitation too. Please do enable courses /certifications that do not have a very long duration but new can close in days and weeks and are relevant too. \n \nThis is timebound need hence reaching out to you to please share a catalogue of the trainings available thru you including technical and on digitization if that is also what your landscape encompasses. \n \nI will be happy to get on a call with you today or wed as I need to have clarity by Wednesday and not later. I am available @ 9811901027 and please feel free to call me or email me @\nSrivastava, Swati Shelly \nSwatiShelly.Srivastava@genpact.com\n \nWarm Regards,\nShelly \n \nSwati Shelly Srivastava\nProgram Manager | Program Management - Transition\n+91 9811901027\n | \nswatishelly.srivastava@genpact.com",
    "received_at": "2023-10-23T12:49:00+00:00",
    "sent_at": "2023-10-23T12:48:40+00:00",
    "date_extracted": "2025-04-04T19:38:00.127970"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAF2QGXcAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAA9vBJ72bvZEpq2MrjwIZQo=",
    "from": "SwatiShelly.Srivastava@genpact.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "SwatiShelly.Srivastava@genpact.com",
    "in_reply_to": "N/A",
    "subject": "Recall: Request for the Trainings  Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)",
    "body": "Srivastava, Swati Shelly would like to recall the message, \"Request for the Trainings  Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)\".",
    "received_at": "2023-10-23T12:48:41+00:00",
    "sent_at": "2023-10-23T12:48:22+00:00",
    "date_extracted": "2025-04-04T19:37:58.832090"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAF2QGXbAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAD8GHZ6C503JkzM5Pwk6PZQ=",
    "from": "SwatiShelly.Srivastava@genpact.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "SwatiShelly.Srivastava@genpact.com",
    "in_reply_to": "N/A",
    "subject": "Request for the Trainings  Catalogue - High on Importance and Closure (Time-Bound to Wed Oct 25,2023)",
    "body": "Hi Johnson, \n \nHope you are doing well. \n \nI am reaching out to you with the understanding from Vivek (Genpact Sourcing team) you are an esteemed empanelled vendor partner provisioning training of behavioural skills, professional skills and growth skills for Leader, Mid-Managers and Manager personas. The target audience is Global hence the training span is across locations open to exploring the modes of facilitation too. Please do enable courses /certifications that do not have a very long duration but new can close in days and weeks and are relevant too. \n \nThis is timebound need hence reaching out to you to please share a catalogue of the trainings available thru you including technical and on digitization if that is also what your landscape encompasses. \n \nI will be happy to get on a call with you today or wed as I need to have clarity by Wednesday and not later. I am available @ 9811901027 and please feel free to call me or email me @\nSrivastava, Swati Shelly \nSwatiShelly.Srivastava@genpact.com\n \nWarm Regards,\nShelly \n \nSwati Shelly Srivastava\nProgram Manager | Program Management - Transition\n+91 9811901027\n | \nswatishelly.srivastava@genpact.com",
    "received_at": "2023-10-23T12:47:47+00:00",
    "sent_at": "2023-10-23T12:47:19+00:00",
    "date_extracted": "2025-04-04T19:37:58.943014"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAFzueYCAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAI6SSUmmxB9JuoClxH2CWTY=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Leverage RallyBright for the science, software and skills you need to build exceptional teams.",
    "body": "This month we're diving into why RallyBright surpasses more traditional methods for benchmarking team performance.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we're sharing our latest RallyBright blog post tackling why traditional employee surveys fall short, and how our platform is better-suited for helping leaders build exceptional teams. We also have a recap of RallyBright's presentation during the recent Women in Tech 2023 event in Boston.\n \nFinally, we're unveiling RallyBright's brand new Leadership Experience demo! Leaders are welcome to use our lightweight tool to quickly assess and benchmark their teams' performance. \n \n–Your friends at RallyBright\nLEARNING\n \nRallyBright vs. Traditional Employee Survey Software\nWhile employee surveys are essential, traditional tools and methods often fall short of capturing accurate employee sentiment and engagement. This is where RallyBright comes in--we stand out from other typical types of employee survey software and can make a tangible difference in how your team performs. \n \nRead on \nhere\n for everything you need to know about employee surveys, why they often fall short, and how RallyBright can positively impact your company.\n \nUse RallyBright to Discover How Adaptable Your Teams Are at Work\nWhen teams are adaptable, they share a strong outside-in focus with both internal and external stakeholders, and they respond rapidly to data and insights. RallyBright can help your teams become more adaptable, driving each member to respond better and faster to setbacks and challenges at work.\n \nSo how adaptable is your team? Find out with the RallyBright Team Adaptability Quiz, a quick and free survey \nhere\n.\nWOMEN IN TECH - BOSTON 2023 EVENT RECAP\n \nWomen Leaders Build Better Teams: Using Data to Improve Team Performance in a Hybrid World\nRallyBright's Chief Strategy Officer, \nMike Sweeney\n, spoke at the Women in Tech 2023 event in Boston, MA. With some helpful advice from his daughters, Mike presented RallyBright's case to the women leaders in the audience. Using our science-backed, data-driven tools is key to building better teams. Plus, the data already shows that women are often better leaders than men across the board.\n \nIf you missed the event, check out the slides from Mike's presentation \nhere.\nRALLYBRIGHT LEADERSHIP EXPERIENCE DEMO\n \nA Lightweight Tool for Benchmarking Your Teams\nWe're excited to announce RallyBright's brand new Leadership Experience demo! Our platform gives leaders the science, software and skills to understand their team's strengths and development areas. Now leaders can gain these insights right out of the gate with our brand new demo. The Leadership Experience is a light, streamlined tool designed to help anyone jump in and get quick, actionable results for their teams. \n \nWe're also looking for anyone who would like to help us test out this new Leadership Experience! Please reach out to us at \ncs@rallybright.com\n if you're interested in giving the demo a try.\n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-10-18T13:51:09+00:00",
    "sent_at": "2023-10-18T13:51:01+00:00",
    "date_extracted": "2025-04-04T19:38:00.010874"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAFjTNTSAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQALNXzVIveBxHpa1PkMrkWGg=",
    "from": "hello@scoro.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@scoro.com",
    "in_reply_to": "N/A",
    "subject": "Webinar: Simplify customer collaboration with Shareable Quotes, Gantt and Stripe!",
    "body": "Discover Scoro's latest product updates that will enhance the way you collaborate with customers and other stakeholders!\n \n \nHi Melonya,\n \nOur latest product updates help you \nenhance collaboration and communication with your clients\n. Join our \nfree live webinar\n to discover how to make the most out of these features!\nShare \nonline\n \nquotes \nwith clients via a link to get their immediate feedback\nAlign project timelines and expectations, as well as communicate progress with \nshareable Gantt\nAccept payments quickly and securely from absolutely anywhere with \nStripe integration\n.\nWe look forward to seeing you at the webinar! \n \nBest wishes,\nTeam Scoro\nWebinar: Simplify customer collaboration with Shareable Quotes, Gantt and Stripe\nOctober 4, 2023 15:00 BST / 10:00 ET / 17:00 EEST\nBook my spot\n \n \nP.S. Can’t join us live?\n Register anyway, and we’ll send you a recording after the event.\n \n \n \n \nScoro Software, The Frames, 1 Phipp Street, London, England EC2A 4PS, United Kingdom \nUnsubscribe\n \nManage preferences\n \nWe are notifying you that we are processing your data based on legitimate interest (EU regulation 2016/679 (GDPR) Art 6 (1) (f)) as we have acquired your business contacts as you were a trialist user of Scoro or have requested a Scoro demo. You have under GDPR the right to opt-out and object against us processing your data under that ground. For more information about how we process data, please see our \nPrivacy Policy\n.",
    "received_at": "2023-09-27T08:02:42+00:00",
    "sent_at": "2023-09-27T08:02:36+00:00",
    "date_extracted": "2025-04-04T19:37:59.562391"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAFjTNTRAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAIPukCdglehKkmCH0aRYNAA=",
    "from": "hello@scoro.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "anett.pero@scoro.com",
    "in_reply_to": "N/A",
    "subject": "Improving Customer Communication with Shareable Quotes, Gantt, and Stripe",
    "body": "View in browser\n \n \n \nHello, Melonya \n👋\n \nWelcome to the latest edition of Scoro's Structured newsletter, where we offer valuable insights and opportunities to support your day-to-day work. What will be included in this 3-minute read?\n \n💡 New in Scoro: Close deals faster with Shareable Quotes\n🔍 Product webinar: Simplify customer collaboration with Sharable Quotes, Gannt and Stripe\n🧘 Webinar: How to prevent burnout in your team\n💡 New in Scoro – Shareable Quote View\n \nA quote serves several purposes in Scoro. It acts as an external price proposal for the client and an internal budgeting tool to ensure the desired margins.\n \nThis month, we’re also adding a collaborative dimension to quotes – you can now conveniently share quotes with clients via a link and get their immediate feedback in the same view to shorten the closing cycle.\nIf you want to know more, \nread about the feature\n or join the webinar below 👇\n \n🔍 \nWEBINAR\n: Simplify customer collaboration with Shareable Quotes, Gantt and Stripe\n \nOur latest product updates help you enhance collaboration and communication with your clients. Join our \nfree live webinar\n to discover how to make the most out of these features:\nShare quotes with clients via a link to get their immediate feedback\nAlign project timeline expectations and communicate progress with shareable Gantt\nAccept payments quickly and securely from absolutely anywhere with Stripe integration.\n4th of October \nat 15:00 BST / 10:00 ET / 07:00 PT.\n \nCan’t make it? Sign up anyway, and we’ll send you a recording after the event.\nSecure your spot here!\n \n \n🧘 WEBINAR:\n Improving Agency's Operations to Prevent Burnout\n \nIn the modern landscape, the role of the Head of Operations extends beyond managing processes; it also encompasses a crucial people-centric aspect. Sian Eddy, the Head of Operations at ModernB2B, is passionate about proactively addressing burnout and nurturing well-being within her agency. \nJoin us for a \nfree webinar,\n where she shares her insightful findings and guidance in this essential area, as well as how to:\nidentify burnout and stress sooner\nuse data to predict employee well-being\n26th October\n at 14:00 BST / 09:00 ET / 06:00 PT\n \nCan’t make it? Sign up anyway, and we’ll send you a recording after the event!\nSign me up for the webinar!\n \nThat's it for this month's edition of Structured! \nStay tuned for more insights in our next edition. \n \nScoro is the work management solution for managing \nsuccessful projects from quote to cash\n. We’re built for service businesses who are tired of disjointed systems, unpredictable workloads, and shrinking margins. \nScoro Software, 81 Rivington Street, London, England EC2A 3AY, United Kingdom \nUnsubscribe\n \nManage preferences",
    "received_at": "2023-09-26T08:19:36+00:00",
    "sent_at": "2023-09-26T08:19:31+00:00",
    "date_extracted": "2025-04-04T19:38:00.133454"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAFjTNTQAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQANoIUe0vMc5OhPxx0fsMlGg=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "In times of immense change or disruption, focusing on adaptability is the key to your team's success",
    "body": "This month we're diving into why teams and leaders should embrace adaptability through change and disruption.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we have tips to share on embracing adaptability, driving more productive meetings at work, and more. For timely insights on staying adaptable through disruption, RallyBright founder and CEO John Estafanous has a brand new blog post through the Forbes Human Resources Council. We also have some new RallyBright platform resources to help your teams on their continuous growth journey.\n \n–Your friends at RallyBright\nLEARNING\n \nWhy Your Team Should Embrace Adaptability When Facing Disruption\nStaying adaptable through challenges at work can be tough. As leaders, when we’re worried about everything that can go wrong, it’s difficult to focus anywhere else. The stakes we face in high-level roles are usually high, and the price of failure can feel like too much to bear. But that is why it’s crucial to keep a level head during times of change and disruption. After all, isn’t it better to focus on recovering and growing from challenges?\n \nIn times of immense change or disruption, focusing on adaptability is the key to your team's success. Learn more \nhere\n from RallyBright founder and CEO John Estafanous, in his post for the Forbes Human Resources Council.\nRALLYBRIGHT PLATFORM RESOURCES\n \nRallyBright Team Solutions: Unproductive Meetings at Work\nOne of the most common vulnerabilities among teams includes unproductive, useless, or ineffective meetings. These types of meetings can leave employees feeling disengaged at work. Team members tend to perceive meetings as unproductive when there’s a lack of coordination or direction, or if they view their own work as more important than checking in with the group.\n \nUnproductive meetings are usually a symptom of other common issues, such as friction between departments or a lack of shared direction.\n \nCheck out our RallyBright resource \nhere\n for tips on driving more productive meetings for your teams.\n \nAn Overview of Team Communication Styles\nYour Team DISC style is an overview of how your team works at work, spread across four primary dimensions: \nDominance (D)\n, \nInfluencer (I)\n, \nSteadiness (S)\n, and \nConscientiousness (C)\n. It illustrates how all the different work styles on your team come together to form a cohesive unit and explores the types of behaviors that may be commonly accepted or criticized within the unit.\n \nThere are numerous ways in which understanding your team DISC styles and adapting your leadership practice based on your team style can benefit you as a leader. Understanding these styles also benefits the team members you work with, and the organization that the team works within.\n \nIf you're interested in learning more about Team DISC communication styles, you can find our platform resource \nhere\n.\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-09-20T13:49:26+00:00",
    "sent_at": "2023-09-20T13:49:15+00:00",
    "date_extracted": "2025-04-04T19:41:16.667396"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAFM43psAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAJcJjMu3cL1MnqrcDFtOU9M=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Turn past disruptions into opportunities for future growth with RallyBright",
    "body": "This month we're diving into how leaders and teams can bounce forward from disruption and into growth.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we have some resources to share about getting your team on board for major changes, how a company evolves with team performance solutions, and more. RallyBright founder and CEO John Estafanous shares his wisdom on turning past disruptions into opportunities for future growth, offering tips on how to capitalize on positive momentum.\n \n–Your friends at RallyBright\nLEARNING\n \nHow to Prepare for Future Growth After a Disruption Rebound\nAs we move beyond disruption in the labor market, we can be optimistic. Highs and lows naturally come in waves, so when the highs do happen, we need to be prepared to capitalize on them. Organizations should capitalize on positive momentum by setting teams up to successfully plan an even brighter future.\n \nLearn more \nhere\n from RallyBright founder and CEO John Estafanous.\n \nHow to Get Your Team on Board with a Major Change\nDo you sometimes struggle with getting your team on board with major changes at your company? We love this article from \nHarvard Business Review\n on how to drive change through belonging - and how to lead difficult conversations to make uncomfortable, but necessary changes.\n \nIf you're looking for ways to make big changes at your organization, be sure to read more \nhere\n.\n \nHow a Company Evolves After Implementing a Team Performance Management Solution\nBy measuring team performance and analyzing the data, leaders can gain valuable insights and create focused transformations. If you’re looking to improve your team’s performance, a performance management solution may be just what you need.\n \nCheck out our post on the RallyBright blog \nhere\n to learn how your company can evolve with team performance solutions.\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-08-17T13:47:38+00:00",
    "sent_at": "2023-08-17T13:47:33+00:00",
    "date_extracted": "2025-04-04T19:57:23.007424"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAE1JPnoAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAFfALGVP6YpDlxuZd3cIBYk=",
    "from": "changemanagement@prosci.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "changemanagement@prosci.com",
    "in_reply_to": "N/A",
    "subject": "How to Manage Technology Changes Holistically",
    "body": "Change management for technology is more than implementing software and training on how to use it. A holistic solution is key to success.\n \n \nNew From the Blog\n \nHow to Manage Technology Changes Holistically\nManaging technology changes holistically is key to achieving your intended business outcomes faster and often at lower cost. \nRead More\n \nYou Might Be Interested In...\n \nAdapting and Adjusting Change Management in an Agile Project\nWithin a project using Agile or other iterative approaches, change management can support the adoption and usage you need to achieve results.\nLearn More\n \nA Communications Plan is Not Change Management\nOne of the most common objections to change management is the misguided belief that communications plans are all you need to manage change.\nLearn More\n \n \n \n \nProsci Inc., 2950 E. Harmony Road, Suite 150, Fort Collins, CO 80528, USA, +1 970 203 9332 \nUnsubscribe\n \nManage preferences",
    "received_at": "2023-07-13T18:01:55+00:00",
    "sent_at": "2023-07-13T18:01:50+00:00",
    "date_extracted": "2025-04-04T20:06:13.093245"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAE1JPniAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQADOyXYf_7lhPuOM64hDU5nY=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Embracing adaptability will help you thrive in today's volatile landscape",
    "body": "This month we're sharing amazing insights on embracing adaptability during this challenging business landscape.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we have news about our upcoming webinar for small business leaders in the technology industry! Be sure to check out our announcement below if you're interested in attending the webinar. We're also sharing a new RallyBright blog post on how high-performing teams drive impact for your organization, as well as a fun, eye-opening write-up from RallyBright's Chief Strategy Officer on the importance of servant leadership.\n \n–Your friends at RallyBright\nRALLYBRIGHT WEBINAR FOR SMALL BUSINESS TECH LEADERS: JULY 19 12PM ET\n \nDiscover the keys to embracing adaptability and building resilient teams in the dynamic technology industry.\n \nJoin experts from RallyBright and Contemporary Leadership Advisors in a transformative webinar tailored for small business leaders in the technology industry. Learn how to navigate uncertainty and foster adaptability within your teams to drive success. Gain practical insights and strategies from our experiences working with leaders like you.\n \nThe webinar is scheduled for \nJuly 19 at 12pm ET\n. Be sure to sign up \nhere\n.\nLEARNING\n \nUnlocking Potential: How High-Performing Teams Drive Impact\nAt RallyBright, we help organizations build and measure high-performing teams. We achieve this by giving leaders, managers, and team members the science, software, and guidance to unlock their full potential. But what does that mean in terms of how high-performing teams drive a return on investment (ROI)?\n \nLearn more from the RallyBright blog \nhere\n.\n \nServant Leaders are More Elusive Than We Think\nLeaders who find ways to build inclusive, resilient, high-performing teams are elusive. They don’t show up in every organization. They're a lot like \"purple squirrels\" in how rare they are. These servant leaders are active learners, change agents, data hungry, open to feedback, and a lot more.\n \nAre you the elusive purple squirrel leader? Find out from RallyBright's Chief Strategy Officer, Mike Sweeney, by reading his LinkedIn post \nhere\n.\n \nGet Ahead of Challenges in the Workplace with RallyBright\nAs technology and the markets evolve at a rapid pace, leaders must consistently ensure their teams are focused on what drives impact for their stakeholders and their organization. Remaining focused on the team’s shared purpose while addressing external factors is critical to a team accomplishing its goals.\n \nRallyBright can help you get ahead of these challenges in the workplace. Learn more from our website \nhere\n.\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-07-12T13:45:31+00:00",
    "sent_at": "2023-07-12T13:45:21+00:00",
    "date_extracted": "2025-04-04T20:06:14.172779"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAEhDMZzAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQALLETPTG099MgRd59WGGjms=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Setting your teams up for success early on is crucial for long-term growth",
    "body": "This month we're sharing the best tips on how to improve the trajectory of your most important teams in 100 days or less.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we're sending out an update on our lunch-and-learn for L&D leaders. We've rescheduled our webinar for this week! We also have insightful blog posts to share from RallyBright founder and CEO John Estafanous and Chief Strategy Officer Mike Sweeney, as well as a brand new update to the RallyBright platform for our Inclusive Collaboration users.\n \n–Your friends at RallyBright\nRALLYBRIGHT LUNCH-AND-LEARN FOR L&D LEADERS: JUNE 14 AT 12PM ET\n \nWhether you’ve just completed a reorganization or are pushing through today’s difficult operating environment, your colleagues are carrying a lot more than just the company’s goals on their backs. Learning and Development professionals are once again welcome to join us for our upcoming Lunch-n-Learn! Discover what it takes to improve the trajectory of your most important teams in 90 days, and how RallyBright makes that process easier.\nIf you're interested in attending the webinar on \nJune 14 at 12pm ET\n, be sure to sign up \nhere\n.\nLEARNING\n \nHow New Leaders Can Generate Success In Their First 100 Days\nIf you're a new leader looking to make your mark, it’s important to hit the ground running with your teams. Focusing on key success strategies can make all the difference. RallyBright founder and CEO John Estafanous has some great insights to share on how new leaders can find the most success in 100 days.\n \nRead his latest post for the Forbes Human Resources Council \nhere\n.\n \nCrystal Clear Direction For Your High-Performing Team\nThe best leaders know how to make the best decisions - including those micro-moment choices that add up over time. Successful leaders also provide great direction to their teams, allowing everyone to stick to a roadmap during times of confusion. When it comes down to it, direction is key to high performance. Every leader should know how and when to provide this direction for their teams.\n \nRallyBright's Chief Strategy Officer, Mike Sweeney, has the scoop on the importance of compelling direction. Read more from Mike \nhere\n on LinkedIn.\nNEW RALLYBRIGHT PLATFORM FEATURE\n \nTimeshift for Inclusive Collaboration\nCompare your team's Inclusive Collaboration Assessment results to previous results using the new \nTimeshift\n buttons. \n \nThis feature is available for teams who have completed the assessment more than once. You'll find these buttons in the \nScore Summary\n and \nStrengths + Vulnerabilities\n section of your Team Inclusive Collaboration report. It's now easy to see your team's progress and changes in specific behaviors over time.\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-06-12T13:45:27+00:00",
    "sent_at": "2023-06-12T13:45:20+00:00",
    "date_extracted": "2025-04-04T20:06:24.652075"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAEYipA7AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAGMUZ6GirMxMoN_zt8GqzSY=",
    "from": "maccount@microsoft.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "maccount@microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Audio Conferencing for Microsoft Teams has been turned off",
    "body": "– \nAudio Conferencing for Microsoft Teams has been turned off \n– \n– \nOffice 365 Audio Conferencing has been turned off for your account. This means your meeting participants can no longer join by phone. Please contact your Office 365 admin if you have questions. \n  \nName: \n  \n  \n  \nAccount: \n  \nm.johnson@lcwmail.com \n  \n– \n– \nThis is an automatically generated service communication. For more information, please contact your administrator.\n–",
    "received_at": "2023-06-02T15:44:35+00:00",
    "sent_at": "2023-06-02T15:44:29+00:00",
    "date_extracted": "2025-04-04T20:06:30.886992"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAERc3ggAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAGD5mC15RoZOqxovkRrUnPc=",
    "from": "publishing@email.mckinsey.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "donotreply-HP2v70000018837c7f1afcc501cf4bbcfd118163@email.mckinsey.com",
    "in_reply_to": "N/A",
    "subject": "New on the McKinsey Insights App",
    "body": "Stay on top of business trends with your own Insights feed and custom notifications ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ \n \n \n \n \nDear Melonya,\nAs you go about your busy workweek, one of the easiest ways to stay on top of emerging business trends is your own personalized feed on the McKinsey Insights app.\nStill need the app?\n \n \n \nScan the QR—or learn more here\nAlready have the app? Dive in here\n \n \nThe app makes it a breeze to discover relevant insights as you go about your busy day. Just tell us the topics that matter most to you and we’ll deliver the latest you need to know.\nWe think you’ll love the new features that make it even easier to read, watch, and listen to our content on the go. There’s a lot more you can do when you install the app:\nNEW\nTune into what matters most, with personalized push notifications\nYou get to pick from more than five new categories, so your push notifications stay relevant and you get only what you need.\nChoose your notifications\nExplore insights curated just for you\nChoose the topics you want to follow, and watch your screen populate with timely insights. Our newly redesigned home feed\n puts more information at your fingertips.\nPick your topics\n \nSave articles for reading later\nEasily s\nhare articles with others, or save them to your own in-app reading list and catch up later.\nHave other features you’d like to see? Let us know\nBe sure to \nsign in and explore what’s new\n—and see why readers trust the five-star-rated McKinsey Insights app to deliver the best business news and analysis.\nWe’re continuously adding new features to the app, so stay tuned for updates!\nAlready have the app? \nDive in here\n.\nOr download it now \nWe value your feedback. To suggest features or request technical support, \ndrop us a note\n.\nFollow our thinking\n \nThis email contains information about McKinsey’s research, insights, services, or events. By opening our emails or clicking on links, you agree to our use of cookies and web tracking technology. For more information on how we use and protect your information, please review our \nprivacy policy\n.\nYou received this email because you are a registered member of mckinsey.com.\nManage subscriptions\n \n|\n \nUnsubscribe me from informational emails about McKinsey.com\nCopyright © 2023 | McKinsey & Company, 3 World Trade Center, 175 Greenwich Street, New York, NY 10007",
    "received_at": "2023-05-20T06:10:37+00:00",
    "sent_at": "2023-05-20T06:10:31+00:00",
    "date_extracted": "2025-04-04T20:26:17.361295"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAEP-_2UAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAI4eAh_UPR9BjWL9UAfivdw=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Learning & Development leaders won't want to miss this opportunity",
    "body": "This month we're sharing news about our upcoming lunch-and-learn for L&D leaders, along with insights on high-performing, inclusive teams.\n \nHello, Melonya —\n \nIn this month's Resilient Teams newsletter, we have some exciting news to share about our upcoming lunch-and-learn for L&D leaders! Read on for more information about the webinar, as well as revealing insights on why high-performing, inclusive teams can make all the difference for your organization. \n \n–Your friends at RallyBright\nRALLYBRIGHT LUNCH-AND-LEARN FOR L&D LEADERS: WEDNESDAY, MAY 24 AT 12PM ET\n \nWhether you’ve just completed a reorganization or are pushing through today’s difficult operating environment, your colleagues are carrying a lot more than just the company’s goals on their backs. Learning and Development professionals are welcome to join us for our upcoming Lunch-n-Learn! Discover what it takes to improve the trajectory of your most important teams in 90 days, and how RallyBright makes that process easier.\nIf you're interested in attending the webinar on \nWednesday, May 24 at 12pm ET\n, be sure to sign up \nhere\n.\nLEARNING\n \nWhy High-Performing and Inclusive Teams Matter For Your Business\nTeams drive an organization’s performance. In an ideal world, all of these teams would be high-performing teams. High-performance teams deliver successful financial performance by leveraging the characteristics and behaviors that align with the company’s mission, vision, values, and culture.\n \nRead more on the RallyBright blog \nhere\n about why high-performing, inclusive teams can make a real difference for your organization.\nA WORD FROM OUR CUSTOMERS ON G2\nWe love when our customers leave us a \nreview on G2\n. If you’re not familiar with G2, it is an independent review site where professionals share their opinions on the software they use. Check out one of our reviews below:\n \nIf you'd like to submit your honest thoughts for RallyBright, please leave us a review \nhere\n. Your feedback directly contributes to our mission of building exceptional teams for our customers.\nThank you!\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-05-17T13:45:18+00:00",
    "sent_at": "2023-05-17T13:45:12+00:00",
    "date_extracted": "2025-04-04T20:26:22.993924"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAEGwtiAAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQABSw0XJ-h6RIoYxatISzcDw=",
    "from": "+18722531505",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "noreply@skype.voicemail.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Voice Mail (54 seconds)",
    "body": "Hello, my name is Michelle Lewis. I'm calling from Champion Strategy Holdings. I'm calling in regards to a file that's been forwarded to our office for review. It's important that we receive a call from you or your legal representation since this follows a time sensitive matter. A recommendation must be submitted to your local county processor. Failure to return this call must be noted as a forfeiture of your rights and will be submitted accordingly. Please press 1 now to be connected to a mediator or call 1-877-311-2348 to speak with the next available agent. This is an attempt to collect a debt from a professional debt mediator.\nYou received a voice mail from \nCHICAGO IL\n.\nThank you for using Transcription! If you don't see a transcript above, it's because the audio quality was not clear enough to transcribe.\nSet Up Voice Mail",
    "received_at": "2023-05-04T19:52:55+00:00",
    "sent_at": "2023-05-04T19:52:52+00:00",
    "date_extracted": "2025-04-04T20:26:28.612087"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADuNr1BAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAC8SG_Hcv7xNjZ9ummik5oo=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "It's critical to optimize team performance through disruption",
    "body": "This month we're sharing news about our new DISC+ assessment along with tips on optimizing team performance through disruption.\n \nHello, Melonya —\n \nAs we continue solving tough challenges at work, RallyBright has the solutions you need to thrive through the chaos. This month we have exciting news about our new DISC+ assessment for teams, a valuable blog post from RallyBright CEO and founder John Estafanous, and helpful information on how and why teams are your organization's best resource.\n \n–Your friends at RallyBright\nRALLYBRIGHT DISC+ ASSESSMENT FOR TEAMS\n \nWe've recently launched our updated DISC+ assessment for teams! The Team DISC+ report leverages your team’s individual workstyles and provides a simple, actionable analysis of your team’s professional and personal priorities and preferences. Our update to the assessment includes brand new visuals to help identify precisely where team members fall between Dominance, Influence, Steadiness, and Conscientiousness (DISC), offering deeper levels of granularity.\nLearn more about our DISC+ assessment \nhere\n on our website.\nLEARNING\n \nHow HR Can Optimize Team Performance Through Disruption\nWith the constant disruption we’re experiencing in the workplace right now, we’re all looking for ways to stay afloat through the ambiguity. Whether it’s through layoffs or cutting operational costs, most organizations see the need to save resources to weather the storm. But there’s another trick to staying afloat through disruption, and that involves leveraging the strengths of our teams.\n \nRallyBright CEO and founder John Estafanous shares his insights on how leaders can optimize team performance through disruption. Check out his post \nhere\n as part of the Forbes Human Resources Council.\n \nNew Research Shows Why Focus On Teams, Not Just Leaders, Is Key To Business Performance\nWhen redesigning organizational structures, it's important to keep a strong focus on teams. Now more than ever, business leaders see how critical teamwork is to their company's success. New research shows why a \"network of teams\" is the key to success in today's world of work.\nRead more from \nForbes \nhere\n.\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-04-12T13:46:37+00:00",
    "sent_at": "2023-04-12T13:46:31+00:00",
    "date_extracted": "2025-04-04T20:26:43.520260"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADuNr0_AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAGysubAH_YlEmImEG_Us_Vo=",
    "from": "changemanagement@prosci.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "changemanagement@prosci.com",
    "in_reply_to": "N/A",
    "subject": "Prosci Expands Global Presence Through Acquisition of Nexum",
    "body": "Prosci partner Nexum is now Prosci Europe, delivering global change management services and training throughout much of Europe and beyond.\n \n \nNew From the Blog\n \nProsci Expands Global Presence Through Acquisition of Nexum\nWe’re thrilled to announce the acquisition of our European partner Nexum Group SRL (Nexum), the parent company of European affiliate CMC Partnership Global.\nRead More\n \nYou Might Be Interested In...\n \n5 Ways to Help Sponsors Build a Coalition of Support for Change\nOf the ABCs of Sponsorship, building a coalition effectively is often the most difficult and can elude even well-intentioned sponsors. \nLearn More\n \n5 Ways to Educate New Practitioners About Change Management\nOnce you’ve hired a new team member, how do you ensure they have the knowledge and ability they need to successfully facilitate change?\nLearn More\n \n \n \n \nProsci Inc., 2950 E. Harmony Road, Suite 150, Fort Collins, CO 80528, USA, +1 970 203 9332 \nUnsubscribe\n \nManage preferences",
    "received_at": "2023-04-06T18:03:39+00:00",
    "sent_at": "2023-04-06T18:03:33+00:00",
    "date_extracted": "2025-04-04T20:26:43.070529"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADf0DN4AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAIMzLZbwUzdHuiNGNhXNFnI=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Accelerate your impact as a coach with RallyBright on March 29",
    "body": "We have some exclusive information for coaches looking to leverage the RallyBright Resilient Teams platform.\nHello, Melonya —\n \nIf you received our previous Resilient Teams newsletter, we announced an upcoming webinar for coaches. In the announcement, we accidentally included the wrong date for the webinar. Please see the correction below!\n \nYou can sign up for the event on our website \nhere\n.\n \nWe hope to see you there!\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-03-21T13:46:27+00:00",
    "sent_at": "2023-03-21T13:46:23+00:00",
    "date_extracted": "2025-04-04T20:27:01.104870"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADf0DNwAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQANVrYgkPUiFAtngfjqsOjgA=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Improving teamwork is the best investment you can make",
    "body": "This month we're sharing news about our new certification program, and tools to improve your teams and leadership.\n \nHello, Melonya —\n \nLeaning on our teams is essential for surviving the current work climate. With this in mind, we've sent along a few tools for improving your teams and leadership: a new RallyBright Resilient Teams certification program for coaches, helpful articles to deepen your learning, and a new RallyBright platform feature we hope you'll enjoy.\n \n–Your friends at RallyBright\nRESILIENT TEAMS CERTIFICATION FOR COACHES\n \nRallyBright is now offering full grants to our Resilient Teams certification program for coaches who work with teams. Learn how to accelerate your impact as a team coach by mastering the RallyBright Resilient Teams platform. Expand more thoroughly within organizations by leveraging the platform’s unique capabilities for driving exceptional team growth.\nOur 30-minute information session will take place on Wednesday, March 22 at 12pm EST. If you'd like to sign up, please email us at \ncs@rallybright.com\n.\nNEW RALLYBRIGHT PLATFORM FEATURE\n \nSchedule Your Assessment Launch\nThe RallyBright platform now has a feature that allows you to manually schedule your team's assessment launch. Schedule your team assessment launch when it's convenient for you – then let the assessment start automatically at just the right time. \n \nLearn how in the RallyBright Help Center: \nSchedule Your Team Assessment Launch\n. Or watch the video below.\n \nLEARNING\n \nHow to Measure and Promote Inclusion and Collaboration in the Workplace\nMany of us know the benefits of fostering diversity, equity and inclusion initiatives for our organizations, but not every company makes it past the initial hurdles. As leaders, it’s important for us to really understand the \ndefinitions of inclusion and collaboration\n and then align these foundations within the context of our company’s goals. By making these conscious changes, you can create an outstanding environment and community for your employees.\n \nRead more \nhere\n from our CEO and founder John Estafanous on the \nForbes Human Resources Council\n.\n \nThe $2 Billion Question of Who You Are at Work\nThe vast and wild world of personality tests is a $2 billion industry these days. RallyBright employs the DISC assessment as a way to help team leaders better understand and develop their employees. Managers worldwide use these tests to help them navigate hybrid and remote work, and to get beyond resumes to make tough hiring decisions. \nCheck out this article \nhere\n from the \nNew York Times\n about the ever-growing industry of personality tests.\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-03-15T13:46:35+00:00",
    "sent_at": "2023-03-15T13:46:30+00:00",
    "date_extracted": "2025-04-04T20:27:07.600014"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADf0DNpAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAC2xh8ZEaL1Gsl5r616TV2A=",
    "from": "publishing@email.mckinsey.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "donotreply-HP2v700000186db020d549919166e96c569c8174@email.mckinsey.com",
    "in_reply_to": "N/A",
    "subject": "Get your free digital McKinsey Quarterly membership now",
    "body": "Our flagship publication is now available to you ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌   ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ \n \n \nJoin an exclusive membership group\nHello Melonya,\nAfter nearly 60 years as a print magazine sent mostly to McKinsey’s clients, the \nMcKinsey Quarterly\n is going digital—and bringing its groundbreaking management and leadership insights to you, a valued McKinsey Publishing subscriber. \nWe invite you to be among the first to receive a \ncomplimentary membership\n to the new digital edition of the \nQuarterly\n. Once you sign up, you’ll gain access to all the content and elegance of our flagship publication, now in an immersive, accessible online format. Additionally, your membership will include exclusive access to free downloads of our 100 most important reports in the McKinsey Insights Store.\nIf you haven’t been able to visit McKinsey.com lately, we hope this offer welcomes you back into our unique community and reminds you of the distinctive, cross-cutting insights available there—and of the value of the \nQuarterly\n in particular. \nTo read the current digital edition of the \nMcKinsey Quarterly\n and start receiving email updates when new issues are available, visit the \ndigital \nQuarterly\n landing page\n to sign up for a free membership. You’ll have to log into your existing McKinsey.com account or create a new one.\nIf you have any questions about the registration process or comments on the digital \nQuarterly\n, please reach out to us at \nMQD@mckinsey.com\n. \nSincerely,\nRaju Narisetti\nLeader, McKinsey Global Publishing\nFollow our thinking\n \nMcKinsey Insights\n - Get our latest thinking on your iPhone, iPad or Android.\n \n \n \nThis email contains information about McKinsey’s research, insights, services, or events. By opening our emails or clicking on links, you agree to our use of cookies and web tracking technology. For more information on how we use and protect your information, please review our \nprivacy policy\n.\nYou received this email because you are a registered member of mckinsey.com.\nManage subscriptions\n \n|\n \nUnsubscribe\nCopyright © 2023 | McKinsey & Company, 3 World Trade Center, 175 Greenwich Street, New York, NY 10007",
    "received_at": "2023-03-13T12:46:34+00:00",
    "sent_at": "2023-03-13T12:46:30+00:00",
    "date_extracted": "2025-04-04T20:27:12.474288"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADf0DNdAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQALa2zHW96qVKjA0SIO8z3-g=",
    "from": "+17015103486",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "noreply@skype.voicemail.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Voice Mail (11 seconds)",
    "body": "Medicare benefits at no cost to you. Do you have Medicare Part A and Part B?\nYou received a voice mail from \nUnavailable\n.\nThank you for using Transcription! If you don't see a transcript above, it's because the audio quality was not clear enough to transcribe.\nSet Up Voice Mail",
    "received_at": "2023-03-09T23:54:13+00:00",
    "sent_at": "2023-03-09T23:54:09+00:00",
    "date_extracted": "2025-04-04T20:27:27.248120"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADSTY7_AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAJfiVckthmBNiyhO5-fbSeA=",
    "from": "changemanagement@prosci.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "changemanagement@prosci.com",
    "in_reply_to": "N/A",
    "subject": "Interactive Report: Research on Impactful Actions for Change Success",
    "body": "Examine Prosci’s NEW interactive report on the Most Impactful Actions for Change Success in a Post-Pandemic World.\n \n \nNew From the Blog\n \nInteractive Report: Research on Impactful Actions for Change Success\nProsci’s change management research process, tools and reports have evolved—and continue to evolve—to reflect the fast-paced, digital times we live in. \nRead More\n \nYou Might Be Interested In...\n \nChange Management Takes Change Management\nYour success managing change on projects in your organization depends on how you manage the people side of applying change management.\nLearn More\n \nChange Management Basics: Glossary\nNeed to develop or improve your change management vocabulary? Here's a brief guide to Prosci change management terms.\nLearn More\n \n \n \n \nProsci Inc., 2950 E. Harmony Road, Suite 100, Fort Collins, CO 80528, USA, +1 970 203 9332 \nUnsubscribe\n \nManage preferences",
    "received_at": "2023-03-02T19:03:13+00:00",
    "sent_at": "2023-03-02T19:03:08+00:00",
    "date_extracted": "2025-04-04T20:27:38.847359"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADSTY7uAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAMlH0DHI_79MgMZzFVAfkxg=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "This one thing makes your employees 10x less likely to leave",
    "body": "Find out why great employees leave and what you can do about it.\n \n \nHi Melonya, \nWant to hear something genuinely surprising?\nRecent RallyBright research finds that \"\nemployees in highly inclusive workplaces are 10x less likely to think about leaving than their peers in low-inclusion workplaces.\n\"\nThe research comes from our \nInclusive Collaboration at Work Report, \nwhich is chock full of essential data like this and more about why diversity and inclusion are powerful drivers of business performance. Take a look!\n \nIf you'd like to learn more about the research and find out how you can drive inclusion in this new hybrid world of work, give us \n30 minutes\n and we'd be happy to show you.\nBook A Free Demo\n \nCheers,\nYour friends at RallyBright\nwww.RallyBright.com\n \n \n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nUnsubscribe\n \nManage preferences",
    "received_at": "2023-02-23T21:22:44+00:00",
    "sent_at": "2023-02-23T21:22:37+00:00",
    "date_extracted": "2025-04-04T20:27:44.355776"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADSTY7aAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQABF5yqFtmDlKiCW4UhRnQ-w=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Keep building exceptional teams with RallyBright",
    "body": "This month we're sharing news about our new Leadership Academy, and solutions to align your teams around your organization's goals.\n \nHello, Melonya —\n \nAs we continue pushing through a challenging 2023, it's more essential than ever that we lean on our teams. This month's newsletter offers must-have solutions through our new RallyBright Academy, our latest blog post on team building strategies, and a new platform feature for team members to gain a better understanding of one another. \nBuilding exceptional teams will always get you past the finish line. \n \n–Your friends at RallyBright\nRALLYBRIGHT LEADERSHIP ACADEMY\n \nRallyBright is now offering training courses geared toward training current leaders, or potential future leaders through our RallyBright Academy. You'll find customized development opportunities in two subject areas: Leading High-Performing Teams and Building Inclusive Teams, either through an interactive virtual seminar or a hands-on simulation (virtual or in-person).\n \nIf you're eager to hear more about the RallyBright Leadership Academy, please feel free to reach out to us at \ncs@rallybright.com\n.\nNEW RALLYBRIGHT PLATFORM FEATURE\n \nProfile Comparison Charts\nWe've added a new feature to our share-and-compare capabilities for DISC assessment results. Use this to easily compare work styles between team members.\n \nCheck out the new feature in this Compare Profiles video. You can learn more about comparing profiles in the RallyBright Help Center: \nCompare Your Profile with a Colleague's\n.\n \nIf you have any questions, please contact our Customer Success Team at \ncs@rallybright.com\n.\n \nLEARNING\n \nHow to Use Team Building Strategies to Improve Your Workplace\nPlanning a team building event is a gratifying challenge, and a workshop is especially effective if well executed. It requires you to understand the needs of your team and respond to them in creative and effective ways. If you want your workshop to be successful, you’ll need to employ careful team-building strategies to ensure everything falls into place.\n \nLearn more from our post on the RallyBright \nblog\n.\nA WORD FROM OUR CUSTOMERS ON G2\nWe love when our customers leave us a \nreview on G2\n. If you’re not familiar with G2, it is an independent review site where professionals share their opinions on the software they use. Check out one of our reviews below:\n \nIf you'd like to submit your honest thoughts for RallyBright, please leave us a review \nhere\n. Your feedback directly contributes to our mission of building exceptional teams for our customers.\nThank you!\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-02-16T14:45:31+00:00",
    "sent_at": "2023-02-16T14:45:23+00:00",
    "date_extracted": "2025-04-04T20:28:04.488173"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADM9Y24AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAAV4tKOQA69Bs4X7y_gYzj4=",
    "from": "changemanagement@prosci.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "changemanagement@prosci.com",
    "in_reply_to": "N/A",
    "subject": "Research on Emergent Contributors to Successful Change",
    "body": "Prosci's Tim Creasey explores new research and practitioner insights to reveal important trends in change management today. \n \n \nNew From the Blog\n \nResearch on Emergent Contributors to Successful Change\nAnalysis of practitioner insights reveals how the future of organizational change management is evolving. \nRead More\n \nYou Might Be Interested In...\n \nAre You Getting Things Done or Getting Things Adopted?\nIf you're a leader who sees change management as a nice-to-have that needs to fit around pressing priorities, you're missing it's value.\nLearn More\n \n4 Advanced Applications of the ADKAR Model\nThe ADKAR Model can help guide your change management strategy, enable a common language around change, and much more. \nLearn More\n \n \n \n \nProsci Inc., 2950 E. Harmony Road, Suite 100, Fort Collins, CO 80528, USA, +1 970 203 9332 \nUnsubscribe\n \nManage preferences",
    "received_at": "2023-02-09T19:03:40+00:00",
    "sent_at": "2023-02-09T19:03:31+00:00",
    "date_extracted": "2025-04-04T20:28:24.375484"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAADK_87XAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQACNAs-5XOOxLl0K3zZNk9LA=",
    "from": "+17865500304",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "noreply@skype.voicemail.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Voice Mail (1 second)",
    "body": "You received a voice mail from \nUnavailable\n.\nThank you for using Transcription! If you don't see a transcript above, it's because the audio quality was not clear enough to transcribe.\nSet Up Voice Mail",
    "received_at": "2023-02-01T16:00:24+00:00",
    "sent_at": "2023-02-01T16:00:21+00:00",
    "date_extracted": "2025-04-04T20:28:56.011357"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAC-pa1JAAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQAJ8bRUHFnSZLmujWo4acRdw=",
    "from": "hello@rallybright.com",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "hello@rallybright.com",
    "in_reply_to": "N/A",
    "subject": "Starting 2023 strong with RallyBright",
    "body": "This month we're sharing news about our new Leadership Academy, plus tips on starting the year strong with your team.\n \nHello, Melonya —\n \nNow that we're gearing into 2023, the team at RallyBright is excited to offer support wherever we can. Level up your leadership skills through our upcoming RallyBright Leadership Academy, and our CEO and founder's latest thought leadership piece on starting the new year strong with your team. \nWe hope you're looking forward to building exceptional teams in 2023!\n \n–Your friends at RallyBright\nRALLYBRIGHT LEADERSHIP ACADEMY\n \nRallyBright will soon begin offering training courses geared toward training current leaders, or potential future leaders through our upcoming Leadership Academy. You'll find customized development opportunities in two subject areas: Leading High-Performing Teams and Building Inclusive Teams, either through an interactive virtual seminar or a hands-on simulation (virtual or in-person).\n \nStay tuned for more details! If you're eager to hear more about the RallyBright Leadership Academy, please feel free to reach out to us at \ncs@rallybright.com\n.\n \nThree Ways To Start The Year Strong With Your Team\nWe're proud to share this latest piece from our CEO and founder John Estafanous, written as part of his exciting new membership with the \nForbes Human Resources Council\n. John discusses the best ways to create strong, resilient, and inclusive teams that can face any challenges on the road ahead. \n \nTo find out how to start the year strong with your team, read his full post \nhere\n.\n \nTeam Coaching Certification: 20% Discount!\nHave you heard about the Institute for Contemporary Leadership's virtual Team Coaching Certification? Their interactive training modules leverage the RallyBright platform to help both internal practitioners and external team consultants optimize their teams for greater success.\n \nWe're offering RallyBright customers, partners, and friends a 20% discount for the program. Read more about it and sign up \nhere\n. (Just mention code RALLYBRIGHT 20 during registration to get the discount.)\n \nMake Your Team Retreats Worth the Investment with RallyBright\nRallyBright can ensure you meet your goals for your next team retreat. Whether you’re building teams, creating cultural connections, or planning strategy, we have the solutions to help structure your meetings to deliver real benefits. Make the most of the RallyBright platform to uncover the best areas of focus for your team retreats, increasing your ROI and getting the most out of your people.\n \nLearn more from our website's team retreats page \nhere\n.\n \nHow to Use the RallyBright Profile Comparison Tool as a Team Leader or Coach\nTo bolster your team retreats even more, we have a new platform resource on how to use DISC with the RallyBright Profile Comparison tool. Team leaders and coaches can pair these together to better understand work patterns between team members. You can also use this combo to build better relationships with teammates, and stay ahead of conflict between individual team members. \nIf you're interested in using this guide for your teams or clients, check out the full resource \nhere\n.\n \n \n \n \n \nLet's make this relationship LI-official!\nFollow us on LinkedIn and you'll get insights, news and resources about resilient leadership and inclusive teamwork. So what are you waiting for? Click below to join us on our journey. \nFollow Us on LinkedIn\n \nRallyBright, 7801 Lonesome Pine Lane, Bethesda, MD \nManage preferences",
    "received_at": "2023-01-19T13:47:32+00:00",
    "sent_at": "2023-01-19T13:47:25+00:00",
    "date_extracted": "2025-04-04T21:43:00.576250"
  },
  {
    "email_id": "AAMkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NABGAAAAAABJx2zrZmcmSr_Pgu4EN5EVBwCSVYZbkD6mTqmbxqjcL3zJAAAAAAEMAACSVYZbkD6mTqmbxqjcL3zJAAC9-Xi6AAA=",
    "conversation_id": "AAQkADQxNDAwZWQ5LTg1ZmYtNGE2Ny05YmZkLTYwMDg1OGMyODA2NAAQALolP899YfJEsoPVOWpWz6g=",
    "from": "+12267996103",
    "to": "m.johnson@lcwmail.com",
    "reply_to": "noreply@skype.voicemail.microsoft.com",
    "in_reply_to": "N/A",
    "subject": "Voice Mail (23 seconds)",
    "body": "For just 2999 also you can get our Internet services for just 4999 a month. If you are interested in this limited time discount offer, please press one or to opt out, press 0.\nYou received a voice mail from \nCHATHAM, ON\n.\nThank you for using Transcription! If you don't see a transcript above, it's because the audio quality was not clear enough to transcribe.\nSet Up Voice Mail",
    "received_at": "2023-01-12T22:11:11+00:00",
    "sent_at": "2023-01-12T22:11:05+00:00",
    "date_extracted": "2025-04-04T21:43:00.163583"
  }
]