[
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjdHAAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAGuwaNvKalREuoAWEj6KLv4=",
    "from": "email@washingtonpost.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "email@washingtonpost.com",
    "in_reply_to": "N/A",
    "subject": "The Post Most: No survivors from D.C. plane crash, officials believe",
    "body": "Plus: The Trump executive orders and actions that are having... \n‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌  \n \n \nGet unlimited access for $1 a week\n \nYou heard it here first. Read the rest with The Post. →\n \nPUBLISHED BY \n \nREAD ONLINE\n | \nSIGN UP\nThe Post Most\n \n \n \n \nLive Updates\n \nNo survivors from D.C. plane crash, officials believe\n \n \n(Andrew Caballero-Reynolds/AFP/Getty Images)\nThe American Airlines plane operating as American Eagle Flight 5342 collided with an Army Black Hawk helicopter near Reagan National Airport. Search-and-rescue teams are pivoting to recovery operations.\n \nBy Annabelle Timsit, Victoria Craw and Kim Bellware\nRead more\n \n \nWhat we know about the people presumed dead in the D.C. plane crash\n \n \nThe Trump executive orders and actions that are having immediate impacts\n \n \nWhite House regroups as funding freeze chaos recalls first term’s travel ban \n \n \n \nOpinion\n \n Heather Long\n \nChina’s DeepSeek AI prowess is a wake-up call for Big Energy\n \n \n \n \n \nMusk team’s push to gut federal workforce bypassed key Trump officials\n \n \nThe civil service was once politicized. Then a president was assassinated.\n \n \n \nColumn\n \n Chris Richards\n \nChappell Roan keeps recalculating the price of fame\n \n \nWarmth is weakening the polar vortex. Here’s what it means for extreme cold.\n \n \nColumn\n \n Jerry Brewer\n \nThe Chiefs’ hidden superpower: They’re great without looking good\n \n \nADVERTISEMENT\n \n \n \nEarthquake sensors could help track a different threat: Falling space debris\n \n \nU.S. economic growth slowed to 2.3 percent in late 2024\n \n \nWoman delivers her baby at Krispy Kreme, nicknames him Glaze\n \n \n \nOpinion\n \n The Editorial Board\n \nYour robot chauffeur is on its way. Welcome it.\n \n \nColumn\n \n Carolyn Hax\n \nHow to intervene with stubborn mom facing cognitive decline?\n \n \nADVERTISEMENT\n \n \nQUIZ\n \nA glitzy adaptation in today's On the Record\n \n \nSenate Confirmation Hearings\n \nLive Updates\n \nKash Patel breaks with Trump on Jan. 6 clemency, defends record\n \n \n(Tom Brenner for The Post )\nPresident Trump’s pick for FBI director, Kash Patel, faces Senators’ questions in his confirmation hearing. \nBy Washington Post Staff\nRead more\n \n \nLive Updates\n \nTulsi Gabbard questioned over her controversial statements on Russia and Syria\n \n \nLive Updates\n \nAsked if measles vaccine causes autism, RFK Jr. says he wants to see data\n \n \n \nYOU MIGHT ALSO LIKE\n \nSign up ➝\n \n \n \nYou received this email because you signed up for The Post Most or because it is included in your subscription.\nManage newsletters\n | \nUnsubscribe\n1301 K St NW,\nWashington DC 20071\nDOWNLOAD OUR APP\n   \n \n \n \n \n \n©2025 The Washington Post | \nPrivacy Policy\n | \nHelp & Contact",
    "received_at": "2025-01-30T17:22:06+00:00",
    "sent_at": "2025-01-30T17:21:57+00:00",
    "date_extracted": "2025-04-04T22:26:45.447882"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjdGAAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAM4iXttLG0VKked87l86eKg=",
    "from": "info@included.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "info@included.com",
    "in_reply_to": "N/A",
    "subject": "Psychological Safety is a Health and Safety Issue, and it’s Time We Treated It That Way",
    "body": "The truth is: if people don’t feel safe to speak up, contribute, or challenge, they’re not truly safe.\n \n \nDear colleagues,\nWe hope 2025 has begun with promise and positivity for you and yours.\n \nThis year, the world is at a pivotal moment. As global headlines are dominated by significant political shifts, such as Trump's re-election, and corporate giants like META redefine their EDI commitments, the need for meaningful change has never been more urgent. It's time for organisations to take a hard look at their approach to EDI - evolving strategies and focusing more strongly on impact and actions that truly make a difference.\nIn this action-packed edition, you'll find: \nWhy \nPsychological Safety is a critical Health and Safety issue\n, and how to address it effectively\nAn invitation to our \n\"Beyond SRA Compliance – Inclusive Leadership for a Thriving Culture\"\n event\nExciting details about our \nInternational Women's Day\n workshops\nInsights from our CEO in \"\nEDI Is Evolving - And It’s Time to Act!\n\"\nA snapshot of our \n2025 predictions\n shaping the future of EDI\nAn opportunity to join our \naudiobook competition\n!\n \nClick on the links below to dive deeper into each topic.\n \nAs always, we’re here for any questions or additional information you may need.\n \nLet’s make 2025 a year of real progress!\n \nWarm regards,\nYour \nIncluded\n Team \n  \nPsychological Safety is a Health and Safety Issue - And It’s Time We Treated It That Way\nWhen we talk about health and safety at work, we often think about physical risks - safety protocols, fire drills, and injury prevention. But there’s another critical element that’s often overlooked: psychological safety.\nPsychological safety isn’t a \"nice-to-have\" or a soft issue - it’s a fundamental requirement for organisations that want to foster inclusion, retain talent, and build trust. And this is where Equity, Diversity, and Inclusion (EDI) comes into play.\n \nRead now\n \nBeyond SRA Compliance – Inclusive Leadership for a Thriving Culture\nJoin us for an exclusive free 60-minute, online event designed for HR and People professionals working in law firms and legal teams on Thursday 6 February 1200-1300 GMT.\n \nThe Solicitors Regulation Authority (SRA) has set a clear mandate for accountability, inclusive practices, and cultural transparency. But are you leveraging these regulations to create lasting change and embed inclusive leadership at the highest levels?\nSign-up here\n \nInternational Women’s Day 2025: Accelerate Action\nIn 2025, the world stands at a crossroads. With global headlines dominated by political shifts, such as Trump’s re-election, and evolving corporate strategies like META and Amazon’s reshaped DEI commitments, there’s a pressing need to accelerate tangible action on gender equity. This year’s sessions focus on equipping organisations and teams to navigate these challenges while advancing a bold, urgent vision for equity.\n \nFind out more\n \nEDI Is Evolving - And It’s Time to Act!\nWith recent events focusing attention on Equity, Diversity, and Inclusion (EDI), \nIncluded’s\n CEO, Michelle Sequeira, encourages you to take a step back and consider the bigger picture.\nResistance to progress is nothing new – history shows us that meaningful change is often met with pushback. From civil rights movements to LGBTQIA+ rights, every major shift has faced challenges. But these challenges are proof that change is happening...\n \nRead more\n \nPredictions for EDI in 2025\nHere we look ahead to predictions for 2025, including areas such as AI and data analytics, pay equity and transparency, sustainable ESG, global EDI standardisation and many others.\n  \nRead more\n \nThe Key to Inclusion Audiobook\n \nWe are delighted to share that our book, \nThe Key to Inclusion\n, is soon to be available in audio format. This book, written in 2022, is a practical guide to Diversity, Equity and Belonging for You, Your Team and Your Organisation. Recognising the importance of diversity, belonging and equity is not enough and this book has the practical guidance needed to think differently and make true inclusion a reality.\nTo mark this exciting moment, we are offering you the chance of winning a free audio book code. Please visit the below link for further information. Good Luck!\nFind out more\n \nFind out more about \nIncluded\n’s approach to diversity \nhere\n and take a look at our \nImpact Report\n. \nPlease \nget in touch\n with us anytime to have a conversation about making your organisation more diverse and more inclusive.  We look forward to hearing from you. \nFrom all of us at \nIncluded\n \n \n \nYou are receiving this email because you subscribed to the \nIncluded \nemail newsletter. \nIncluded \nis committed to ensuring the security and protection of all data we process. For more information on how we use your data, read \nour privacy policy\n. \nWant to change how you receive these emails?\nYou can \nupdate your preferences\n or \nunsubscribe from this list\nCopyright © 2025, Frost Included, trading as Included. All rights reserved.\n  \n ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏ ﻿͏  ﻿͏  ﻿͏  ﻿͏",
    "received_at": "2025-01-30T16:59:10+00:00",
    "sent_at": "2025-01-30T16:58:56+00:00",
    "date_extracted": "2025-04-04T22:26:45.569171"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjdFAAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAL7_BNknPQpBmEydaEQ0GW4=",
    "from": "bchristie@trusaic.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "bchristie@trusaic.com",
    "in_reply_to": "N/A",
    "subject": "Workplace Equity Weekly | Expanding Your Pay Equity Analysis",
    "body": "Why you should go beyond gender and race in your pay equity analysis.\n \nWorkplace Equity Weekly\nJanuary 30, 2025\nBLOG\nGoing Beyond Gender and Race In Your Pay Equity Analysis\nConsider including disability in your pay equity analyses to ensure compliance with U.S. and European Union legislation. Learn how Trusaic’s software supports you.  \nREAD NOW\n \n \nKey Resources\nPay Equity Deep Dive Series\nLevel up your pay equity knowledge with Gail Greenfield’s comprehensive blog series. Each blog provides actionable strategies you can apply at your organization. \n \nACCESS NOW\n \nGlobal Pay Transparency Center\nAccess comprehensive pay transparency guides for 50+ jurisdictions. Simplify compliance and meet regulatory requirements worldwide.\n \nACCESS NOW\n \nWebinar\n \nFrom Job Evaluation to Pay Equity: A Global Approach to Compliance\nWATCH NOW\n \nSurvey Participation\n2025 State of Pay Equity Policies and Practices\nOur 2025 pay equity survey is now open for participation. This survey is looking to glean insights about how your organization approaches pay equity. It should take 15 minutes to complete and you will receive a complimentary copy of the results.  \nParticipate Now \n \nTrusaic, 520 S Grand Ave, Suite 200, Los Angeles, CA 90071, United States, 213-382-1115 \nUnsubscribe\n \nManage preferences",
    "received_at": "2025-01-30T16:07:32+00:00",
    "sent_at": "2025-01-30T16:02:02+00:00",
    "date_extracted": "2025-04-04T22:26:45.296932"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjdEAAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAKMbGQF_fWxIvXowhrJAtaE=",
    "from": "info@wintersgroup.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "info@wintersgroup.com",
    "in_reply_to": "N/A",
    "subject": "We Can't Talk About That at Work! ",
    "body": "Don’t Wait: In 2 weeks, this program kicks off! Learn how to handle polarizing topics with confidence and turn roadblocks into breakthroughs\n \nIn today’s divided and fast-changing world, the need for inclusive, productive conversations has never been greater. Yet, addressing polarizing topics at work—race, religion, politics, or other sensitive issues—can feel overwhelming.\n \nThat’s why we’re offering \nWe Can’t Talk About That at Work! Mastering the Art of Polarizing Topics\n, a transformative program starting in just\n \n2 weeks!\n \nIn this 3-session series, you’ll gain:\nPractical tools\n to manage emotions, de-escalate tension, and navigate tough topics\nProven frameworks\n from the bestselling and award-winning book \nWe Can’t Talk About That at Work!\nReal-world strategies\n to foster empathy, mutual understanding, and collaboration\nExclusive Bonus:\n \nSign up for all three sessions and receive a \nFREE digital copy of the Second Edition of \nWe Can’t Talk About That at Work\n!\n \nSeats are limited\n, and time is running out to secure your spot for the first session on February 12. Don’t miss this opportunity to invest in skills that will set you apart in navigating today’s challenges. \nRegister for one or all three sessions here.\n \nYours Inclusively,\nMary-Frances Winters, Founder and CEO\nMareisha N. Winters Reese, President and COO\n \nRegister Now for This New Series\n \nDon't let divisive issues become roadblocks. Invest in building stronger, more resilient professional relationships today when you register for either one or all of these sessions.\nSession 1: Managing the “I” in Inclusive Conversations, February 12, 2025 \nSession 2: Talking About Differences with Humility, February 26, 2025 \nSession 3: Bridging the Divide for Mutual Understanding, March 12, 2025\n \nWhether you register for one or all three, each session stands on its own, offering effective frameworks and strategies to build your skills and confidence in navigating tricky conversations. The full series was developed to be an active learning experience with each session building upon the last. \nBased on the award-winning and bestselling book \nWe Can’t Talk About That at Work! How to Talk About Race, Religion, Politics, and Other Polarizing Topics\n \nby \nMary-Frances Winters \nand \nMareisha N. Reese\n, this program couldn't be more timely.\n \nSeats are limited - register now!\n \n \n \n \n \nThe Winters Group, 8116 South Tryon Street, Ste. B3-260, Charlotte, North Carolina 28273, United States \nUnsubscribe\n \nManage preferences",
    "received_at": "2025-01-30T15:48:31+00:00",
    "sent_at": "2025-01-30T15:48:03+00:00",
    "date_extracted": "2025-04-04T22:26:45.357005"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjdDAAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQACrMyv6BaW1CvxXeljtwojA=",
    "from": "corey@findem.ai",
    "to": "l.baker@lcwmail.com",
    "reply_to": "corey@findem.ai",
    "in_reply_to": "N/A",
    "subject": " Is your tech stack holding you back?",
    "body": "Transform recruiting outcomes with smarter tech\n \nHi Larry,\n \nToday’s talent tech stacks are supposed to accelerate recruiting, but more often, they’re slowing teams down. High costs, scattered tools, and ineffective strategies are creating roadblocks instead of solutions. \n \nJoin us for our first Talent Leaders Forum, \nLeveraging Technology for Better Recruiting Outcomes\n, where Shane Noe, Marilyn Pearson Hendricks, and Ben Eubanks will explore how to optimize, consolidate, and future-proof your talent tech stack. \n \nIn this roundtable, you’ll learn\n: \nHow to recognize and prevent tech overload \nThe critical role of IT in making your tech stack smarter\nReal-world examples of tech stack optimization\nDon’t miss this opportunity to gain actionable insights and prepare for the future of talent acquisition. \n \n \nSubscribe to our newsletter\n for insider tips on trends, \nevents, and more—delivered straight to your inbox!\n \nCarefully crafted with ❤️ by Findem\nFindem, 702 Marshall Street, Redwood City, California, 94063, United States\nUnsubscribe\n \nManage Preferences",
    "received_at": "2025-01-30T14:03:06+00:00",
    "sent_at": "2025-01-30T14:02:54+00:00",
    "date_extracted": "2025-04-04T22:26:45.245604"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjdCAAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAGh9Vite0r9Jr1Sm0ijqq3E=",
    "from": "luiza@masteringculturaldifferences.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "luiza@masteringculturaldifferences.com",
    "in_reply_to": "N/A",
    "subject": "🛠️ Master the Art of Nonverbal Communication Across Cultures",
    "body": "Continue reading to master the art of nonverbal communication across cultures ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌\n \n \nView in Web Browser\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nHello Larry!\n \n💡\n \nReady to turn silent misunderstandings into meaningful connections?\n \n \n🔗\n Let’s Recap: \nIn my last email, we uncovered a silent challenge: misreading or ignoring nonverbal cues in culturally diverse organizations. \nThese subtle signals—eye contact, gestures, tone of voice—carry significant meaning. But when they’re misinterpreted, they can lead to disengagement, tension, and missed opportunities to create a truly inclusive culture. \nThe good news? With the right strategies, you can unlock the power of nonverbal communication to foster understanding and connection. \n \n🛠️\n Actionable Strategies to Bridge the Nonverbal Gap \n1️⃣ \nEducate Your Team on Cultural Differences\nHost training sessions that focus on how nonverbal cues vary across cultures. For example, some cultures see direct eye contact as a sign of confidence, while others view it as disrespect. Building awareness is the first step to creating empathy and reducing misinterpretation. \n \n2️⃣ E\nncourage Curiosity, Not Assumptions\nTrain employees to approach nonverbal cues with curiosity rather than judgment. A simple question like, “\nI noticed you were quiet in the meeting—what are your thoughts?\n” can uncover valuable insights and show respect for cultural norms. \n \n3️⃣ \nPractice Active Observation\nTeach your team to tune into patterns of nonverbal behavior rather than isolated actions. This helps avoid jumping to conclusions based on a single moment. Patterns provide context and reveal a deeper understanding. \n \n4️⃣ \nModel Inclusive Nonverbal Behavior\nLeaders set the tone. Encourage managers to use open body language, welcoming gestures, and active listening cues. These small shifts can create a more inclusive atmosphere where employees feel seen and respected. \n \n5️⃣\n \nIncorporate Feedback Loops\nRegularly check in with employees to understand how communication styles are impacting their experience. This feedback ensures that cultural nuances are recognized and addressed over time. \n \n🌟\n Imagine the Impact: \nPicture this: \nMeetings where diverse perspectives flow effortlessly because everyone feels understood. \nA team culture rooted in mutual respect and curiosity about one another’s unique ways of communicating. \nA workplace where nonverbal signals strengthen, rather than strain, collaboration. \nThis is the power of cultural competence in action. \n \n📅\n Let’s Build This Together: \nWant tailored strategies to help your team navigate the nuances of nonverbal communication? Schedule a \ncomplimentary call\n with me today. Together, we’ll design a roadmap to bridge the cultural communication gap and empower your workforce. \n \n👉\n \nClick here to schedule your complimentary call.\n \n \nHere’s to creating workplaces where every gesture matters! \n \nBye for now, \nLuiza\n___________________________________\n \nLuiza Dreasher, President and CEO (she/her/hers)\nMastering Cultural Differences \nI work with leaders who want to create a work environment where all employees feel valued and want to stay.\n \n \n \n \n \n \nUnsubscribe\n | Sent by Mastering Cultural Differences \n1350 Sextant Avenue West • Roseville, MN • 55113-3134",
    "received_at": "2025-01-30T13:03:25+00:00",
    "sent_at": "2025-01-30T13:03:10+00:00",
    "date_extracted": "2025-04-04T22:26:45.311842"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjdBAAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAGhIfOu1_UlMkfXPJmmoSOU=",
    "from": "no-reply@dropbox.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "no-reply@dropbox.com",
    "in_reply_to": "N/A",
    "subject": "Last week's updates in your shared folders",
    "body": "Activity in \nShared Folders\nHere's what happened in your shared folders last week\nBOSTON SCIENTIFIC\nBSC_ARCH_Meeting Agenda & NOTES_1.22.25.docx\nRebecca edited \nThursday 1/23/2025 \nUnderstanding Your Cultural Lens_23J…forBSC.pptx\nRebecca added \nThursday 1/23/2025 \nUnderstanding Your Cultural Lens_202…update.pptx\nRebecca added \nThursday 1/23/2025 \nCANADA_Leading Inclusively-Solo facili…024_v7.pptx\nRebecca edited \nThursday 1/23/2025 \nCANADA_Leading Inclusively_AGENDA.xlsx\nRebecca added \nThursday 1/23/2025 \n3 other events ...\nNBCUNIVERSAL\nUnderstanding-AAPI-Experience_2024_FINAL.pptx\nRebecca added \nThursday 1/23/2025 \nLatino voices on family, sports, legacy…anguage.pdf\nRebecca added \nThursday 1/23/2025 \nLatino voices on family, sports, legacy…nguage.docx\nRebecca edited \nThursday 1/23/2025 \nLatine Spotlight Links.docx\nAndrea added \nThursday 1/23/2025 \nQRCode for NBCU_ Spotlight Latine in the U.S..png\nAndrea added \nThursday 1/23/2025 \n1 other event ...\nLeading Inclusively Regionalization\nLeading Inclusively in CANADA_Takeaway.pdf\nRebecca edited \nWednesday 1/22/2025 \nLeading Inclusively in CANADA_Takeaway.pptx\nRebecca edited \nWednesday 1/22/2025 \nFollow specific folders and get focused updates\nFollow folders to get more detailed insights, reported instantly or once per day. \nChoose a folder to follow\nDon’t want these weekly digests? \nUnsubscribe\n1800 Owens St, San Francisco, CA 94158 © 2025 Dropbox",
    "received_at": "2025-01-30T11:22:34+00:00",
    "sent_at": "2025-01-30T11:22:25+00:00",
    "date_extracted": "2025-04-04T22:26:45.367518"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjdAAAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAO2cLWwfpGNLpiek1IqHxmM=",
    "from": "n.barile@lcwmail.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "n.barile@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "Re: Gap & payments",
    "body": "OK thank you!\nFrom:\n Larry Baker <l.baker@lcwmail.com>\nSent:\n Wednesday, January 29, 2025 2:29 PM\nTo:\n Nicole Barile <n.barile@lcwmail.com>\nSubject:\n RE: Gap & payments\n \n \nAt this point, the back pay is most important to me. After that is paid, I can discuss GAP, Feb. 11\nth\n, and Group M or whoever. But, the back pay is the priority for me. \n \nFrom:\n Nicole Barile <n.barile@lcwmail.com> \nSent:\n Wednesday, January 29, 2025 1:02 PM\nTo:\n Larry Baker <l.baker@lcwmail.com>\nSubject:\n Re: Gap & payments\n \nOk thanks & yes, in addition to.\n \nOne other option - which I know does not solve your problem of the money owed to you - is that we delay your termination from LCW until after the Gap training & possibly until after the Feb.11th webinar.\n \nAt this point, would you be willing to even stay on another week or two to deliver these & still get paid a salary?\n \nI would of course try to get you the money owed to you as well, but as you know can't promise anything.\n \nThank you!\n \nFrom:\n Larry Baker <\nl.baker@lcwmail.com\n>\nSent:\n Wednesday, January 29, 2025 1:57 PM\nTo:\n Nicole Barile <\nn.barile@lcwmail.com\n>\nSubject:\n RE: Gap & payments\n \n \nNicole, \n \nThe $500 would have to be in addition to the $4,490.96. \n \nNow for the 60 sessions for Group M, I would need to see how that number would work for me with any other financial resources I will try to seek to receive from other sources (Unemployment). We can table all of that until you find out about GAP.\nThanks,\n \nLBJ\n \nFrom:\n Nicole Barile <\nn.barile@lcwmail.com\n> \nSent:\n Wednesday, January 29, 2025 12:49 PM\nTo:\n Larry Baker <\nl.baker@lcwmail.com\n>\nSubject:\n Gap & payments\n \nHi Larry,\n \nThanks for the candid chat today. I'm going to find out as much as I can asap.\n \nFYI, if you were to get paid the money owed to you & would do the Gap training on Feb.5, we would offer $500 for the Gap session.\nIf you end up doing the BSC sessions (which I believe are 3 hours, and there are about 60 of them), we could offer you $500 per, totaling around $30,000. \n \nTalk soon!\nNicole\n \nNicole Barile\n \n(She/Her)\nChief Operating Officer\nLCW\n \nWebsite\n \n|\n \nTwitter\n \n|\n \nFacebook\n \n|\n \nLinkedIn\nView our upcoming events\n | \nSign-up for our newsletter",
    "received_at": "2025-01-29T19:34:57+00:00",
    "sent_at": "2025-01-29T19:34:54+00:00",
    "date_extracted": "2025-04-04T22:26:45.270591"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjc-AAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAO2cLWwfpGNLpiek1IqHxmM=",
    "from": "n.barile@lcwmail.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "n.barile@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "Re: Gap & payments",
    "body": "Ok thanks & yes, in addition to.\nOne other option - which I know does not solve your problem of the money owed to you - is that we delay your termination from LCW until after the Gap training & possibly until after the Feb.11th webinar.\nAt this point, would you be willing to even stay on another week or two to deliver these & still get paid a salary?\nI would of course try to get you the money owed to you as well, but as you know can't promise anything.\nThank you!\nFrom:\n Larry Baker <l.baker@lcwmail.com>\nSent:\n Wednesday, January 29, 2025 1:57 PM\nTo:\n Nicole Barile <n.barile@lcwmail.com>\nSubject:\n RE: Gap & payments\n \n \nNicole, \n \nThe $500 would have to be in addition to the $4,490.96. \n \nNow for the 60 sessions for Group M, I would need to see how that number would work for me with any other financial resources I will try to seek to receive from other sources (Unemployment). We can table all of that until you find out about GAP.\nThanks,\n \nLBJ\n \nFrom:\n Nicole Barile <n.barile@lcwmail.com> \nSent:\n Wednesday, January 29, 2025 12:49 PM\nTo:\n Larry Baker <l.baker@lcwmail.com>\nSubject:\n Gap & payments\n \nHi Larry,\n \nThanks for the candid chat today. I'm going to find out as much as I can asap.\n \nFYI, if you were to get paid the money owed to you & would do the Gap training on Feb.5, we would offer $500 for the Gap session.\nIf you end up doing the BSC sessions (which I believe are 3 hours, and there are about 60 of them), we could offer you $500 per, totaling around $30,000. \n \nTalk soon!\nNicole\n \nNicole Barile\n \n(She/Her)\nChief Operating Officer\nLCW\n \nWebsite\n \n|\n \nTwitter\n \n|\n \nFacebook\n \n|\n \nLinkedIn\nView our upcoming events\n | \nSign-up for our newsletter",
    "received_at": "2025-01-29T19:01:52+00:00",
    "sent_at": "2025-01-29T19:01:50+00:00",
    "date_extracted": "2025-04-04T22:26:45.298393"
  },
  {
    "email_id": "AAMkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZABGAAAAAABeNzZjrrwVSbYdigYaF_L9BwAqur5AFaY8TaE7XjQQGGIUAAAAAAEMAAAqur5AFaY8TaE7XjQQGGIUAAXpCjc_AAA=",
    "conversation_id": "AAQkAGI2MjM1NmEwLTQ3MDUtNDExMy1hMTIyLTk3YmQzNWY0MWVhZAAQAO2cLWwfpGNLpiek1IqHxmM=",
    "from": "n.barile@lcwmail.com",
    "to": "l.baker@lcwmail.com",
    "reply_to": "n.barile@lcwmail.com",
    "in_reply_to": "N/A",
    "subject": "Gap & payments",
    "body": "Hi Larry,\nThanks for the candid chat today. I'm going to find out as much as I can asap.\nFYI, if you were to get paid the money owed to you & would do the Gap training on Feb.5, we would offer $500 for the Gap session.\nIf you end up doing the BSC sessions (which I believe are 3 hours, and there are about 60 of them), we could offer you $500 per, totaling around $30,000. \nTalk soon!\nNicole\nNicole Barile\n \n(She/Her)\nChief Operating Officer\nLCW\nWebsite\n \n|\n \nTwitter\n \n|\n \nFacebook\n \n|\n \nLinkedIn\nView our upcoming events\n | \nSign-up for our newsletter",
    "received_at": "2025-01-29T18:48:44+00:00",
    "sent_at": "2025-01-29T18:48:40+00:00",
    "date_extracted": "2025-04-04T22:26:45.264700"
  }
]